{
  "title": "Keycloak 26.0.0 released",
  "link": "https://www.keycloak.org/2024/10/keycloak-2600-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2024-10-04T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   HIGHLIGHTS   ORGANIZATIONS SUPPORTED  Starting with Keycloak 26, the Organizations feature is fully supported.   CLIENT LIBRARIES UPDATES  DEDICATED RELEASE CYCLE FOR THE CLIENT LIBRARIES  From this release, some of the Keycloak client libraries will have release cycle independent of the Keycloak server release cycle. The 26.0.0 release may be the last one when the client libraries are released together with the Keycloak server. But from now on, the client libraries may be released at a different time than the Keycloak server.  The client libraries are these artifacts:   * Java admin client - Maven artifact org.keycloak:keycloak-admin-client   * Java authorization client - Maven artifact org.keycloak:keycloak-authz-client   * Java policy enforcer - Maven artifact org.keycloak:keycloak-policy-enforcer  It is possible that in the future, some more libraries will be included.  The client libraries are supported with Java 8, so it is possible to use them with the client applications deployed on the older application servers.  COMPATIBILITY OF THE CLIENT LIBRARIES WITH THE SERVER  Beginning with this release, we are testing and supporting client libraries with the same server version and a few previous major server versions.  For details about supported versions of client libraries with server versions, see the .   USER SESSIONS PERSISTED BY DEFAULT  Keycloak 25 introduced the feature persistent-user-sessions. With this feature enabled all user sessions are persisted in the database as opposed to the previous behavior where only offline sessions were persisted. In Keycloak 26, this feature is enabled by default. This means that all user sessions are persisted in the database by default.  It is possible to revert this behavior to the previous state by disabling the feature. Follow the Volatile user sessions section in guide for more details.  For information on how to upgrade, see the .   NEW DEFAULT LOGIN THEME  There is now a new version (v2) of the keycloak login theme, which provides an improved look and feel, including support for switching automatically to a dark theme based on user preferences.  The previous version (v1) is now deprecated, and will be removed in a future release.  For all new realms, keycloak.v2 will be the default login theme. Also, any existing realm that never explicitly set a login theme will be switched to keycloak.v2.   HIGHLY AVAILABLE MULTI-SITE DEPLOYMENTS  Keycloak 26 introduces significant improvements to the recommended HA multi-site architecture, most notably:   * Keycloak deployments are now able to handle user requests simultaneously in    both sites.   * Active monitoring of the connectivity between the sites is now required to    update the replication between the sites in case of a failure.   * The loadbalancer blueprint has been updated to use the AWS Global Accelerator    as this avoids prolonged fail-over times caused by DNS caching by clients.   * Persistent user sessions are now a requirement of the architecture.    Consequently, user sessions will be kept on Keycloak or Infinispan upgrades.  For information on how to migrate, see the .   ADMIN BOOTSTRAPPING AND RECOVERY  In the past, regaining access to a Keycloak instance when all admin users were locked out was a challenging and complex process. Recognizing these challenges and aiming to significantly enhance the user experience, Keycloak now offers several straightforward methods to bootstrap a temporary admin account and recover lost admin access.  It is now possible to run the start or start-dev commands with specific options to create a temporary admin account. Additionally, a new dedicated command has been introduced, which allows users to regain admin access without hassle.  For detailed instructions and more information on this topic, refer to the guide.   OPENTELEMETRY TRACING PREVIEW  The underlying Quarkus support for OpenTelemetry Tracing has been exposed to Keycloak and allows obtaining application traces for better observability. It helps to find performance bottlenecks, determine the cause of application failures, trace a request through the distributed system, and much more. The support is in preview mode, and we would be happy to obtain any feedback.  For more information, see the guide.   OPENID FOR VERIFIABLE CREDENTIAL ISSUANCE  The OpenID for Verifiable Credential Issuance (OID4VCI) is still an experimental feature in Keycloak, but it was greatly improved in this release. You will find significant development and discussions in the . Anyone from the Keycloak community is welcome to join.  Many thanks to all members of the OAuth SIG group for the participation on the development and discussions about this feature. Especially thanks to the , , , , and   DPOP IMPROVEMENTS  The DPoP (OAuth 2.0 Demonstrating Proof-of-Possession) preview feature has improvements. The DPoP is now supported for all grant types. With previous releases, this feature was supported only for the authorization_code grant type. Support also exists for the DPoP token type on the UserInfo endpoint.  Many thanks to for the contribution.   REMOVAL OF GELF LOGGING HANDLER  GELF support has been deprecated for a while now, and with this release it has been finally removed from Keycloak. Other log handlers are available and fully supported to be used as a replacement of GELF, for example Syslog. For details see the .   LIGHTWEIGHT ACCESS TOKENS FOR ADMIN REST API  Lightweight access tokens can now be used on the admin REST API. The security-admin-console and admin-cli clients are now using lightweight access tokens by default, so “Always Use Lightweight Access Token” and “Full Scope Allowed” are now enabled on these two clients. However, the behavior in the admin console should effectively remain the same. Be cautious if you have made changes to these two clients and if you are using them for other purposes.   KEYCLOAK JAVASCRIPT ADAPTER NOW STANDALONE  Keycloak JavaScript adapter is now a standalone library and is therefore no longer served statically from the Keycloak server. The goal is to de-couple the library from the Keycloak server, so that it can be refactored independently, simplifying the code and making it easier to maintain in the future. Additionally, the library is now free of third-party dependencies, which makes it more lightweight and easier to use in different environments.  For a complete breakdown of the changes consult the .   HOSTNAME V1 FEATURE REMOVED  The deprecated hostname v1 feature was removed. This feature was deprecated in Keycloak 25 and replaced by hostname v2. If you are still using this feature, you must migrate to hostname v2. For more details, see the and .   AUTOMATIC REDIRECT FROM ROOT TO RELATIVE PATH  User is automatically redirected to the path where Keycloak is hosted when the http-relative-path property is specified. It means when the relative path is set to /auth, and the user access localhost:8080/, the page is redirected to localhost:8080/auth.  The same applies to the management interface when the http-management-relative-path or http-relative-path property is specified.  It improves user experience as users no longer need to set the relative path to the URL explicitly.   PERSISTING REVOKED ACCESS TOKENS ACROSS RESTARTS  In this release, revoked access tokens are written to the database and reloaded when the cluster is restarted by default when using the embedded caches.  For information on how to migrate, see the .   CLIENT ATTRIBUTE CONDITION IN CLIENT POLICIES  The condition based on the client-attribute was added into Client Policies. You can use condition to specify for the clients with the specified client attribute having a specified value. It is possible to use either an AND or OR condition when evaluating this condition as mentioned in the documentation for client policies.  Many thanks to for the contribution.   SPECIFY DIFFERENT LOG LEVELS FOR LOG HANDLERS  It is possible to specify log levels for all available log handlers, such as console, file, or syslog. The more fine-grained approach provides the ability to control logging over the whole application and be tailored to your needs.  For more information, see the .   PROXY OPTION REMOVED  The deprecated proxy option was removed. This option was deprecated in Keycloak 24 and replaced by the proxy-headers option in combination with hostname options as needed. For more details, see and .   OPTION PROXY-TRUSTED-ADDRESSES ADDED  The proxy-trusted-addresses can be used when the proxy-headers option is set to specify a allowlist of trusted proxy addresses. If the proxy address for a given request is not trusted, then the respective proxy header values will not be used.   OPTION PROXY-PROTOCOL-ENABLED ADDED  The proxy-protocol-enabled option controls whether the server should use the HA PROXY protocol when serving requests from behind a proxy. When set to true, the remote address returned will be the one from the actual connecting client.   OPTION TO RELOAD TRUST AND KEY MATERIAL ADDED  The https-certificates-reload-period option can be set to define the reloading period of key store, trust store, and certificate files referenced by https-* options. Use -1 to disable reloading. Defaults to 1h (one hour).   OPTIONS TO CONFIGURE CACHE MAX-COUNT ADDED  The --cache-embedded-${CACHE_NAME}-max-count= can be set to define an upper bound on the number of cache entries in the specified cache.   THE HTTPS-TRUST-STORE-* OPTIONS HAVE BEEN UNDEPRECATED  Based on the community feedback, we decided to undeprecate https-trust-store-* options to allow better granularity in trusted certificates.   THE JAVA-KEYSTORE KEY PROVIDER SUPPORTS MORE ALGORITHMS AND VAULT SECRETS  The java-keystore key provider, which allows loading a realm key from an external java keystore file, has been modified to manage all Keycloak algorithms. Besides, the keystore and key secrets, needed to retrieve the actual key from the store, can be configured using the . Therefore a Keycloak realm can externalize any key to the encrypted file without sensitive data stored in the database.  For more information about this subject, see .   ADDING SUPPORT FOR ECDH-ES ENCRYPTION KEY MANAGEMENT ALGORITHMS  Now Keycloak allows configuring ECDH-ES, ECDH-ES+A128KW, ECDH-ES+A192KW or ECDH-ES+A256KW as the encryption key management algorithm for clients. The Key Agreement with Elliptic Curve Diffie-Hellman Ephemeral Static (ECDH-ES) specification introduces three new header parameters for the JWT: epk, apu and apv. Currently Keycloak implementation only manages the compulsory epk while the other two (which are optional) are never added to the header. For more information about those algorithms please refer to the .  Also, a new key provider, ecdh-generated, is available to generate realm keys and support for ECDH algorithms is added into the Java KeyStore provider.  Many thanks to for the contribution.   SUPPORT FOR MULTIPLE INSTANCES OF A SOCIAL BROKER IN A REALM  It is now possible to have multiple instances of the same social broker in a realm.  Most of the time a realm does not need multiple instances of the same social broker. But due to the introduction of the organization feature, it should be possible to link different instances of the same social broker to different organizations.  When creating a social broker, you should now provide an Alias and optionally a Display name just like any other broker.   NEW GENERALIZED EVENT TYPES FOR CREDENTIALS  There are now generalized events for updating (UPDATE_CREDENTIAL) and removing (REMOVE_CREDENTIAL) a credential. The credential type is described in the credential_type attribute of the events. The new event types are supported by the Email Event Listener.  The following event types are now deprecated and will be removed in a future version: UPDATE_PASSWORD, UPDATE_PASSWORD_ERROR, UPDATE_TOTP, UPDATE_TOTP_ERROR, REMOVE_TOTP, REMOVE_TOTP_ERROR   CUSTOMIZABLE FOOTER IN LOGIN THEMES  The template.ftl file in the base/login and the keycloak.v2/login theme now allows to customize the footer of the login box. This can be used to show common links or include custom scripts at the end of the page.  The new footer.ftl template provides a content macro that is rendered at the bottom of the \"login box\".   KEYCLOAK CR SUPPORTS STANDARD SCHEDULING OPTIONS  The Keycloak CR now exposes first class properties for controlling the scheduling of your Keycloak Pods.  For more details, see the .   KEYCLOAKREALMIMPORT CR SUPPORTS PLACEHOLDER REPLACEMENT  The KeycloakRealmImport CR now exposes spec.placeholders to create environment variables for placeholder replacement in the import.  For more details, see the .   CONFIGURING THE LDAP CONNECTION POOL  In this release, the LDAP connection pool configuration relies solely on system properties.  For more details, see .   INFINISPAN MARSHALLING CHANGES TO INFINISPAN PROTOSTREAM  Marshalling is the process of converting Java objects into bytes to send them across the network between Keycloak servers. With Keycloak 26, we changed the marshalling format from JBoss Marshalling to Infinispan Protostream.  Warning JBoss Marshalling and Infinispan Protostream are not compatible with each other and incorrect usage may lead to data loss. Consequently, all caches are cleared when upgrading to this version.  Infinispan Protostream is based on (proto 3), which has the advantage of backwards/forwards compatibility.   REMOVAL OF OSGI METADATA  Since all of the Java adapters that used OSGi metadata have been removed we have stopped generating OSGi metadata for our jars.   GROUP-RELATED EVENTS NO LONGER FIRED WHEN REMOVING A REALM  With the goal of improving the scalability of groups, they are now removed directly from the database when removing a realm. As a consequence, group-related events like the GroupRemovedEvent are no longer fired when removing a realm.  For information on how to migrate, see the .   IDENTITY PROVIDERS NO LONGER AVAILABLE FROM THE REALM REPRESENTATION  As part of the improvements around the scalability of realms and organizations when they have many identity providers, the realm representation no longer holds the list of identity providers. However, they are still available from the realm representation when exporting a realm.  For information on how to migrate, see the .   SECURING APPLICATIONS DOCUMENTATION CONVERTED INTO THE GUIDE FORMAT  The Securing Applications and Services documentation was converted into the new format similar to the Server Installation and Configuration documentation converted in the previous releases. The documentation is now available under .   REMOVAL OF LEGACY COOKIES  Keycloak no longer sends _LEGACY cookies, which where introduced as a work-around to older browsers not supporting the SameSite flag on cookies.  The _LEGACY cookies also served another purpose, which was to allow login from an insecure context. Although, this is not recommended at all in production deployments of Keycloak, it is fairly frequent to access Keycloak over http outside of localhost. As an alternative to the _LEGACY cookies Keycloak now doesn’t set the secure flag and sets SameSite=Lax instead of SameSite=None when it detects an insecure context is used.   PROPERTY ORIGIN IN THE USERREPRESENTATION IS DEPRECATED  The origin property in the UserRepresentation is deprecated and planned to be removed in future releases.  Instead, prefer using the federationLink property to obtain the provider to which a user is linked with.   UPGRADING  Before upgrading refer to for a complete list of changes.   ALL RESOLVED ISSUES   DEPRECATED FEATURES   * De-couple quickstarts from statically served Keycloak JS quickstarts   NEW FEATURES   * Duplicate groups in the admin console of Keycloak admin/ui  * Support dark mode, at least for the login pages login/ui  * Bootstrapping an admin user using a dedicated command dist/quarkus  * Support AES and HMAC Key-Imports for the JavaKeystoreKeyProvider  * Bootstrapping an admin service account using a dedicated command dist/quarkus  * Warnings for temporary admin user and service account core  * Document admin bootstrapping and recovery docs  * Group assignment: Display disabled information from user admin/ui  * Initiate create events if ClientScopes are created  * Add Events for Organization Creation and Member Assignment organizations  * Include organization attributes and information in ID and access tokens    organizations  * Implement invitation-only self-registration for realm users organizations  * Retry remote cache operations with back off  * Option to specify trusted proxies dist/quarkus  * Expose Password Policies in FreeMarker Context for Login Themes   ENHANCEMENTS   * Update dependency on keycloak-client in main branch to 999.0.0-SNAPSHOT    quickstarts  * Specific events for webauthn register authentication/webauthn  * Support proxy_protocol  * SAML 2.0 HTTP-Artifact binding  * update or replace base64-js and js-sha256 adapter/javascript  * Google login - add prompt=select_account option core  * response_type none is oidc spec but ignored in the current implementation.    oidc  * Use a proper FreeMarker template for the new consoles account/ui  * Make sure identity providers are not send in realm GET requests and PUT    requests used in \"Realm settings\"  * Identity providers: Pagination in account console (and account REST API)  * Upgrade login theme to PatternFly 5 login/ui  * kcadm should have a command to verify connection admin/cli  * Support generated ECDH realm keys oidc  * Support ECDH-ES JWE algorithms oidc  * Automatically hot reload TLS certificates when https-certificate-file or    https-certificate-key-file changes on disk dist/quarkus  * Hostname config check on welcome page  * Improve auto behavior with operator and --optimized  * Add an option for a custom welcome page to disable bootstrapping of admin    account welcome/ui  * Remove need to update Quarkus tests when profile features change dist/quarkus  * Add a field to the RealmImportSpec to toggle replacing ENV variable    placeholders  * [keycloak-js] Expose didInitialize as a public method/property    adapter/javascript  * Validate spi options wrt build / run time dist/quarkus  * Document how to specify CPU and memory limits/requests for the Operator    operator  * Automatic update of bcfips versions in the docs docs  * Rename Dockerfile to Containerfile in the docs docs  * Un-friendly error message for Fail Import option in keycloak GUI    import-export  * External Infinispan as cache - Part 1  * Detect clients which refresh their access tokens too early  * Support OpenTelemetry tracing  * External Infinispan as cache - Part 2  * External Infinispan as cache - Part 3 / login failures cache  * External Infinispan as cache - Part 4 / user + client sessions online +    offline  * Clarify import/export usage of options  * Support pod affinity settings in the Keycloak Operator operator  * Active/Active XSite fencing  * Infinispan Protostream  * GET users endpoint is making lots of requests to the database storage  * Please clarify in the docs that the replacement of KC_PROXY=edge is not just    KC_PROXY_HEADERS, but one MUST set KC_HTTP_ENABLED=true.  * Improve SAML2 Metadata Validation Exception messages saml  * VC issuance in Authz Code flow with considering “scope” parameter oid4vc  * Add support of RTL UI in login pages login/ui  * private AuthzClient.createPatSupplier  * Bootstrapping an admin user or service account at server startup dist/quarkus  * Bootstrapping an admin user or service account using the Operator operator  * Update the welcome page to create a temporary admin user dist/quarkus  * Do not inherit 'https-client-auth' property for the management interface  * Admin UI - Fixed save buttons on the bottom at the page  * Handle proxy related env vars in the Operator operator  * Protobuf schema compatibility check (maven plugin)  * Protect the disabling of the main keycloak account admin/api  * Add missing translation for oid4vc protocol  * Introduce packages for organization tests organizations  * Refactor organization tests organizations  * Enhance masking around config-keystore dist/quarkus  * Credential Issuer Metadata: Support Optional ```claims``` Object in    ```credential_configurations_supported``` in ```openid-credential-issuer```    endpoint oid4vc  * Batch cluster events  * Server crash when using kc.sh with -Dkeycloak.profile=experimental    dist/quarkus  * Enhance Verifiable Credential Signing Service Flexibility and Key Rotation    oid4vc  * Document how Admin REST API endpoints work with Hostname config docs  * Use correct scope within maven-plugin core  * Make sure not possible to import jakarta classes in admin-client-jee    admin/client-java  * Cleanup dependencies of keycloak-client-registration-api to not have    dependency on server admin/client-java  * prevent removing the flow when used by client flow overrides authentication  * Make sure users created through a registration link are managed members    organizations  * Allow auto-redirect existing users federated from organization broker when    using the username organizations  * Support for members joining multiple organizations organizations  * Print keycloak's server response when using keycloak-admin-client    admin/client-js  * Make persistent user sessions and external Infinispan co-exist  * Remove inclusive language foreword docs  * Exchange VC Format class for String constantns oid4vc  * Add vault support to JavaKeystoreKeyProvider core  * Implement advanced verification of SD-JWT in Keycloak oid4vc  * VerifiableCredential: Exchange java.util.Date for java.time.Instant oid4vc  * Keycloak Operator should use the port name and not the port number for the    ingress operator  * Enable ProtoStream encoding for External Infinispan feature  * Drop `AuthenticatedClientSessionStore` from user sessions  * Document LDAP connection pool configuration  * Make ProofType for CredentialRequest a string instead of enum oid4vc  * Override of begin transaction in AbstractKeycloakTransaction  * Conditionally redirect existing users to a broker based on their credentials    organizations  * Refactor HA guide  * ConditionalRemove interface for External Infinispan feature  * Avoid iterating and updating all group policies when removing groups    authorization-services  * Add simple cache to cache-local.xml  * Oauth2GrantType.Context requires getter-methods oidc  * Manipulate redirect on OpenID redirect with custom implementation oidc  * Show Display Name (if available) and Realm Id on Realm Dropdown Button    admin/ui  * Release notes for JavaKeystoreProvider updates docs  * Can we remove distribution/feature-packs directory? adapter/jee  * [Organizations] Add a count() method to the OrganizationMembersResource core  * Allow custom login themes to define a footer ftl fragment login/ui  * Support for authenticating and issuing tokens in the context of a    organization organizations  * Remove keycloak-undertow-adapter-spi adapter/saml  * Add a deprecation warning when old `KEYCLOAK_ADMIN`,    `KEYCLOAK_ADMIN_PASSWORD` env vars are used dist/quarkus  * Support lightweight access tokens for Admin REST API oidc  * Allow Embedded Cache sizes to be configured via the CLI  * Use correct error code in error response in token exchange token-exchange  * Add issued_token_type to token-exchange response token-exchange  * Allow optional inclusion of Issue At TIme (iat) and Not Before (nbf) claim to    a verifiable credential oid4vc  * import placeholders should be converted to an option  * Change default name of bootstrap service account dist/quarkus  * Make sure the storage provider ID is always available from    `UserModel.getFederationLink`  * Upgrade to Quarkus 3.13.2 dist/quarkus  * Add x5c and jwk header to JWSBuilder oidc  * Optimize Remote Infinispan performance on removal of entry  * Optimize CPU cycles for persistent sessions  * Revoked tokens table is missing an index  * Client Policy - Condition : Client - Client Attribute oidc  * The console takes a very long time to display group members with LDAP    provider ldap  * Simplify enabling MULTI_SITE setup in KC26  * Class CertificateUtils should support creation of EC certificates oidc  * JavaScript build should not cache Keycloak Java artifacts and should rotate    PNPM cache  * Non clustered Keycloak with External Infinispan feature  * Redirect after cancelling a required action should contain kc_action    parameter authentication  * Add docs for the OpenTelemetry tracing docs  * Upgrade to next Quarkus LTS dist/quarkus  * Upgrade to Infinispan 15.0.7.Final  * Add ECDH-ES encyption algorithms to the java keystore key provider core  * References to removed artifacts and obsolete properties in root pom.xml  * OTEL: Service name isn't configurable and doesn't comply with conventions  * OTEL: Dynamic service name for tracing in K8s environment operator  * Remove session related caches from external Infinispan in HA guide  * Add an endpoint to the `organizations` endpoint to return the organizations    for a given user organizations  * Quarkus IDE Debugging should set JVM options like kc.sh  * error message \"Address already in use\" should state which address/port in    particular  * OTEL: Profile Feature dist/quarkus  * Enable persistent sessions by default  * Optimize Persistent Sessions SQL for session list  * Relocate Quarkus resteasy-reactive dependencies to REST  * Syslog: add necessary options to cover the major usability dist/quarkus  * Upgrade to Infinispan 15.0.8  * Upgrade Keycloak's sizing guide for KC26 and persistent sessions  * Documentation for persistent sessions enabled by default  * Make update IdentityProvider admin REST API more efficient.  * Upgrade to Quarkus 3.13.3 dist/quarkus  * Skip creating sessions cache when Persistent Sessions is enabled  * Performance optimization when checking secure context  * Upgrade to Quarkus 3.14.2 dist/quarkus  * Document Syslog app-name option  * Set autocomplete=\"one-time-code\" in OTP login form login/ui  * Remove tables `user_session`, `user_session_note` and `client_session`  * Review the number indexes for offline session tables  * Remove keycloak-core and keycloak-crypto-default from SAML galleon feature    pack and upgrade them to Java 17 dependencies  * Search Identity Providers by alias or display name  * Remove `version()` projection from Ickle Queries  * Rename `remote-cache` Feature  * Possibility to separately specify log levels for log handlers  * Optimize LogoutEndpoint.backchannelLogout endpoint identity-brokering  * Make it explicit which options are needed when using optimized image with the    Operator operator  * Review the RTO and RPO in the multi-site docs after the A/A failure and    recovery tests  * Add organization id to the organization claim of the access token  * Update the HA guide with fencing lambda taking Infinispan caches offline  * Remove `org.keycloak.utils.ProxyClassLoader`  * Add client side password policy checks  * Prevent deadlocks on concurrent user updates  * Redirect to relative-path from the root path dist/quarkus  * Reduce the cost of updating user attributes in JPA store core  * [OID4VCI] Show OpenID4VCI Credential Issuer Metadata link in admin ui oid4vc  * Upgrade to Quarkus 3.14.4 dist/quarkus  * Bootstrap admin client should use lightweight access tokens dist/quarkus  * FolderThemeProvider should select theme from available themes core  * Provide more information when there is an error to possibly debug  * Add the Troubleshooting and Health checks guide to Keycloak  * Use INFO Log Level for status in Migration Logic in DefaultMigrationManager  * [Organizations] Allow orgs to define the redirect URI after user registers or    accepts invitation link organizations  * Explicitly document that the Operator does not create an Ingress for Admin    URL operator  * Refactor loading resources from themes  * Document supported configurations and limitations for multi-site  * Use feature versions for admin3, account3, and login2  * Minor tweaks in SAML documentation adapter/saml  * Use `crypto.randomUUID()` to generate UUIDs for Keycloak JS    adapter/javascript   BUGS   * Failures in `ExtendAdminConsoleTest` quickstarts  * Build fails in the extension quickstarts  * Tests in user-storage-simple quickstart are failing in main branch    quickstarts  * Action-token quickstarts don't compile with latest Keycloak quickstarts  * Incorrect Keycloak version in the main branch of quickstarts quickstarts  * Jakarta tests are failing with latest main quickstarts  * Workflow failure - JavaScript quickstarts  * realm import: error if ldap groupmapper has a group path set import-export  * locale attribute not set after registration authentication  * New Admin UI does not send e-mails if account-client is disabled core  * authBaseUrl error on different hostname-admin-url, hostname-url admin/ui  * Double form submit in Admin UI possible leading to error mesages admin/ui  * Fine-grained admin permission client manage does not work admin/ui  * Documentation: Authorization Services documentation contains duplicated image    authorization-services  * Rename \"Realm name\" field to \"Realm ID\" field in realm creation screen    admin/ui  * front channel logout to clients are not called at Identity Proxy when using    front channel logout to Identity Provider( oidc  * \"Invalid Username\" when \"Email as Username\" is used and the email contains    special characters user-profile  * page-expired error page shown when using browser back-button on    forgot-password page after invalid login attempt authentication  * Flaky test: org.keycloak.testsuite.model.DBLockTest#testTwoLocksCurrently    storage  * Infinispan Cache(embedded) data is not being updated during mergeView event    infinispan  * Issue when start-dev in 23.0.1 dist/quarkus  * Flaky test:    org.keycloak.testsuite.oidc.AuthenticationMethodReferenceTest#testAmrPastMaxAge    oidc  * Flaky test:    org.keycloak.testsuite.forms.RecoveryAuthnCodesAuthenticatorTest#test03AuthenticateRecoveryAuthnCodes    authentication  * NullPointerException when using client scope policy for token-exchange    token-exchange  * MULTIVALUED_LIST_TYPE not working for client mappers admin/ui  * Readable realm name no longer visible in logs, but realm id is used instead    core  * \"User Profile\" attributes not available for Users Attribute search and    Attribute selection, if no view or manage realm realm-management role added    account/ui  * Translations missing for user events in admin ui translations  * Entry 999.0.0 in MIGRATION_MODEL prevents future migrations of the database    core  * Firefox Webauthn Registration \"SecurityError: The operation is insecure.\"    authentication/webauthn  * SSO Session Idle: session is still active after session idle time expired    oidc  * Missing help text on tokens tab admin/ui  * Client roles won't open (Forbidden) with Fine Grained Permission (without    view-clients realm-management role) account/ui  * Encountering `NullPointerException` - `KeycloakIdentity.getUserFromToken()`    when running `admin-ui` locally admin/ui  * NullPointerException on RealmCacheSession when upgrading Keycloak 23.0.4 to    24.0.2 infinispan  * Flaky test:    org.keycloak.testsuite.actions.RequiredActionUpdateProfileTest#updateProfileWithoutRemoveCustomAttributes    ci  * User profile validation pattern error-message not rendered from    messages_en.properties admin/ui  * Network error attempting to view default realm roles without permissions    admin/ui  * TrustedHostClientRegistrationPolicyTest#testGithubDomain failing in clean    checkout testsuite  * Restart authentication event type is not generated authentication  * Need refresh attributes group translations on Users > Details tab admin/ui  * Realm client unset protocol not preserved admin/ui  * realm_settings_general_tab_test.spec fails randomly admin/ui  * Default theme logs font related console errors on firefox login/ui  * The EmailEventListenerProvider throws an exception on brute force lockout    events authentication  * User Profile attributes/groups in Admin UI are not translated using    Localization for non-master realm when signed in the master realm account/ui  * Get effective roles for user needs more privileges than expected admin/api  * bug: disabling all default features no longer works core  * Exception while trying to run a LDAP sync with a group importer and a batch    size less then the actual number of groups ldap  * Missing Cache-Control header when \"response_type\" parameter is missing in    login request authentication  * Updating a client protocol mappers through Admi CLI (kcadm) resets the client    service account roles admin/cli  * Admin UI slow performance loading 600+ realms admin/ui  * Save button is not activated at first modification on \"Client scope details\"    admin/ui  * Flaky test:    org.keycloak.testsuite.oauth.TokenIntrospectionTest#testUnsupportedToken ci  * Admin v2 theme - theme.properties Custom theme scripts not loading admin/ui  * User in subgroup not synchronized and still appears as not in the subgroup    account/ui  * [DPoP] token_type on UserInfoEndpoint expects Bearer instead of DPoP oidc  * Flaky test:    org.keycloak.testsuite.broker.KcOidcBrokerTest#testPostBrokerLoginFlowWithOTP_bruteForceEnabled    ci  * Keycloak CI - failure in Store IT (aurora-postgres) ci  * Flaky test:    org.keycloak.testsuite.model.user.UserModelTest#testAddRemoveUserConcurrent    ci  * Flaky test:    org.keycloak.testsuite.model.user.UserModelTest#testAddRemoveUserConcurrent    ci  * Custom attributes are removed during UPDATE PROFILE event core  * Client role descriptions are not localized admin/ui  * The \"Quarkus development mode\" instructions in quarkus/README.md throw a    ForkJoinPool error dist/quarkus  * Executor consent-required does not work for client-roles condition oidc  * Upgrade to Keycloak 25 - Table 'USER_CONSENT' is specified twice on    MySQL/MariaDB database core  * Methods of SimpleHttp are after change now too much protected core  * Importing organizations failing if there is no broker and members in the    representation organizations  * Upgrade to Keycloak 25 - Events bug in UI admin/ui  * Organization resources in keycloak-admin-client-jee have dependencies on    jakarta admin/client-java  * Add an alias to organization organizations  * Expose organization to theme templates organizations  * Client secret rotation UI shows wrong rotated secret admin/ui  * Operator fails to patch ingress after update to 25.0.0 operator  * RESTART_AUTHENTICATION_ERROR when login in in private browser window after    25.0.0 update core  * Google login on Social login test is failing ci  * Identity-first login flow should be followed by asking for the user    credentials rather than allowing providing the username again organizations  * Migration of sessions in KC25 should run only on migration, not on imports  * New operator failing on health checks operator  * Documentation : label error for persistent-user-sessions feature flag docs  * Incorrect warning log about deprecated options hostname, hostname-debug    dist/quarkus  * Account Console (v3) no longer highlights the current page in the nav bar    account/ui  * Login / Admin events filter by date under realm Events return incorrect    results storage  * Keycloak 25 db guide shows unevaluated \"ifeval docs  * Built-in scopes are not translated in the account console \"applications\" tab    account/ui  * keycloak hostname:v2 /admin used on \"hostname\" instead of \"hostname-admin\"    admin/ui  * Improvements for ldap test authentication ldap  * Client Roles are not shown when clientId property is set admin/ui  * UI theme bug in KC 25.0.0 admin/ui  * Migration stuck if versions incompatible operator  * The `start` command should automatically re-build when previous run was    `start-dev` dist/quarkus  * All user attributes readonly in admin ui and admin API after setting edit    mode of one user federation to READ_ONLY core  * Fix LoginFailureEntity protostream encoding infinispan  * partial_import_test fails randomly admin/ui  * Fix AuthenticatedClientSessionEntity protostream encoding infinispan  * Flow steps back when changing locale or refreshing page on \"Try another way    page\" authentication  * \"Client Offline Session Max\" no longer available admin/ui  * Account UI resources try to load from admin path instead of frontend path    account/ui  * [UI] group selection does not update attribute tab admin/ui  * After migrating from 24 to 25, the signature algorithms names do not display    in drop down menu admin/ui  * Localization prevents update of user-profile attributes admin/ui  * Invalid character in spanish translation file for Identity Provider Link    Template translations  * client-jwt authentication fails on Token Introspection Endpoint oidc  * Network response was not OK. saml  * token exchange: exchange-sequence fails with Client session for client    'client-exchanger' not present in user session token-exchange  * Flaky test:    org.keycloak.testsuite.broker.KcSamlBrokerTest#testPostBrokerLoginFlowWithOTP_bruteForceEnabled    ci  * Default server port is used instead of the management interface port in the    guide about running Keycloak in a container  * User policy -> select user shows user id instead of user name. admin/ui  * A theme called `custom` is displayed as `Custom Attribute...` in the admin    console admin/ui  * LDAP connection pool params(maxsize, initsize, prefsize) picked up from    backend ComponentModel and are not visible in Keycloak admin console ldap  * Require SSL mode \"External requests\" does not work with IPv6 local addresses    dist/quarkus  * Infinite loader on the admin console for non-admin users admin/ui  * Recovery codes missing from account console docs  * Full details of errors not shown in admin and account console account/ui  * Internal error occurs for the removed flow which override by the client    authentication  * Remove of Multivalued Attribute due to - Adding translations when a new    attribute is created admin/ui  * Broken external links docs  * Cannot explicitly disable KERBEROS feature core  * Docs: server_admin/topics/login-settings/acr-to-loa-mapping.adoc docs  * Protobuf deserialization has a default of an empty String core  * fallback to the no override flow when the flow is missing in client override    authentication  * Rendering of granted client scopes in User Consents view broken in Admin UI    admin/ui  * Filtering by Client ID in the \"User Client Role\" mapper does not work anymore    admin/ui  * Docs: server_development/topics/themes.adoc docs  * Testing connection to ldap on the settings page does not work in 25.0.1 ldap  * Cannot find requested client with clientId ldap  * Incorrect order when instantiate ClientRemovedEvent infinispan  * Check for being Offline type in refresh token flow must be done based on    refresh token request parameter oidc  * admin-cli invalid credentials admin/cli  * DPoP Keycloak JS Adapter docs  * reCAPTCHA Enterprise v3 - Unrecognized field \"accountDefenderAssessment\" core  * Incorrect version comparison in ModelVersion storage  * Fix docs about User Storage SPI JPA quickstart docs  * Keycloak operator adds proxy by default which is depreacted operator  * Error when trying to edit authentication sub-flow name / description admin/ui  * Keycloak is not working in IBM AIX OS. dist/quarkus  * Brute force protection: Lockout permanently uses parameters configured under    lockout temporarily core  * Realm cannot be deleted if there are tons of consents storage  * User Federation settings changing when saving admin/ui  * \"Verify Email\" may cause other Required Actions to be ignored authentication  * Styling of recovery codes seems wrong login/ui  * Keycloak 25 - protocol_mapper_config stores client_uid in    usermodel.clientRoleMapping.clientId instead of client_id admin/ui  * Home URL for account-console / security-admin-console broken in admin-ui    admin/ui  * Cannot reorder custom auth flow executions in admin-ui admin/ui  * Users cache clears after creating client scope. infinispan  * Caching docs should name parameter runtime parameters, not build parameters    docs  * Updating dynamically registered client's metadata drops `preferred_username`    from ID token core  * Search doesn't work for nested groups admin/ui  * Docs: server_admin/topics/admin-console-permissions/fine-grain.adoc    authorization-services  * MULTIVALUED_STRING_TYPE not displaying 1 value while more than 1 value is    working fine admin/ui  * Not able to remove otp credential of user account/api  * inputOptionLabelsI18nPrefix is take into consideration only for login-ui    account/ui  * Review filtering of session returned from the sessions cache core  * KC.ORG user attribute shown - even if the organizations feature for the realm    is disabled admin/ui  * \"Can not update organization group\" error when trying to create organisation    from REST API organizations  * Cannot set unmanagedAttributePolicy without profile attributes admin/api  * Keycloak 25: Only first required action is executed core  * Re-enabling a temporarily locked user (brute-force) deletes all user    properties and attributes admin/ui  * A lot (really!) dropdown/select fields in admin-ui remain open after    selecting an action/entry. admin/ui  * After creating a new authentication flow and returning to the list, the \"Used    by\" column displays \"flow.undefined\" admin/ui  * Wrong Sync Mode of newly created external IdentityProvider admin/api  * Single use tokens, like action tokens, has a claim `expiration` core  * Realm export - duplicated elements in browser flow. Organization user must    click login button multiple times. import-export  * Recaptcha links changed in the Google Docs docs  * The check for userdn in test ldap should consider that AD proxy user can be    in non DN format ldap  * Bruteforce protector does not work when using organizations organizations  * #kc-form-options div not wrapping its content correctly in login-password.ftl    login/ui  * Clarify if JGroups thread metrics can be shown with embedded Infinispan  * [Docs] Broken link in Server Admin guide for JWT_Auth wiki docs  * Offline tokens created in Keycloak 9 will not work on Keycloak 25 oidc  * Userprofile/Translation: user attribute cannot be saved because no    translation was (even though it is present) admin/ui  * Can't update the user where userName contains uppercase letters core  * IdP redirect URL shows hostname_admin admin/ui  * All pubic brokers are shown during authentication rather than only those    associated with the current organization organizations  * Download of Recovery Codes broken. File contains no Recovery Codes. login/ui  * multiple ldap url's not working on one realm ldap  * Account console won't load when using URL having a path as hostname config    account/ui  * Incosistent casing of built-in flow descriptions core  * Revoke access tokens for persistent user sessions storage  * Hide save / update buttons in account console for READ_ONLY federated    accounts account/ui  * keycloak.v2 broken in main login/ui  * Keycloak URL for Brokerage in Admin UI still suggests \"/realms\" in the path    admin/ui  * logging-pattern failure in token-exchange token-exchange  * Joining group for user doesn't list correct number of groups admin/ui  * call to group-by-path does not return subGroupCount admin/api  * Wrong command in exposing metrics from caches section docs  * Seeing `Client cannot marshall the server's key media type` with external    Infinispan after 25 upgrade infinispan  * keycloak Public Client secret are updated frequently admin/api  * Duplicate Key \"validatingX509CertsHelp\" in admin-ui messages admin/ui  * dynamic MultiValuedListComponent default value not stringified admin/ui  * Export users throws Disabled option: '--users' in v25 import-export  * Admin API extremely slow with service account and fine-grained authorization    `view-users` admin/fine-grained-permissions  * Creating client roles with fine grained permissions is not possible    admin/fine-grained-permissions  * Event tables have broken aria-labels admin/ui  * MSSQL test container can't start ci  * Link existing account to SSO by email not linking since v23 login/ui  * AdvancedClaimToGroupMapper throws Exception if no claims are configured    identity-brokering  * Credential offer endpoint fails with 500 when bearer token has expired oid4vc  * Description field for roles creation could be better instead of ${} values    admin/ui  * Misconfiguration of login settings causes login to not be possible admin/api  * CURL commands in build don't check the response code ci  * Can't delete kerberos user storage  * Store Model Tests (jpa+cross-dc-infinispan+persistentsessions) -    org.keycloak.testsuite.model.session.SessionTimeoutsTest infinispan  * Endpoint /admin/users Degradation Based on Role    admin/fine-grained-permissions  * localization not work with user attribute display name in users add admin/ui  * Admin Console Spins with hostname:v2 using security-admin-console Redirect    URIs docs  * \"Use metadata descriptor URL\" switch is always set to \"On\" admin/ui  * ID is used as tab name instead of localized string admin/ui  * The OID4VCI cross-device flow should not require the device to have an access    token oid4vc  * Documentation for `Delete Credential` action and related changes    authentication  * Persist revoke tokens with remote cache feature storage  * SAML IdP configure does not parse IdP metadata.xml correctly saml  * Keycloak 25 SAML IdP has made Single Logout URL mandatory. saml  * Management Interface is turned on even though nothing is exposed on it    dist/quarkus  * Ignoring JWK key Missing required field 'use' still happens in keycloak    version 25.02 identity-brokering  * EmbeddedInfinispanSplitBrainTest fails with \"IllegalState Session not bound    to a realm\" core  * Deleted authentication sessions should not be re-surrected with an update    core  * Custom component persist only some config keys admin/api  * Certificate-Generation with EC signing RSA and vice versa does not work oidc  * Flaky test:    org.keycloak.testsuite.forms.BruteForceTest#testRaceAttackPermanentLockout ci  * Realm roles that do not exist are displayed in \"Default roles\" when \"Hide    inherited roles\" is not checked admin/ui  * Client secret is visable in Admin event representation when Credentials Reset    action performed for the Client. admin/api  * In realm role ellipsis value is null admin/ui  * Network error attempting to view events without permissions admin/ui  * Network error attempting to view user registeration without permissions    admin/ui  * Failure to generate Ed448 token authentication  * Cache guide does not properly print `cache-stack` values docs  * Filter organization brokers in the account console organizations  * Fix server guide cross-references for downstream docs docs  * Admin console not usable when instance has a 1000 realms admin/ui  * Unstable test ExternalInfinispanTest testsuite  * `My password` string in `Signing in` page not getting translated in    `keycloak.v3 account` theme account/ui  * Not possible to import realm with newest Java admin-client against Keycloak    24 admin/client-java  * Look around window cannot be set to 0 admin/ui  * SAML adapter IdMapperUpdaterSessionListener not executed when session ID    changes adapter/saml  * Remember Me with External Infinispan is not works properly infinispan  * [Scalability of IDPs] Follow up: ensure organization aware    IdentityProviderModel is used in the infinispan IDPProvider  * Impossible to import RolePolicy with newest admin-client against Keycloak 24    admin/client-java  * Offline session bug on 25.0.2 core  * Missing TypeScript `populateHierarchy` param for keycloak admin client    admin/client-js  * Session list doesn't handle non-existing client gracefully core  * Remote Infinispan code must not call JPA code in non-blocking thread core  * SingleSelect-kind readonly attribute is not disabled in account console    account/ui  * Bootstrap options missing from help dist/quarkus  * Table names for persistent sessions upgrading guide is wrong docs  * Session list not appearing: SQL Error \"The incoming request has too many    parameters\"  * `show-config` command outputs duplicate options dist/quarkus  * UserRemovedEvent does not contain all user attributes infinispan  * Migration to persistent sessions fails from Keycloak version storage  * Keycloak reuses AUTH_SESSION_ID of logged out sessions login/ui  * Endpoint configurations shows hostname_admin admin/ui  * Brokers associated with organization not filtered when linking brokers with    an organization organizations  * Flaky test:    org.keycloak.testsuite.forms.BruteForceTest#testRaceAttackPermanentLockout ci  * [Keycloak CI] - AuroraDB IT fails to start on EC2 due to lack of entropy    regression storage  * Temporary admin account notice logged to org.keycloak.events dist/quarkus  * Legacy `KEYCLOAK_ADMIN` environment variable is not working dist/quarkus  * KeycloakRealmImport not working with Istio service mesh operator  * Validate organization alias for forbidden chars organizations  * Additional datasources do not work dist/quarkus  * Missing translations for required action webauthn-register login/ui  * Joining group with text filter does not show all results even if backend    returned them admin/ui  * Duplicate message keys in admin messages_en.properties admin/ui  * Multiple Logout Confirmation Actions Trigger NullPointerExceptions core  * Wildcard search not working for custom user attributes admin/api  * When Organization feature is enabled UserAdapter.getGroupsCount() returns    wrong result organizations  * SocialLoginTest failing after switching to the new IDP Provider  * Warning Banner for Temporary Admin User shouldn't be placed under breadcrumbs    admin/ui  * Flaky test:    org.keycloak.testsuite.webauthn.WebAuthnIdlessTest#testWebAuthnIDLessAndWebAuthnAndWebAuthnPasswordlessLogin    ci  * Flaky test:    org.keycloak.testsuite.forms.ResetPasswordTest#resetPasswordWrongSmtp ci  * Flaky test:    org.keycloak.testsuite.forms.ResetPasswordTest#resetPasswordWithPasswordHistoryPolicy    ci  * Drag & drop issue with the step order in the Authentication settings of the    Admin Console admin/ui  * Identity Provider secret visible in Organization tab (API request)    organizations  * Welcome screen logo is bigger then the one on login welcome/ui  * Flaky test BruteForceTest.testPermanentLockout() core  * Flaky test:    org.keycloak.testsuite.webauthn.WebAuthnTransportsTest#internalTransport ci  * Login v2 username form login/ui  * [Keycloak CI] - BruteForceTest.testPermanentLockout failures login/ui  * [Keycloak CI] - OrganizationBruteForceTest.testPermanentLockout failures    login/ui  * [Keycloak CI] - ResetPasswordTest.resetPasswordExpiredCode failures login/ui  * Invalid client data in /login-actions/authenticate causes an uncaught server    error and a HTTP 500 response code authentication  * Cannot invoke    \"org.keycloak.authentication.RequiredActionFactory.isConfigurable()\" because    \"factory\" is null account/ui  * Admin UI messages sometimes miss details, and sometimes refer to details in    the logs which are missing admin/ui  * Flaky test:    org.keycloak.testsuite.forms.ResetPasswordTest#resetPasswordLinkNewTabAndProperRedirectClient    ci  * Flaky test:    org.keycloak.testsuite.forms.ResetPasswordTest#resetPasswordLinkNewBrowserSessionPreserveClient    ci  * Multiple bugs in the experimental UiTabProvider / UiTabProviderFactory    admin/ui  * \"Include Client Audience\" field is not mandatory admin/ui  * The set value ‘Default Admin-Initiated Action Lifespan’ has no effect on the    ‘Credential Reset’ form admin/ui  * Flaky test:    org.keycloak.testsuite.webauthn.registration.UserVerificationRegisterTest#required    ci  * CRDs for the Operator are generated multiple times during the build operator  * Flaky test:    org.keycloak.testsuite.webauthn.WebAuthnTransportsTest#nfcTransport ci  * Flaky test:    org.keycloak.testsuite.webauthn.WebAuthnTransportsTest#bluetoothTransport ci  * Continuous loading screen instead of access denied on account info page    account/ui  * Forms IT (chrome) ResetOtpTest fail testsuite  * InvalidDestination Error for IDP-initiated SSO with Keycloak behind a Reverse    Proxy saml  * OAuth login error with custom scheme oidc  * \"Authentication\" Link in Admin Portal Fails with 400 Bad Request After    Migrating to Version 25 admin/ui  * Help text under text field admin/ui  * Dots are not allowed in the path in Hostname v2 dist/quarkus  * Flaky test:    org.keycloak.testsuite.forms.ResetPasswordTest#resetPasswordBeforeUserIsDisabled    ci  * Unable to import master realm with --import-realm dist/quarkus  * On backchannel logout, a user ID with a dot on the broker side breaks the    logout by user core  * KeyCloak Admin Client uses non-standard `@NoCache` annotation which is an    issue for Quarkus admin/client-java  * In the account console when I update the password the referrer dissapears    account/ui  * Leftover code in login-passkeys-conditional-authenticate.ftl login/ui  * Keycloak admin console interface is out of screen admin/ui  * The endpoint /admin/realms/{{realm}}/groups/{{group-id}}/members potentially    fetch all user in database admin/api  * When forcing re-authentication by passing maxAge value as 0 does not work    adapter/javascript  * Adapters backward compatibility tests are failing ci  * `@noble/hashes/sha256` is bundled into Keycloak JS adapter/javascript  * Flaky test: org.keycloak.testsuite.url.HostnameV2Test ci  * CVE-2024-7318 - Use of a Key Past its Expiration Date in    org.keycloak:keycloak-core  * Custom theme and not existing image: error 500 (No enum constant    org.keycloak.theme.Theme.Type.IMG) login/ui  * Realm import fails when client configures default_acr values import-export  * Lightweight access token is not working for bootstrap admin client oidc  * Error when deploying SAML application with the keys in PEM format inside    keycloak-saml.xml adapter/saml  * Login V2 theme: Pages specify fewer tabindex entries login/ui  * Login v2 theme: Auto-focus on input fields no longer working and autocomplete    changed login/ui  * TOTP QR codes broken when realm display name contains colon character core  * Admin UI does not display admin events expiration admin/ui  * Database index creation isn’t skipped on large data sets in Keycloak 24    storage  * Increased DB activity due to changes in    LDAPStorageManager.searchForUserByUserAttributeStream ldap  * Flaky test:    org.keycloak.testsuite.forms.RegisterTest#registerExistingEmailAllowed ci  * Flaky test:    org.keycloak.testsuite.forms.RegisterTest#registerUserNotContainsUsernamePasswordPolicy    ci  * Exceptions on X509 authentication are logged without a stack trace core  * [Store Model Test] Failed test    org.keycloak.testsuite.model.session.UserSessionPersisterProviderTest#testOnRealmRemoved    ci  * Inconsistency of the access token iat after setting the time offset in the    test suite authentication  * Administrator username changed in master realm after configuring email    address for SMTP connection test for another realm with \"Email as username\"    enabled admin/ui  * Device activity client name translations account/ui  * Flaky test:    org.keycloak.testsuite.webauthn.WebAuthnTransportsTest#usbTransport ci  * Flaky test:    org.keycloak.testsuite.forms.RegisterWithUserProfileTest#testAttributeInputTypes    ci  * Flaky test:    org.keycloak.testsuite.webauthn.WebAuthnIdlessTest#testWebAuthnIDLessWithNonResidentCredentialLogin    ci  * Flaky test:    org.keycloak.testsuite.broker.KcOidcBrokerTest#testPostBrokerLoginFlowWithOTP_bruteForceEnabled    ci  * Application names are not taking realm overrides into account account/ui  * Admin bootstrap client should not have standard flow enabled dist/quarkus  * Documentation CI is failing on broken links docs  * Flaky test:    org.keycloak.testsuite.webauthn.registration.UserVerificationRegisterTest#discouraged    ci  * Next page not working for \"Localization --> Realm overrides\" admin/ui  * Identity-first login screen has broken IDP icons admin/ui  * Clusterless feature is not tested in Model tests testsuite  * Tests are showing exception while trying to import admin user after    organizations were enabled by default testsuite  * Action expired error occurs when accessing regular registration page with    Organizations enabled organizations  * The \"Valid redirect URIs\" field is not displayed when the \"Standard flow\" is    unchecked admin/ui  * Infinite loop when accessing account management console account/ui  * CVE-2024-8883 Vulnerable Redirect URI Validation Results in Open Redirect  * CVE-2024-8698 Improper Verification of SAML Responses Leading to Privilege    Escalation in Keycloak  * CVE-2024-7254 - Stack-based Buffer Overflow in    com.google.protobuf:protobuf-java dist/quarkus  * Deprecation of https-trust-store-* weakens X509 browser authentication    authentication  * [Organizations] Preserve org id in exported realms core  * [Keycloak CI] - Quarkus IT - StartCommandDistTest.testStartUsingAutoBuild ci  * [Keycloak CI] - User Federation Tests -    LDAPSamlIdPInitiatedVaryingLetterCaseTest ci  * Unable to start Keycloak when metrics are enabled dist/quarkus  * Migrating to a FIPS environment disallows all users from logging in    authentication  * Organization UI is overriding the alias with the org name when user navigates    to another tab admin/ui  * XA Transaction recovery support is enabled even thoug transaction-xa-enabled    is false dist/quarkus  * \"somethingWentWrong\" when opening Keycloak URL in unsecure context login/ui  * Performance drop in cpuUsageForLoginsTest since 19.09.2024  * Changing locale on passwordless or custom login flow does not work login/ui  * Duplicate entry \"duplicate\" in Admin UI message properties admin/ui  * Hostname v2 should enforce hostname is a full url if hostname-admin is used    dist/quarkus  * Wrong release notes for Login v1 theme deprecation login/ui  * Performance regression when Organisations feature is enabled  * ID token from refresh_token flow does not contain nonce even when using Nonce    backwards compatible mapper oidc  * Flaky test:    org.keycloak.testsuite.webauthn.registration.UserVerificationRegisterTest#preferredVerificationWrong    ci  * Banner is not wrapping properly admin/ui  * Creating clientAttributesCondition in some client policy breaks the login to    the realm authentication  * User specific organisation entries shouldn't be placed in the realm cache    core  * Organization brokers should be hidden on login pages by default organizations  * Organization data is cached for each user even if realm never enabled    organizations organizations  * Avoid caching `RealmModel` in `CachedOrganization` organizations  * Test group_test.spec.ts Duplicate group fails repeatedly testsuite  * AWS Lambda description for HA setup doesn't reflect latest changes for    failure policy core  * The \"Client Secret\" field does not expand to display the entire secret value    admin/ui  * Can't load theme resources on Windows core  * Issue when running tests from IDE on embedded undertow (    org.jboss.threads.EnhancedQueueExecutor$Builder.setKeepAliveTime(java.time.Duration)    ) testsuite"
}