{
  "title": "Keycloak 26.1.1 released",
  "link": "https://www.keycloak.org/2025/02/keycloak-2611-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2025-02-05T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   HIGHLIGHTS   NEW OPTION IN X.509 AUTHENTICATOR TO ABORT AUTHENTICATION IF CRL IS OUTDATED  The X.509 authenticator has a new option x509-cert-auth-crl-abort-if-non-updated (CRL abort if non updated in the Admin Console) to abort the login if a CRL is configured to validate the certificate and the CRL is not updated in the time specified in the next update field. The new option defaults to true in the Admin Console. For more details about the CRL next update field, see .  The value false is maintained for compatibility with the previous behavior. Note that existing configurations will not have the new option and will act as if this option was set to false, but the Admin Console will add the default value true on edit.   NEW OPTION IN SEND RESET EMAIL TO FORCE A LOGIN AFTER RESET CREDENTIALS  The reset-credential-email (Send Reset Email) is the authenticator used in the reset credentials flow (forgot password feature) for sending the email to the user with the reset credentials token link. This authenticator now has a new option force-login (Force login after reset). When this option is set to true, the authenticator terminates the session and forces a new login.  For more details about this new option, see .   UPGRADING  Before upgrading refer to for a complete list of changes.   ALL RESOLVED ISSUES   ENHANCEMENTS   * Clean up old release code from Node.js adapter repo nodejs-connect  * Organizations: Allow Organization Selection organizations  * CreatedResponseUtil.getCreatedId should expose the actual error message from    the server admin/client-java  * Remove Node.js adapter documentation from main repo docs  * Clarify IPv6 JGroups requirements in Keycloak documenation  * Add detail on dependencyManagement section for POM files   BUGS   * The draft nightly untagged release is created by \"Release nightly\" GH action    nodejs-connect  * Incorrectly resolved {project_versionNpm} expression in the documentation    nodejs-connect  * Translation error in messages_fr.properties translations  * LDAP groups not showing members in Groups when using memberOf attribute ldap  * Realm not found while exists and works if entered directly in the URL    admin/ui  * Deployment artifacts for Quarkus extensions are not in deployment dir    dist/quarkus  * Wrong link for tracing in 26.1.0 release notes docs  * The organization claim does not appear if the Organization Membership Mapper    is added through a custom client scope organizations  * WebAuthN and dark mode: device icons are hardly readable login/ui  * keycloak.v2 forms are too small for mobile view login/ui  * All IDPs shown when reloading login page login/ui  * When organizations feature is turned on, login_hint doesn't prefill    identity-first login's page email field organizations  * --spi-connections-liquibase-default-index-creation-threshold does not work    core  * Links error for https://jwt.io in documentation docs  * Logging errors on DB transaction retries core  * Conflict when Keycloak uses an OpenShift cluster ingress certificate operator  * Flaky test:    org.keycloak.testsuite.webauthn.account.WebAuthnTransportLocaleTest#localizationTransportInternal    ci  * Flaky test:    org.keycloak.testsuite.webauthn.account.WebAuthnSigningInTest#multipleSecurityKeys    ci  * Provide an option to force login after reset credentials authentication  * Outdated documentation about how to use reCAPTCHA in development with    localhost docs  * Flaky test:    org.keycloak.testsuite.webauthn.account.WebAuthnErrorTest#errorPageWithTimeout    ci  * Bad escape apostrophe character in messages_fr.properties login/ui  * Typos in English email message templates translations  * UI tests failing admin/ui"
}