{
  "title": "CodeReady Containers - Beginners guide to OpenShift Container Platform 4.9.10 with business automation tooling",
  "link": "http://www.schabell.org/2022/01/codeready-containers-beginners-guide-openshift-business-automation-tooling.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-01-10T06:00:00.006Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " Some time ago, back in December of 2020, I shared with you how to tooling on your developer machine using CodeReady Containers.     In this four part series you were familiarised with the OpenShift Container Platform, the business automation operators, and given a project to install the developer tooling needed to begin designing processes, rules, and much more.  Recently, there were updates to the CodeReady Containers offering that gives you the latest OpenShift Container Platform 4.9.10 to run quite easily on your local developer machine.  Time to update the various projects for leveraging to learn business automation tooling better known as the Red Hat Process Automation Manager and Red Hat Decision Manager. Along with these installation projects, you'll be able to use the free online workshops with the latests tooling.  Let's take a look at the fastest way to get started, shall we?   INSTALLING CODEREADY CONTAINERS  Once upon a time in the not so distant past, I put together a project. This is no longer needed, just download  from the Red Hat Developer site and install following the provided documentation.  Verify the correct installation with the following from the command line (terminal):  $ crc version  CodeReady Containers version: 1.37.0+3876d27d OpenShift version: 4.9.10   Once installed, you can then make use of the following projects to start exploring business automation developer tooling on your new OpenShift Container Platform.   INSTALLING DECISION MANAGER  The following project was setup to get you started with with just a few easy steps:       1. Ensure you have installed OpenShift with CodeReady Containers from    2.    3. Run 'init.sh' or 'init.bat' file. 'init.bat' must be run with Administrative     privileges.  Now log in to Red Hat Decision Manager to start developing containerized process automation projects (the address will be generated by OCP):   * CodeReady Container    example: https://insecure-rhdm-rhdmcentr-appdev-in-cloud.apps-crc.testing (    u:erics / p:redhatdm1! )     Not sure how to get started with Red Hat Decision Manager? Try one of these  to build a first project from scratch.     INSTALLING PROCESS AUTOMATION MANAGER  The following project was setup to get you started with the latest process automation developer tooling with just a few easy steps:   1. Ensure you have installed OpenShift with CodeReady Containers from    2.    3. Run 'init.sh' or 'init.bat' file. 'init.bat' must be run with Administrative     privileges.  Now log in to Red Hat Process Automation Manager to start developing containerized process automation projects (the address will be generated by OCP):   * CodeReady Container    example: https://insecure-rhpam-rhpamcentr-appdev-in-cloud.apps-crc.testing (    u:erics / p:redhatpam1! )  Not sure how to get started with Red Hat Process Automation Manager? Try one of these  to build a first project from scratch.   WORKSHOPS AND MORE  After installing the above tooling, you've been pointed to the freely available online workshops to start developing your first projects.   There are many more projects for you to explore without building them from scratch over on .   Explore all the projects with CodeReady Containers in the title and you should be well on your way to designing and executing business automation projects of your very own.  "
}