{
  "title": "Keycloak Realm Configuration Management Tools Survey Results",
  "link": "https://www.keycloak.org/2024/09/realm-config-management-tools-survey-results",
  "author": [
    {
      "name": "Thomas Darimont",
      "avatar": null
    }
  ],
  "date": "2024-09-11T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "Three months ago, the to gather insights on realm configuration tooling within our community. The number of responses overwhelmed us! With a total of 433 (!) submissions, it highlighted the diverse range of options our community uses for configuring realms.  Thank You for your valuable feedback!   POPULAR TOOLS IN USE  The survey revealed a variety of tools employed by the community for realm configuration, including:   *    *    * Self-developed Realm Configuration Management   *    *    *    *    *    * Custom Operator for Realm Import/Update and Client Provisioning   *    *    *    *    *    TOOL USAGE DISTRIBUTION  From the submissions, we observed the following distribution of tool usage among respondents:   1. Terraform Keycloak Provider ~51% of the votes   2. Keycloak-Config-CLI ~16% of the votes   3. Self-developed Realm Configuration Management ~7% of the votes   4. Keycloak JSON Realm Import/Export ~6% of the votes   5. Keycloak Admin CLI ~4% of the votes  These top five tools accounted for 84% of all responses.   AREAS FOR IMPROVEMENT  While each tool has its strengths and weaknesses, the survey highlighted several common challenges:   * Using the Admin API can be awkward and inconsistent, for example, with    references using IDs versus aliases.   * Recognizing changes in the configuration, such as when new roles are added to    service accounts via the Admin UI, can be challenging or impossible.   * Many tools depend heavily on the Keycloak version used and are often not    compatible with new releases.   * Managing components that are automatically created by Keycloak, like service    accounts, is challenging with existing configuration tools.   * Lack of support for configuration linting, validation and code completion   WHAT’S NEXT?  Based on the feedback, here are some key lessons learned and the next steps:   * Tool Compatibility: We aim at improving compatibility with newer Keycloak    releases to ensure seamless integration.   * Admin API Enhancements: We’ll address inconsistencies and usability issues in    the Admin API to streamline configuration tasks.   * Ease Change Management: Enhance tools and APIs to improve the recognition and    change management of realm configurations.  We are committed to addressing these areas and working closely with the community to enhance the realm configuration experience in Keycloak. Your continued feedback and support are invaluable as we move forward. Stay tuned for updates and improvements!  If you have any further questions or suggestions about this blog post, please join the related .  Thank you very much for your support!"
}