{
  "title": "Kogito 1.35.0 released!",
  "link": "https://blog.kie.org/2023/03/kogito-1-35-0-released.html",
  "author": [
    {
      "name": "Cristiano Nicolai",
      "avatar": null
    }
  ],
  "date": "2023-03-17T12:58:52.000Z",
  "feed_title": "KIE Community",
  "content": "We are glad to announce that the Kogito 1.35.0 release is now available! This goes hand in hand with , release.  From a feature point of view, we have included a series of new features and bug fixes, including:   * Flyway integration for JDBC based persistence    * We have removed the use of kogito.persistence.auto.ddl property to      initialize tables across persistence in Kogito. When using      kogito-addons-quarkus-persistence-jdbc extension, we must set the      quarkus.datasource.db-kind property to locate appropriate schema scripts.  * GET <processId> API does not return all active process instances any longer,    but a subset of them. The number of instances returned is determined by the    property kogito.process.instances.limit, whose default value is 1000. If you    need finer control of those instances, please check data-index    functionality.   * Users that want to reduce memory footprint might replace quarkus postgresql    extension  (quakus-jdbc-postgresql) by extension    (quarkus-embedded-postgresql)  * Data Index allows to be configured to use http-connector to consume Knative    eventing.   BREAKING CHANGES   * Removed kogito.persistence.auto.ddl property for JDBC persistence addons (    kogito-addons-quarkus-persistence-jdbc and    kogito-addons-springboot-persistence-jdbc). Please refer to using Flyway    integration in order to handle database creation.  For more details head to the complete .  All artifacts are available now:   * Kogito runtime artifacts are available on Maven Central.  * Kogito examples can be found .  * Kogito images are available on .  * Kogito operator is available in the in OpenShift and Kubernetes.  * Kogito tooling 0.27.0 artifacts are available at the .  A detailed changelog for 1.35.0 can be found in .  New to Kogito? Check out our website . Click the \"Get Started\" button.  The post appeared first on ."
}