{
  "title": "Red Hat Summit 2021 - How to enjoy this three part event series",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/t9TStFjD8VU/red-hat-summit-2021-how-to-enjoy-this-three-part-event-series.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-04-15T05:00:00.005Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "  This year the event is a bit different as we bridge the gap from pandemic reality to hopefully a form of normalcy.     As the to us, this \"...event is expanding to become an all-new, flexible conference series, consisting of a 2‑part immersive virtual experience as well as a global tour of small-scale, in-person* events. This series will create collective opportunities to share experiences, innovations, and insights.\"  Part one is from April 27-28, where you can start your Red Hat Summit journey by joining us for this no-cost event, where you can get the latest news, ask the experts your technology questions, hear from customers around the globe, and learn how open source is innovating the future of the enterprise. There will be keynotes, spotlights, live demos, and access to Red Hatters from around the globe.  Part two is from June 15-16, and you can build on what you learned at April’s event with insights from breakout sessions and technical content geared toward the tracks and topics most relevant to your career. You can also interact live with Red Hat professionals at this no-cost event. More depth at this event with the breakout sessions, ask the experts sessions, and a virtual expo hall.  Finally, you noticed the star marking the part three event above? That's because this part of the event we hope allows us to meet in-person, but the ongoing situation means Red Hat will \"...continue to monitor the ongoing global health crisis and make adjustments to the Red Hat Summit agenda to help ensure the health, safety, and well-being of everyone within the open source community.\"  If all goes well, then you can cap your Red Hat Summit experience somewhere from Oct - Nov \"...by exploring hands-on activities at in-person events that will be held in several cities. The networking opportunities can help you find the inspiration to discover who you want to be and the tools to do what you want to do.\" There will be hands-on labs, 1-1 meetings, and training courses available during this final event series.  This year I'm involved with some friends and colleagues in a few Ask The Experts sessions where you get a live session on a topic with several experts available to ask anything you like about the topic.  I'm going to be involved in the following two sessions.        ''If the rate of change on the outside is faster than the rate of change on the inside, the end is near.'' - Jack Welch. The way applications are built, integrated, run, and monitored has changed dramatically over the years. They change because businesses and organizations need to adapt to change and to growing customer requirements more quickly and frequently than ever before. Red Hat's vision of an open hybrid cloud environment embraces an architecture that includes agile integration, DevOps, CI/CD pipelines, microservices, containers, and event-driven architectures—all to help you meet the requirements of change at speed. In this session, experts who have seen, studied, and developed architectural blueprints from successful customer open hybrid cloud solutions will share their insights and discoveries with you. It's a unique chance to engage, ask questions, or just listen as we share some of the best insights into architecting your successful future in an open hybrid cloud environment.   Date: Wed, 28 April 2021 Time: 09:00 - 09:30 CET Speakers: Benjamin Farr, Senior Solution Architect, Manfred Bortenschlager, Business Development Manager, Ronald Meuwsen, Go-to-Market Manager, and Eric Schabell, Portfolio Architect Director        The world is constantly challenging our abilities to adapt, overcome, and transform as businesses strive to meet their customers needs and expectations. What does digital transformation mean for you, and where are you in the journey to become a fully digital partner to your customers? In this session, speakers from across the Red Hat leadership spectrum who are having these exact conversations with our customers around the world, will answer your burning questions from your own digital journey. From cloud-native strategies to the organizational shifts that are part of a digital transformation journey, take this unique opportunity to engage, ask questions, or just listen as we share insights from successful customer journeys and help you shape your own digital transformation in these challenging times.   Date: Wed, 28 April 2021  Time: 09:30 - 10:00 CET Speakers: Brendan McErlain, Vice President, Portfolio Product Marketing, Andreas Spanner, Chief Architect, and Eric Schabell, Portfolio Architect Director   Make sure you as it's free and full of great open source technologies, customer cases, labs, and more. I hope to see you there and if not, then feel free to drop in at a later date as they will be linking recordings of these sessions back into for your viewing pleasure. "
}