{
  "title": "Observability in Keycloak 26.2",
  "link": "https://www.keycloak.org/2025/04/observability-26-2",
  "author": [
    {
      "name": "Michal Hajas",
      "avatar": null
    }
  ],
  "date": "2025-04-24T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "When running a central single sign on service like Keycloak in production, you need to understand how well the system performs and whether there are service degradations. Having a proper monitoring stack in place is essential for this. Moreover, when the system performance degrades, it is crucial to identify which part of the system is causing the problem to address it.  In the latest Keycloak release, all the above became more straightforward and works without additional extensions.  Read on to learn more and !   HEY KEYCLOAK! HOW ARE YOU?  Users rely on Keycloak to log in to their applications, and service level indicators (SLIs) capture the key metrics capturing that behavior. Misbehavior of the system can be detected by monitoring these SLIs.  One of the indicators can be the availability of the system. The indicator for availability can be defined as: percentage of the time the system can answer requests. The lower the indicator is for your system, the less available it was in the observed period.  Find an example set of SLIs for Keycloak and more details on this topic in the guide.   OH NO! YOU ARE NOT DOING WELL?  Now we know how to detect when Keycloak is not performing well. But what should I do when a service level indicator shows a degradation of the service? This situation usually means some part of Keycloak does not perform well. However, from the indicator itself, it is hard to say what part of Keycloak it is.  To identify the culprit of the problem, we provide the guide that lists chosen metrics. Using these metrics, you can visualize what is happening in your deployment and down problems.  Some examples of metrics from the guide are listed below:   * Number of operations performed by Keycloak like password hashes, login flows,    token refreshes, etc.   * Memory usage   * Database connection pool utilization   * Number of HTTP requests per URL and outcome   * Hit ratios for internal caches  For environments with Prometheus for collecting metrics and Grafana for displaying them, we also provide Grafana dashboards to make troubleshooting smoother. Find instructions on how to deploy our dashboards into your Grafana instance in the guide.  Grafana dashboards with SLIs (click to enlarge)    MY KEYCLOAK IS STILL SICK :( I NEED AN IN-DEPTH EXAMINATION  Thanks to metrics, you can observe certain aspects of the system and how they evolve over time. However, they may not provide a detailed picture of what is happening inside Keycloak for a specific request. For this, you can leverage traces. Learn more in the guide.  With tracing, you can observe steps that Keycloak was performing for a specific request, including the respective timing for each of them. These steps include operations by Keycloak but also waiting time for responses from third party services like the database, LDAP, Infinispan and others. This helps you to reveal where the bottleneck in your system is.  In the example below, you can see steps Keycloak was performing when a user submitted the username and password form. You can see the most time-consuming step was password hashing, which took 30 milliseconds out of 48-millisecond total request processing time.  Trace displayed in Jaeger (click to enlarge)    NEXT STEPS  To see all of this in action and to ask live questions, .  As an appetizer, see a shorter version of .  To ask questions outside the meetup, use the . Use to join the CNCF Slack if you do not have an account yet.  You can also leave the feedback in the ."
}