{
  "title": "Portfolio Architecture Examples - Telco Collection",
  "link": "http://www.schabell.org/2022/03/portfolio-architecture-exmaples-telco-collection.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-03-29T05:00:00.005Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "Figure 1: The portfolio architecture process  For a few years now we've been working on a project we have named . These are based on selecting a specific use case we are seeing used in the real world by customers and then finding implementations of that case using three or more products from the Red Hat portfolio.    This basic premise is used as the foundation, but many aspects of open source are included in both the process and the final product we have defined. There is a community, where we share the initial project kickoff with a group of architects and use their initial feedback from the start. We also present the architecture product we've created right at the end before we publish to ensure usability by architects in the field. The final publish product includes some internal only content around the customer projects researched, but most of the content is  through various open source channels.   This article is sharing an overview of the product we've developed, what's available to you , and concludes by sharing a collection of architectures we've published.   INTRODUCTION  The basic premise of a portfolio architecture is that it's a use case with two to three actual implementations that can be researched and includes the use of a minimum of three products. This is the ideal foundation for a project to start, but we encountered a problem with use cases containing emerging technologies or emerging domains in the market. To account for these we've chosen to note the fact that these are opinionated architectures based on internal reference architectures.   The product has been defined as complete for publishing when it contains the following content:     * Short use case definition  * Diagrams - logical, schematic (physical), and detail diagrams  * Public slide deck containing the use case story and architecture diagrams  * Internal slide deck containing both the pubic deck content and the    confidential customer research  * Video (short) explanation of the architecture  * Either a technical brief document or one or more articles covering the    solution architecture  Note that the above items noted in italics are all freely available to you online in the Red Hat Portfolio Architecture Center or in the Portfolio Architecture Examples repository.    FIGURE 2: LOGICAL DIAGRAM DESIGN TEMPLATE  TOOLING AND WORKSHOPS  The progress towards our products required a good idea of how we wanted to diagram our architectures. We chose to keep them very generic and simple in style to facilitate all levels of conversation around a particular use case without getting bogged down in notational discussions.    A simple three level design for our architectures was captured by using logical, schematic, and detail diagrams. All of these have been integrated in  with pre-defined templates and icons for easily getting started. Furthermore, we've developed a tooling workshop to quickly ramp up on the design methods and tooling we've made available. It's called , has been featured in several.   TELCO COLLECTION  The collection featured today is centred around architectures in the telco domain. There are three architectures in this collection and we'll provide a short overview of each, leaving the in depth exploration as an exercise for the reader.  Figure 3: Telco architecture collection  In each of these architecture overviews you'll find a table of contents outlining the technologies used, several example schematic diagrams with descriptions, and a link in the last section to open the diagrams directly into the online tooling in your browser.    5G is the latest evolution of wireless mobile technology that aims to enable the delivery of highly immersive experiences for people and ultra reliable, low latency communication between devices. At the heart of each 5G network lies the 5G Core (5GC).    This portfolio architecture conceives 5G Core as a set of disaggregated, cloud native applications that communicate internally and externally over well defined standard interfaces. Each 5GC component is implemented as a container-based application and is referred to as cloud-native network function (CNF).  The use case is ultra-reliable, immersive experiences for people and objects when and where it matters most.      5G is the latest evolution of wireless mobile technology. In this portfolio architecture we’ll discuss an 5G solution built with open source technologies at core, that can work across any hyperscaler.    The use case is building an adaptable, on-demand infrastructure services for 5G Core that can deliver across diverse use cases with minimal CAPEX and OPEX.    5G is the latest evolution of wireless mobile technology. It can deliver a number of services from the network edge:   * Enhanced mobile broadband (eMBB)         * 5G enhances data speeds and experiences with new radio capabilities like       mmWave frequency spectrum for higher bandwidth allocation and theoretical       throughput up to 20Gbps.   * Ultra-reliable, low-latency communication (uRLLC)         * 5G supports vertical industry requirements, including sub-millisecond       latency with less than 1 lost packet in 105 packets.   * Massive machine type communications (mMTC)         * 5G supports cost-efficient and robust connection for up to 1 million mMTC,       NB-IOT, and LTE-M devices per square kilometer without network       overloading.   The use case is base on the facts that digital transformation of mobile networks is accelerating and cloudification is increasing. Following the core network, radio access network (RAN) solutions are now taking advantage of the benefits of cloud computing.      If you are interested in more architecture solutions like these, feel free to export the  and for more architecture collection see:   * Application development  * Automation  * Data engineering  * Edge  * Finance  *   * Infrastructure  * Manufacturing  * Retail  *   * Utility  "
}