{
  "title": "Introducing the Keycloak Austria User Group",
  "link": "https://www.keycloak.org/2025/03/austria-user-group",
  "author": [
    {
      "name": "Christoph Kofler",
      "avatar": null
    }
  ],
  "date": "2025-03-05T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "Join the event on March 11th to , and subscribe to the Meetup to get invitations for future events. Read on to find out about previous topics that have been recorded and upcoming events.  --------------------------------------------------------------------------------  It happened to me several times that I was sitting in a workshop about any topic and the term “Keycloak” was used. Not in a spectacular tone, but rather like “We have Keycloak for this and that, and it just works!” Christian Kofler, who is working for Gepardec, had similar experiences. Thus, we already discussed some years ago that Keycloak is somehow an unsung hero, a hidden star, very much appreciated, but not in the spotlight of any encountering or events.  End of 2023, we concluded that we want to establish a local community in Austria, very informal, very technical - just for like-minded people to meet, give and take experiences and have a good time together. It was easy to set up the group in the meetup platform () and also announced the in March 2024 at the Red Hat Office in Vienna. To our positive surprise, we almost immediately jumped to 100 members and had 40+ participants on-site. The meeting was framed by a very nice greeting note from the Keycloak founder . We had two great sessions about and from the community and afterward beer and original Leberkäse from . The feedback was overwhelmingly positive, participants talked, laughed and connected till 9 pm.    This has motivated us to have two more gatherings in 2024, one at Posedio and one at ÖBB (“Austrian Railway systems”) who kindly offered to provide location, food and beverages. Again, the talks lead to lots of questions and discussions which lasted till the late evening. Moreover, we also have established a with all recorded sessions and many members from the local Austrian Keycloak community have participated in in September 2024, organized by .  We are looking forward to another which are already planned. If you are interested to participate and/or contribute a talk, please get in touch with us:  ,"
}