{
  "title": null,
  "link": "https://jbossts.blogspot.com/2023/09/a-review-of-recent-narayana-releases.html",
  "author": [
    {
      "name": "Michael Musgrove",
      "avatar": null
    }
  ],
  "date": "2023-09-06T08:46:00.003Z",
  "feed_title": "Narayana team blog",
  "content": "A REVIEW OF RECENT NARAYANA RELEASES  The last four releases of Narayana have brought some noteworthy changes, closing 86 issues in the process, which I’d like to summarise in this brief post. The contributions have come from both the broader community and the core Narayana team, thank you for that. The changes include bug fixes, dependency upgrades and tasks and features.   COMMUNITY   IMPROVE INCLUSIVENESS BY BUILDING A COMMUNITY OF USERS  We reviewed our , adding clarifying text to the and added a SECURITY.md file. The latest snapshot adds an email address for .   CONSCIOUS LANGUAGE  We also to ensure that we use welcoming language, free from offensive, othering, or otherwise problematic communication styles.   NEW ADDITIONS/FEATURES  All maven modules were migrated from Java EE to Jakarta EE (which included the main narayana repo plus the quickstart, jboss-transaction-spi and performance repos).  There is now a BOM for narayana (). To depend on the correct versions in your projects just include the following dependency:        <dependency>         <groupId>org.jboss.narayana</groupId>         <artifactId>narayana-bom</artifactId>         <version>latest version</version>         <type>pom</type>         <scope>import</scope>       </dependency>  The new license for Narayana is , it replaces LGPL and provides consumers with more flexibility when releasing their own software products that incorporate Narayana ().  Issue was resolved by a community contributor, it introduced support for . Virtual threads “dramatically reduce the effort of writing, maintaining, and observing high-throughput concurrent applications”. The change replaced many occurrences of the synchronized java keyword with which in most usages, but not all, should be semantically equivalent. The change is an API breaking change so we released the update in a major version, .   REMOVAL OF FEATURES  All modules have been migrated to Jakarta EE and Java EE is not supported.  Release removed the transformed Jakarta maven modules (ones that ended in “-jakarta”).  The OSGi module is no longer available, please refer to for the reason why this decision was made.  Quickstarts showing integration of have been temporarily disabled because at the time of the Jakarta migration, Tomcat and Spring had not yet added Jakarta support to their offerings. Issue JBTM-3803 was created for them to be re-enabled when Jakarta variants become available.   LONG RUNNING ACTIONS FOR MICROPROFILE (LRA)  Release was against MicroProfile LRA 2.0.  We added a Narayana specific to allow LRA participants to store data with the (3rd section) during the registration phase. The feature is configurable, using the approach, because some users may prefer not to entrust their business data with the coordinator.  The bug fix for facilitated , LRA support in WildFly was added with issue by Martin Stefanko, an active contributor to LRA. JBTM-3749 provided a partial fix for (Do not rely on thread locals for propagating LRA context) and it also included a recommending that users explicitly set the LRA context when JAX-RS resource methods perform outgoing JAX-RS invocations.  The latest snapshot of narayana includes documentation about configuring the , the details are in issue .   TRANSACTION LOGGING  Transaction managers log data in order to provide the property of a transactions. Narayana supports a variety of persistence stores, including logging to a database which we call the JDBCStore. included a quickstart for this store and introduced an option to supply the DataSource for connecting to the store at runtime for use with the Quarkus extension for ."
}