{
  "title": "Red Hat Summit Connect Dublin - Talking Architecture Shop",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/MZRHiGfq1wk/red-hat-summit-connect-dublin-talking-architecture-shop.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-10-20T05:00:00.000Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "The is a one day event,  part of a new series of small-scale events, that brings the discussion of open source technology to your local cities.   The day provides updates and insights into the latest technologies and will also offer the opportunity to get hands on with Red Hat technologies.  There will be different streams of session topics that will host tech talks led by Red Hat experts and also business focused sessions delivered from industry leaders including some fantastic partner and customer stories.  I've been invited to give a session in Dublin and wanted to share the planning with you for this event in November.   At the Red Hat Summit Connect in Dublin will be hosted at:  Date: Thursday 11 November 2021 Time: 10am-6pm GMT Location: The Convention Centre Dublin, Spencer Dock, North Wall Quay, Dublin 1, D01 T1W6, Ireland  I've been asked to share my insights into some of our larger architectures and explore how open source can be used at scale, so I'm putting together the following session for you.        TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE SUCCESS AT SCALE  You've heard of large scale open source architectures, but have you ever wanted to take a serious look at these real life enterprise implementations that scale? This session takes attendees on a tour of multiple use cases covering enterprise challenges like integration, optimisation, cloud adoption, hybrid cloud management, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own online experiences. The attendee departs this session with a working knowledge of how to map general open source technologies to their solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop!   Time: 16:30-17:00 (local time)  Be sure to register and hope to see you there!  "
}