{
  "title": "Intelligent data as a service (iDaaS) - Architectural introduction",
  "link": "http://www.schabell.org/2021/12/idaas-architetural-introduction.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-12-21T06:00:00.000Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "Part 1 - Architectural introduction  The last few months we have been digging deeply into the world of healthcare architectures with a focus on presenting access to ways of mapping successful implementations for specific use cases.    It's an interesting challenge in that we have the mission of creating architectural content based on common customer adoption patterns.    That's very different from most of the traditional marketing activities usually associated with generating content for the sole purpose of positioning products for solutions. When you're basing the content on actual execution in solution delivery, you're cutting out the chuff.   What's that mean?  It means that it's going to provide you with a way to implement a solution using open source technologies by focusing on the integrations, structures and interactions that actually have been proven to work. What's not included are any vendor promises that you'll find in normal marketing content. Those promised that when it gets down to implementation crunch time, might not fully deliver on their promises.  Enter the term Portfolio Architecture.   Let's look at these architectures, how they're created and what value they provide for your solution designs.     THE PROCESS  The first step is to decide the use case to start with, which in my case had to be linked to a higher level theme that becomes the leading focus. This higher level theme is not quite boiling the ocean, but it's so broad that it's going to require some division into smaller parts.   In this case presented here is we are looking closer at the healthcare industry and an intelligent data as a service (iDaaS) architecture. This use case we've defined as the following:    iDaaS is all about transforming the way the healthcare industry interacts with data and information. It provides an example for connecting, processing and leveraging clinical, financial, administrative, and life sciences data at scale in a consistent manner.     The approach taken is to research our existing customers that have implemented solutions in this space, collect their public-facing content, research the internal implementation documentation collections from their successful engagements, and where necessary reach out to the field resources involved.    Now on to the task at hand.      WHAT'S NEXT  The resulting content for this project targets the following three items.   * A slide deck of the architecture for use in telling the portfolio solution    story.  * Generic architectural diagrams providing the general details for the    portfolio solution.  * A write-up of the portfolio solution in a series that can be used for a    customer solution brief.  An overview of this series on intelligent data as a service architecture:   1.   2. Common architectural elements  3. Example iDaaS architecture  4. Example HL7 and FHIR integration architecture  5. Example iDaaS knowledge and insight architecture  Catch up on any past articles you missed by following any published links above.  Next in this series, we will take a look at the generic common architectural elements for the intelligent data as a service architecture. "
}