{
  "title": "Keycloak 21.0.2 released",
  "link": "https://www.keycloak.org/2023/03/keycloak-2102-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2023-03-30T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   MIGRATION FROM 20.0  Before you upgrade remember to backup your database. If you are not on the previous release refer to for a complete list of migration changes.   TERMS AND CONDITIONS USER ATTRIBUTE MIGRATION  The terms_and_conditions user attribute was accidentally changed in 21.0.0 to uppercase. This version reverts the user attribute back to lowercase. The value of the attribute is set when accepting Terms and Conditions page.  If any of your custom extensions relies on this attribute, you may need to adjust your code to check both attributes terms_and_conditions and TERMS_AND_CONDITIONS.   ALL RESOLVED ISSUES   BUGS   * Acquisition timeout while waiting for new connection keycloak storage  * adding package using microdnf no longer works since keycloak version 21    keycloak docs  * Can't accept terms and conditions after upgrade from 20.0.3 to 21.0.0    keycloak authentication  * Avoid recording raw UUIDs URIs in metrics like http_server_requests_seconds    collected via micrometer keycloak dist/quarkus  * `testReleaseAllLocksMethod` test is intermittently timing out with HotRod    store keycloak storage  * Build on Windows fails keycloak docs  * OutOfMemoryError when running Model Tests in CI keycloak storage  * Unable to use client tls certificate bound access token with the new admin UI    keycloak  * Accessibility/Identity Providers: Critical Issues keycloak admin/ui  * Accessibility/Realm Settings: Critical Issues keycloak admin/ui  * Accessibility/Groups: Critical Issues keycloak admin/ui  * Accessibility/Users: Critical Issues keycloak admin/ui  * Accessibility/Clients List: Critical Issues keycloak admin/ui  * Missing visual error information for \"Error while evaluating permissions\"    keycloak admin/ui  * With KC21: Authentication flows \"used by\" shows the name of the flow, not of    the bind keycloak admin/ui  * Wrong role required for Client Settings > Advanced > OpenID Connect    Compatibility Modes keycloak admin/ui  * Inconsistent SAML configuration generated for clients with forceNameId    keycloak admin/ui  * admin-ui: authz permissions tab not updated when switching between groups    keycloak admin/ui  * Alerts don't show in Keycloak nightly, also disrupting user feedback on    actions keycloak admin/ui  * In Authorization --> Evaluate, Users and Roles should not both be requred    keycloak admin/ui   UPGRADING  Before you upgrade remember to backup your database and check the for anything that may have changed."
}