{
  "title": "Kogito Tooling Released! 10k+ installs on BPMN extension, Dashbuilder Runtime in Quarkus, and an outstanding KIE Live next week!",
  "link": "https://blog.kie.org/2021/11/kogito-tooling-released-10k-installs-on-bpmn-extension-dashbuilder-runtime-in-quarkus-and-an-outstanding-kie-live-next-week.html",
  "author": [
    {
      "name": "Eder Ignatowicz",
      "avatar": null
    }
  ],
  "date": "2021-11-19T05:00:00.000Z",
  "feed_title": "KIE Community",
  "content": "We have just launched a fresh new Kogito Tooling release! 🎉 On the 0.14.1 , we made a lot of improvements and bug fixes.  This post will give a quick overview of our most recent . I hope you enjoy it!   DON’T MISS THE KIE LIVE NEXT WEEK  Our beloved .new environment will receive a massive update! Dealing with complex models and collaborating with others will become much easier.  Join us on the 23rd of November in the next for a walkthrough of the new features and new integrations we have with the Developers’ most beloved tools.   10K+ USERS OF VS CODE BPMN EXTENSION  Our just reached an important milestone on VS Code Store: 10k+ individual installs! Congrats to Roger (tech lead) and all the BPMN/Stunner team.   AUTOMATICALLY GENERATE BPMN/DMN SVG ON VS CODE  To provide better integration with the KIE server and Business Central, on the Kogito Tooling 0.14 release, we introduced a way to, on VS Code, automatically generate SVG on each save of your BPMN and DMN Diagram. Take a look at this feature in action:  Please take a look at this for further details!   DASHBUILDER RUNTIME RELEASED ON KOGITO TOOLING  We are glad to announce that we are releasing ! The major change for this new release is the adoption of Quarkus as the backend for DashBuilder Runtime and the introduction of DashBuilder Authoring, a new tool to create dashboards.  From now on, we will also follow the Kogito Tooling release cadence! Soon we will publish a blog post with more details!   CANVAS API  We also just released the first iteration of a for node manipulation in our editors. This new API allows to manipulate the shapes in the canvas, so third parties can play with the different objects in the canvas   VISUALIZE, EDIT, AND SHARE YOUR BPMN, DMN, AND PMML WITH GITHUB.DEV  Some weeks ago, GitHub released github.dev which allows you to open any repository in VS Code directly from your browser just pressing . (dot key) on it. On Kogito Tooling 0.13.0 release, we updated our VS Code BPMN, DMN, and PMML extension to also work on this innovative environment. Check it out:  Please take a look at this for further details!   NEW FEATURES, FIXED ISSUES, AND IMPROVEMENTS   * – Editor content sanitization  * – [DMN Designer] User changes are lost  * – Generate a SVG diagram automatically on each BPMN/DMN diagrams save  * – [DMN Designer] Improve BKM description rendering on documentation tab  * – Stunner – Create an initial JS / TS API for accessing the canvas and its    elements  * – ScoreCard: MiningField validation  * – Mining Schema (PMML Editor test Suite)  * – [VSCode] Custom editor save issues  * – Editors – Editing the node name and pressing enter to confirm  * – [DMN Designer] Unreadable data type information in PDF document that shows    DMN decision model  * – [DMN Designer] Background color do not work on DMN Editor (online and    VSCode)  * – [DMN Designer] Multiple DRDs – Renaming a DRD freezes the browser  * – Online DMN Editor should support deployment to any Openshift Cluster other    than Dev Sandbox  * – Collections Data Objects can be filled with expressions only.  * – Standalone DMN editor missing isDirty indication on data type or included    models change  * – Create the second step of the Wizard – Create the collapsible/expandable    list of future Data Types  * – BPMN Editor – Containment not working when Node overlaps the Connector    while splicing  * – formInputs should be parsed with dates as objects, not strings.  * – Get the Route through the REST API and remove the console URL property.  * – Enable extensions for github.dev.  * – Activate the DMN dirty indicator test  * – DMN Guided tour cypress tests  * – Introduce DMN Runner cypress test  * – ScoreCard Model Setup Test  * – Score Cards: Algorithm Name cannot be cleared  * – Score Cards: Data Dictionary: Remove duplication of delete icons  * – Metadata atrribute ‘elementname’ not present for events, intermediate    events & gateways by default  * – Filled DateTime field on Dev Sandbox form break Runner when it’s opened on    Online Editor  * – kogito-examples non unique packages  * – kogito-editors-java pre push hooks  * – [DMN Designer] New Boxed Expression editor – Remove grip from the new boxed    expression editor  * – Improvements for the KIE Tooling Extended Services outdated icon  * – Fix Quarkus Dev UI DEV mode   FURTHER READING/WATCHING  We had some excellent blog posts on Kie Blog and Kie Lives that I recommend to you:   * , by Paulo;  * , by Tiago Dolphine;  * , by Pere;  * , by Paulo;   THANK YOU TO EVERYONE INVOLVED!  I would like to thank everyone involved with this release, from the excellent KIE Tooling Engineers to the lifesavers QEs and the UX people that help us look awesome!  The post appeared first on .  "
}