{
  "title": "Recap Keycloak at KubeCon NA 2024",
  "link": "https://www.keycloak.org/2024/12/keycloak-at-kubecon-na-2024-recap",
  "author": [
    {
      "name": "Ryan Emerson",
      "avatar": null
    }
  ],
  "date": "2024-12-04T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "Keycloak had a very active presence at this year’s KubeCon NA in Salt Lake City, Utah. This blog presents a few of the highlights as well as ways you can contribute to Keycloak’s CNCF journey.   PROJECT PAVILION  Keycloak hosted a project pavilion stand during Wednesday, Thursday and Friday afternoon slots. Attending the booth were Keycloak contributors from Hitachi and , and from Red Hat.  During these sessions, we discussed all things Keycloak with existing and prospective users, as well as provided the much requested Keycloak stickers plus additional swag for particularly enthusiastic users. It was great to hear war stories from the trenches with regard to both the good and bad of Keycloak. This feedback is essential for us to continue to evolve the project and plan the future roadmap. A special thanks to all of those who filled out our survey forms, we really appreciate your time. If you were unable to attend the pavilion, please consider filling out the .     KEYCLOAK TALK  and presented a talk titled “Running a Highly Available Identity and Access Management with Keycloak”. to hear about the recent developments in Keycloak’s HA story, including an overview of the architecture recommended in the Keycloak guides, the lessons learned during the development of said guides and the CNCF technologies used as part of our stack. A video of the talk is linked below.    Thank you to all who attended and asked questions, there were good follow-up conservations that continued well after our time was up.   KEYCLOAK SURVEY  Are you a Keycloak user who is deploying in production or just considering starting with Keycloak? We would love to hear more from you about your success stories, what is crucial to your deployments and what can be done better. Please fill out the , so we can better understand your use cases.  Your story maybe a candidate for a . If you would like to share your success story with our community, answer yes to the “Would you be interested to share your story with our broader community?” and we will be in touch shortly.   KUBECON EU  In 2025, will be held in London on April 1-4th, we hope to see you there and hear your latest Keycloak stories. As it’s still very much early days, we cannot provide any specifics, but be assured that we’ll publish more information in the near future."
}