{
  "title": "Integrating Red Hat Process Automation Manager and Red Hat AMQ Streams on OpenShift in 4 steps",
  "link": "http://feeds.athico.com/~r/droolsatom/~3/kne3WIvD6EM/integrating-red-hat-process-automation-manager-and-red-hat-amq-streams-on-openshift-in-4-steps.html",
  "author": [
    {
      "name": "Sadhana Nandakumar",
      "avatar": null
    }
  ],
  "date": "2021-07-20T13:44:25.000Z",
  "feed_title": "KIE Community",
  "content": "An event-driven architecture is a model that allows communication between services in a decoupled fashion. This pattern has evolved into a powerful software paradigm and covers a wide array of use cases. Apache Kafka is an open-source distributed event streaming platform used by thousands of companies for high-performance data pipelines, streaming analytics, data integration, and mission-critical applications. With this industry evolution, we can now create event-driven business processes which can work seamlessly in a microservices-based environment. With the latest release of Red Hat Process Automation Manager (7.11), you can work with business processes capable of interacting with external services via events, either by emitting or consuming them.  Earlier this year,  wrote a detailed  about the integration between Red Hat Process Automation Manager and Kafka. In this article, we will look at the integration of Red Hat Process Automation with Red Hat AMQ Streams on OpenShift. Red Hat AMQ Streams is an enterprise grade Kubernetes-native Kafka solution.  In IT today, it can be both challenging and time-consuming for operations and development teams to be experts in many different technologies knowing how to use them, while also knowing how to install, configure, and maintain them. Kubernetes operators help streamline the installation, configuration, and maintenance complexities. We will be using the AMQ Streams Operator and the Business Automation Operator to help simplify the process.  In this article you’ll see how to deliver and test an event-driven process application on OpenShift in four steps:   1. Kafka deployment on OpenShift  2. Red Hat Process Automation Manager deployment on OpenShift  3. Creation and deployment of the business application  4. Test of the business application using events  To learn more check with a detailed step-by-step guide.  The post appeared first on .  "
}