{
  "title": "Supply chain integration - Example store integration architecture",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/57bT5V1qM3Y/supply-chain-integration-example-store-integration-architecture.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-03-16T06:00:00.000Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "Part 3 - Example store integration architecture   In  from this series shared a look at the logical common architectural elements found in supply chain integration for retail stores.    The process was laid out how I've approached the use case and how portfolio solutions are the base for researching a generic architectural blueprint.    It started with laying out the process of how I've approached the use case by researching successful customer portfolio solutions as the basis for a generic architectural blueprint.   Having completed our discussions on the logical view of the blueprint, it's now time to look at a specific example.  This article walks you through an example store integration scenario showing how expanding the previously discussed elements provides a blueprint for your own store integration scenarios.     BLUEPRINTS REVIEW  As mentioned before, the architectural details covered here are base on real solutions using open source technologies. The example scenario presented here is a generic common blueprint that was uncovered researching those solutions. It's my intent to provide a blueprint that provides guidance and not deep technical details.  This section covers the visual representations as presented, but it's expected that they'll be evolving based on future research. There are many ways to represent each element in this architectural blueprint, but I've chosen a format that I hope makes it easy to absorb. Feel free to post comments at the bottom of this post, or  with your feedback.   Now let's take a look at the details in this blueprint and outline the solution.        STORE INTEGRATION ARCHITECTURE  The story behind store integration of their supply chain is that you have many distinct actors involved, as you see starting on the right side of the diagram above. There are suppliers, order managers, warehouse management staff, and any number of third-party supply chain systems that need to have access for providing data to and from the supply chain systems.    Using API management regulates the authorisation and authentication before access is granted to the integration framework. Note the use of event streams which is an indicator that there is an attempt to provide quick processing and action around events in the supply chain lifecycle. This allows for up to the minute reporting on data, supply volumes, and other interesting data for the retail organisation.   Message transformation is a core need when connecting systems and data messages through an integration backend, as not all messages are going to map easily from one system to another, or from one microservice to another. Using a transformation service allows for a consistent data model for the organisation regardless of the destination end point needs.    The core integration framework is found in the supply chain microservices, a collection of microservice integrations that manages all the needs of the actors directly providing or requesting information around the retail supply chain.   Supporting access to the Retail Data Framework, a separate and detailed architecture blueprint to be covered in another series, you'll find integration data microservices specifically helping with data access and processing. Along the same lines you have integration microservices tying together all external systems such as third-party supply chain systems and any eventual use of an AI / Machine Learning platform.   The core to supply chain integration remains a solid fundamental need for cloud-native integration technologies and ongoing maintenance structures in a retail organisation to support them.      WHAT'S NEXT  This was just a short overview of the common generic elements that make up our architecture blueprint for the supply chain integration use case.    An overview of this series on the supply chain integration portfolio architecture blueprint can be found here:   1.   2.   3.   Catch up on any articles you missed by following one of the links above.   This completes the series and we hope you enjoyed this architecture blueprint for supply chain integration in retail.   (Article co-authored by , Chief Architect Retail, Red Hat) "
}