{
  "title": "CodeReady Containers - Building a Cloud-Native Human Resources Process",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/993ZpP28jA0/codeready-containers-building-cloud-native-hr-process.html",
  "author": [
    {
      "name": "Eric D. Schabell"
    }
  ],
  "date": "2020-10-21T05:00:00.008Z",
  "feed_title": "Eric D. Schabell",
  "content": "  As a cloud-native developer you've development environment on your local machine, but what's next?   What can you do with the fully stocked container registry provided to you?   There is no better way to learn about container technologies, cloud native methods, and container-based application development than getting hands-on with great open technologies.   This article targets getting you started on your new by putting the latest process automation developer tooling at your disposal together with a real project for you to deploy and explore.  Even better, if you need more help getting started, we'll provide a free online workshop where you can build this project yourself.   This articles outlines getting started with the  on the above installation as default, though you can point this installation to any existing OpenShift Container Platform (pass an IP address). Let's get started right now exploring the new developer tooling for process design, user tasks, forms, rules, and business logic in just a few simple steps.    PROCESS AUTOMATION DEVELOPER TOOLING   This is how it's going to work, first we're installing the using the latest provided container catalog image. Next, we're using that tooling API to import the HR employee rewards project.    This means upon logging in, you'll find a project ready to go and it delivers on the promise of a fully functioning developer process automation tooling containerized on your OpenShift Container Platform.     INSTALL ON CODEREADY CONTAINERS  There are two options to install and run this project on the OpenShift Container Platform; use your own existing installation or to install on CodeReady Containers which provides you with a local OpenShift cluster.  1. Ensure you have a CodeReady Containers installation:   * your own Code Ready Containers installation, if using this you just need to    set the variables to point to it in init.{sh|bat} script.   *    2.    3. Run 'init.sh' or 'init.bat' file. 'init.bat' must be run with Administrative     privileges:          # If using CodeReady Containers Easy Install project, just add the cluster     # address to HOST_IP variable found at the top of the init.{sh|bat} files:    #    # HOST_IP=api.crc.testing      #     # Now run the script without any arguments and it uses the hostname:    #    $ ./init.sh  Log in to the HR Employee Rewards project to start exploring an online employee rewards application (the address will be generated by the init script):   * CodeReady Container example: ( u:erics / p:redhatpam1! )  Want to build the Rewards demo from scratch? Try this hands-on .    "
}