{
  "title": "Saying goodbye to Red Hat",
  "link": "http://www.schabell.org/2022/07/saying-goodbye-to-red-hat.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-07-08T05:00:00.001Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "My tenure: 2009-2022  The time has come... the end of my tenure at Red Hat after +13 years.      How about a short summary of some of the highlights while at Red Hat before I move on to a new adventure?   I'll try to capture the big milestones, but there are just so many that I'm sure to miss a few.   It's a moment of reflection on more than a decade spent in the world of enterprise open source technologies and riding a wave that was Red Hat in the prime of its evolution in the industry.  I have been involved in open source since my introduction late in life to programming, operating systems, and Linux in 1996. Before joining Red Hat I was involved in the community around a business process management project called . We were using this heavily in the financial institution I was working at and I became active as you do when you submerge yourself into an open source technology.  In those days it was still jBPM 3 and we were having the time of our lives learning to model and implement processes. We even went crazy with a , to just give you an example of what we thought was possible back in those days.     It all led to Red Hat knocking on my door in 2009 to join the Netherlands team as their first middleware (JBoss) solution architect.     At the time I joined I remember the SA team was about 15 associates across Europe, Red Hat had around 2000 associates world wide, and the stock price was between $22-$24 (later sold to IBM for $190).      It was incredible fun and there was a very active start up feel to what we were doing. My experiences with JBoss technologies and specifically the Business Rules Management System (BRMS) led to me spending more time across Europe helping other sales teams than in my own region. I was also still active in the community around those products, meaning Drools, jBPM, and other JBoss projects upstream.     This role I held for approximately three years before the product orgnanization came knocking. My contacts in the product teams led to my being asked to join the Middleware Business Unit as one of their first MW Technical Marketing Managers or TMM. At this time I think we had like 4-5 products so one person could manage the role. I ended up spending around four years in this role and we grew not only our MW product portfolio, but the team eventually grew out to five TMM's before I moved on.   We worked on products like JBoss SOA-P, Switchyard, JBoss Virtualization, JBoss BPM Suite, the first versions of OpenShift (remember gears?), and so much more. This role required enablement sessions being delivered to the field and we visited all our regional offices; APAC (Singapore, Tokyo, Beijing), EMEA (Munich, London, Stockholm, Madrid, Amsterdam, Brussels, Rome, Warsaw, etc), NA (Boston, Dallas, Raleigh, Mountain View, Portland, St. Louis, Tampa, etc), and LATAM (Mexico City, San Paulo, etc).       Right at the end of that role I got the chance to move to the US, out on an island off the coast of North Carolina for a year. Quite the adventure and my family loved every minute of our island time.   The next role to come along was in a brand new business unit, called the Integrated Solutions Business Unit, setup to try and pull together the first multi-product products for our field to sell. I spent the next two years working with some serious rock stars as we pulled together Red Hat Cloud Infrastructure and Red Hat Cloud Suite products. I was the TMM for both of these, and due to our PMM leaving before the launch of the Red Hat Cloud Suite I picked up the PMM work for the product launch.   Part of this period also involved the setting up of the internal Red Hat TMM Practice, where all existing and new TMM's could find a baseline on how to be effective in their roles. We also worked with Red Hat HR and developed a well defined ladder for the creation of the official TMM role in Red Hat.   My final role was to help setup a new concept, that of the Portfolio Architecture team. We have spent the last four years defining, researching, receiving field feedback, and creating 25 published architectures that you can explore on the Red Hat Portfolio Architecture Center. This team started with just three of us, but has since grown out to seven and I had the honour of being the technical director of this developing product.   All along this journey through Red Hat I've spent many hours mentoring all manner of TMM's (and other associates) as I am a true believer that we all have something to share to make others better.      I never suspected how long this would last when I walked into that first interview and they asked me to draw a SOA architecture on a whiteboard. I look around now 13 yrs, 106 days later and I'm still engaged at Red Hat.   Now this brings me to the part were we say goodbye and thank you all for the fun we've had together. There are so many colleagues that have become both friends and family, so it's not even possible to name them (but you know who you are). My last day is next week Friday, 15 July.  What's next you ask?   Stay tuned for more on that after I take a break between the old and the new. "
}