{
  "title": "CodeReady Containers - Exploring a home loan mortgage process",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/mfz57mllqss/codeready-containers-exploring-home-loan-mortgage-process.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2020-12-22T06:00:00.016Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " As a cloud-native developer you've  development environment on your local machine, but what's next?   What can you do with the fully stocked container registry provided to you?   There is no better way to learn about container technologies, cloud native methods, and container-based application development than getting hands-on with great open technologies.   This article targets getting you started on your new  by putting the latest process automation developer tooling at your disposal together with a real project for you to deploy and explore.  Even better, if you need more help getting started, we'll provide a free online workshop where you can build this project yourself.   This articles outlines getting started exploring a home loan mortgage project on OpenShift platform. Let's get started right now exploring the new developer tooling for process design, user tasks, forms, rules, and business logic in just a few simple steps.    PROCESS AUTOMATION DEVELOPER TOOLING   This article walks through installing the Red Hat Process Automation Manager on OpenShift Container Platform on your local machine using the provided operator. It's leveraging CodeReady Containers and delivers a fully functioning container-native development experience.    This means upon logging in, you'll find a project ready to go and it delivers on the promise of a fully functioning developer process automation tooling containerized on your OpenShift Container Platform.     INSTALL ON CODEREADY CONTAINERS  There are two options to install and run this project on the OpenShift Container Platform; use your own existing installation or to install on CodeReady Containers which provides you with a local OpenShift cluster.   1. Ensure you have installed OpenShift with   2.    3. Run 'init.sh' or 'init.bat' file. 'init.bat' must be run with Administrative     privileges.  Now log in to the mortgage project to start exploring a home loan mortgage process (the address will be generated by the init script):   * CodeReady Container example: ( u:erics / p:redhatpam1! )  Want to build the mortgage process project from scratch? Try this hands-on .   RUNNING THE DEMO   1.  Click on the \"Mortgage-Demo\" project to open the Mortgage Demo project.         2.  The project has a data model (Applicant, Application, Appraisal, Property,      and ValidationError), 9x guided rules, a mortgage calculation guided      decision table, 2x technical rules, 10x task forms, and a mortgage      application process.   3.  Build and deploy version 1 of the project. Click on the \"Build and Deploy\"      in the upper right corner.   4.  Go to \"Menu -> Deploy -> Execution Servers\" repository to see the      mortgage_1 KIE Container deployed on the Process Automation Server.   5.  Go to \"Menu -> Manage -> Process Definitions\" to see the      MortgageApplication process version 1.0 has been deployed.   6.  Click on the process definition line, then start a New Process Instance      with button in the top right corner.   7.  Fill in the Mortgage Application form as follows and click on Submit      button:            > Name: Eric D. Schabell      >       > SSN: 123456789      >       > Annual Income: 90000      >       > Property Address: somewhere 109      >       > Sale Price: 200000      >       > Mortgage Amorization: 30      >       > Down Payment: 20000   8.  Go to \"Menu -> Manage -> Process Instances\" and select the process instance      listed as running that you just started. This give the options to look at      Instance Details, Process Variables, Documents, Logs, and Diagrams. Let's      look at where this process is right now by selecting the Diagrams tab.   9.  The red box around the \"Manually Appraise Borrower\" task means we need to      decide if our applicant is to be trusted to buy this property, so go to the      \"Menu -> Manage -> Tasks\" and selecting the waiting task.                                 10. Click on \"Claim\" button at the bottom followed by clicking on the \"Start\"      task button (standards-based user task completion steps mandate these phase      labels for tasks) to edit the provided task form field. There is only one      field to edit, the Appraised Value so set this property to the esitmated      value as follows:            > Appraised Value: 200000   11. After submitting the form by clicking on the \"Complete\" button the task      disappears. Go to \"Menu -> Manage -> Process Instances\" and in the filters      panel on the left put a check-box in the \"Completed\" field to view      completed process instances. Find your just completed process instance,      select it from the list, and open the \"Diagram\" tab to view the greyed out      boxes that depict the path taken through this mortgage process. You should      see that this mortgage loan request has completed in the \"Mortgage      Approved\" final end node of the process.   12. You can play with various values to take different paths through the      process while applying for mortgage loans. You can also explore, modify      rules, redeploy the process, and try any combinations you like.  Hope you enjoy this project and your journey learning to make the most of this process automation tooling. "
}