{
  "title": "DevOpsDays Raleigh 2022 - Talking Architecture Shop (accepted)",
  "link": "http://www.schabell.org/2022/03/devopsdays-raleigh-2022-talking-architecture-shop-accepted.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-03-07T06:00:00.004Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " I've that I was trying to join the DevOpsDays Raleigh 2022 conference this year, to be hosted on April 13-14 in Raleigh, NC.   I submitted a few talks, a workshop, and crossed my fingers to await the selection committee results.  The verdict is in, I've got a session talking architecture shop selected. It's going to be fun to share my teams research and development of open source DevOps architectures.  Here's the talk and abstract and really looking forward to seeing you all in person!    My session is from a series called Talking Architecture Shop. This is focusing on architecture research for solutions in the DevOps domain that scale and will be co-presented with my good friend .   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE DEVOPS AT SCALE   You've heard of large scale open source architectures, but have you ever wanted to take a serious look at these real life enterprise DevOps implementations that scale? This session takes attendees on a tour of multiple use cases covering DevOps challenges with hybrid cloud management with GitOps, DevOps in healthcare, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own online experiences. The attendee departs this session with a working knowledge of how to map general open source technologies to their solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop!   Finally, remember to  and join the fun for a really interesting array of DevOps talks and workshops.   "
}