{
  "title": "Keycloak 17.0.0 released",
  "link": "https://www.keycloak.org/2022/02/keycloak-1700-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2022-02-11T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   RELEASE NOTES   HIGHLIGHTS  QUARKUS DISTRIBUTION IS NOW FULLY SUPPORTED  The default Keycloak distribution is now based on Quarkus. The new distribution is faster, leaner, and a lot easier to configure!  We appreciate migrating from the WildFly distribution is not going to be straightforward for everyone, since how you start and configure Keycloak has radically changed. With that in mind we will continue to support the WildFly distribution until June 2022.  For information on how to migrate to the new distribution check out the .  QUARKUS DISTRIBUTION UPDATES  A lot of effort went into polishing and improving the Quarkus distribution to make it as good as an experience as possible. A few highlights include:   * A new approach to documentation in form of server guides to help you install    and configure Keycloak   * Upgraded Quarkus to 2.7.0.Final   * Configuration file is no longer Java specific, and aligns configuration keys    with CLI arguments   * Clearer separation between build options and runtime configuration.   * h2-mem and h2-file databases renamed to dev-mem and dev-file.   * Simplified enabling and disabling features   * Custom, and unsupported, Quarkus configuration is done through    conf/quarkus.properties.   * Ability to add custom Java Options via JAVA_OPTS_APPEND (thanks to )   * Initial logging capabilities   * Initial support for Cross-DC   * User-defined profiles are no longer supported but using different    configuration files to achieve the same goal   * Quickstarts updated to use the new distribution == Other improvements  OFFLINE SESSIONS LAZY LOADED  The offline sessions are now lazily fetched from the database by default instead of preloading during the server startup. To change the default behavior, see .  IMPROVED USER SEARCH  Keycloak now supports a glob-like syntax for the user search when listing users in the Admin Console, which allows for three different types of searches: prefix (foo* which became the default search), infix (*foo*), and exact \"foo\")   MIGRATION FROM 16.1  Before you upgrade remember to backup your database. If you are not on the previous release refer to for a complete list of migration changes.   DEFAULT DISTRIBUTION IS NOW POWERED BY QUARKUS  The default distribution of Keycloak is now powered by Quarkus, which brings a number of breaking changes to you configure Keycloak and deploy custom providers. For more information check out the .  The WildFly distribution of Keycloak is now deprecated, with support ending June 2022. We recommend migrating to the Quarkus distribution as soon as possible. However, if you need to remain on the legacy WildFly distribution for some time, there are some changes to consider:   * Container images for the legacy distribution tags have changed. To use the    legacy distribution use the tags legacy or 17.0.0-legacy.   * Download on the website for the legacy distribution has changed to    keycloak-legacy-17.0.0.[zip|tar.gz].  If you encounter problems migrating to the Quarkus distribution, missing ability to configure something, or have general ideas and feedback, please open a discussion in .   MIGRATING FROM THE PREVIEW QUARKUS DISTRIBUTION  A number of things have changed since the preview Quarkus distribution was released in Keycloak 15.1.0. The ideal way to learn about what’s changed is to check out the new . In summary, the changes include:   * Container now published to quay.io/keycloak/keycloak:latest and    quay.io/keycloak/keycloak:17.0.0   * Download on website renamed to keycloak-17.0.0.[zip|tar.gz].   * conf/keycloak.properties changed to conf/keycloak.conf, which unifies    configuration keys between the config file and CLI arguments.   * Clearer separation between build options and runtime configuration.   * Custom Quarkus configuration is done through conf/quarkus.properties.   * h2-mem and h2-file databases renamed to dev-mem and dev-file.   * Features are now enabled/disabled with --features and --features-disabled    replacing the previous approach that had an separate config key for each    feature.   * Runtime configuration can no longer be passed to kc.[sh|bat] build and is no    longer persisted in the build   * Logging level and format is now configured with --log-level and --log-format,    while in the past these had to be configured using unsupported Quarkus    properties.   CLIENT POLICIES MIGRATION : CLIENT-SCOPES  If you used a policy including client-scopes condition and edited JSON document directly, you will need to change the \"scope\" field name in a JSON document to \"scopes\".   LIQUIBASE UPGRADED TO VERSION 4.6.2  Liquibase was updated from version 3.5.5 to 4.6.2, which includes, among other things, several bug fixes, and a new way of registering custom extensions using ServiceLoader.  Migration from previous Keycloak versions to Keycloak 17.0.0 has been extensively tested with all currently supported databases, but we would like to stress the importance of closely following the , specifically of backing up existing database before upgrade. While we did our best to test the consequences of the Liquibase upgrade, some installations could be using specific setup unknown to us.   ALL RESOLVED ISSUES   NEW FEATURES   * Convert MapUserEntity to interface keycloak storage  * Create Operator.X module in repo keycloak operator  * Keycloak.X deployment keycloak operator  * Realm CRD keycloak operator  * Testsuite baseline keycloak operator  * Let users configure Dynamic Client Scopes keycloak  * Create an internal representation of RAR that also handles Static and Dynamic    Client Scopes keycloak  * Handle Dynamic Scopes correctly in the consent screen keycloak  * Publish ECMAScript Modules for keycloak-js keycloak adapter/javascript  * Package server guides to be used in the website keycloak dist/quarkus  * JPA map storage: Client scope no-downtime store keycloak storage  * Convert authorization services entities into interface keycloak storage  * Generate the CRD from RealmRepresentation keycloak operator  * Improve user search query keycloak storage  * Configurable session limits keycloak authentication   ENHANCEMENTS   * Update Kubernetes and OpenShift examples used by getting started guides to    use Quarkus dist keycloak-quickstarts  * Update getting-started in QuickStarts to use Quarkus dist    keycloak-quickstarts  * Update default container to Quarkus keycloak-containers  * Update legacy image coordinates in the image manager keycloak-operator  * Update documentation for Quarkus distribution keycloak-documentation  * Release notes for Keycloak 17 keycloak-documentation  * Migration from Keycloak.X preview keycloak-documentation  * Convert MapRoleEntity to interface keycloak storage  * Documentation for Quarkus distribution keycloak dist/quarkus  * Disable pre-loading offline sessions by default keycloak dist/quarkus  * Remove Hashicorp Support keycloak dist/quarkus  * Make JsonbType generic keycloak storage  * Tree storage: introduce notion of per-field primary and cached status in an    entity keycloak storage  * Provide documentation for proxy mode in Quarkus based Keycloak keycloak    dist/quarkus  * Review README files. keycloak dist/quarkus  * Add indexing to HotRodGroupEntity keycloak storage  * Make JpaClientStorage* classes generic keycloak storage  * Refactor generated constructors in new store entities keycloak storage  * Avoid building configuration all the time when running tests keycloak  * Remove override on xmlsec in quarkus/pom.xml keycloak dist/quarkus  * Database configuration tests keycloak  * Upgrade Infinispan to 12.1.7.Final keycloak storage  * Cross-site validation for lazy loading of offline sessions keycloak storage  * Switch default offline sessions to lazy loaded keycloak docs  * HotRod map storage uses regex pattern that could be precompiled keycloak    storage  * Add configuration guide keycloak dist/quarkus  * Validation for CIBA binding_message parameter keycloak  * Upgrade Liquibase to 4.6.2 keycloak storage  * Add more details about 2FA to authenticate page keycloak  * Verify the WebAuthn functionality and settings for authentication keycloak    testsuite  * Enable only TLSv1.3 as default for the https protocol and set expected values    keycloak dist/quarkus  * Backward compatibility for lower-case bearer type in token responses keycloak  * Test scenarios for verifying of JS injection for WebAuthn Policy keycloak    testsuite  * Improve the kustomize setup for the operator keycloak operator  * Readiness and Liveness probe for the operator deployment of Keycloak.X    keycloak operator  * Multiple warnings caused by typed varargs in TokenVerifier keycloak  * optimize title/summary and headlines for proxy guide keycloak dist/quarkus  * Add support to linking between guides keycloak docs  * Remove output of summary in guides keycloak docs  * Build command should only accept built-time options keycloak dist/quarkus  * Exclude some folders from our SAST analysis keycloak  * Convert MapClientScopeEntity to interface keycloak storage  * Add a quarkus.properties for unsupported configuration options keycloak    dist/quarkus  * Remove any reference to configuration profile keycloak dist/quarkus  * Remove system property from help message keycloak dist/quarkus  * Hide Hasicorp Vault from CLI keycloak dist/quarkus  * Improve enabling/disabling features in Quarkus distribution keycloak    dist/quarkus  * Device Authorization Grant with PKCE keycloak  * Adpaters for Map Storage swallow multi-valued attribute while Keycloak Core    doesn't support them keycloak storage  * Restrict Dynamic Scopes to optional Client Scopes keycloak  * Add section recommended exposed paths to reverse proxy documentation keycloak    docs  * Combine package files for JS adapter keycloak adapter/javascript  * Add test scenarios for Passwordless Webauthn AIA keycloak testsuite  * Extend and fix tests for Resident Keys for WebAuthn keycloak testsuite  * Store information about transport media of WebAuthn authenticator keycloak    authentication/webauthn  * Sort options in guides by key keycloak docs  * Update default ZIP distribution to Quarkus keycloak dist/wildfly  * Complete support for Passwordless tests keycloak testsuite  * Use keycloak.v2 admin theme by default if admin2 is enabled keycloak admin/ui  * Quarkus update to 2.7.0 Final keycloak dist/quarkus  * Initial logging support keycloak dist/quarkus  * Add support for pinning guides to the top keycloak docs  * Implement the Dynamic Scopes parsing for the    resource-owner-password-credentials grant. keycloak oidc  * Verify if enabling authentication and encryption for JGroups work on Quarkus    dist keycloak dist/quarkus  * Add note about escaping of vaules for config keycloak dist/quarkus  * Logging guide for Quarkus dist keycloak dist/quarkus  * Update com.github.ua-parser:uap-java to 1.5.2 keycloak dependencies  * Remove external Collection utility class for WebAuthn keycloak    authentication/webauthn  * Cover enabling mtls in TLS guide keycloak dist/quarkus  * Updated use of generics in JPA Map Storage keycloak storage  * Create common parent for Jpa*AttributeEntity keycloak storage  * Reduce Keycloak.x image size keycloak dist/quarkus   BUGS   * Incorrect dependency in package.json keycloak-nodejs-connect  * KeycloakAuthenticatorValve (Tomcat) does not implement    createRequestAuthenticator() keycloak adapter/jee  * Spurious logs are spilling in Quarkus Distribution.X integration tests    keycloak dist/quarkus  * The title of the login screen is not translated into Japanese keycloak  * Quarkus relational database setup documentation error keycloak  * \"look-ahead window\" of TOTP should be \"look around window\" keycloak  * Expected Scopes of ClientScopesCondition created on Admin UI are not saved    onto ClientScopesCondition.Configuration keycloak authorization-services  * Password credential decoding from DB may fail in rare cases - No login    possible keycloak  * Dist.X cannot connect to external Postgres if the password ends with an =    sign keycloak  * Dist.X apparently doesn't apply correctly the db schema keycloak  * JPA-Map storage might loose writes due to missing locking mechanism keycloak    storage  * Multiple active tabs when realm name equals name of tab in Admin console    keycloak admin/ui  * Missing german translation for webauthn-doAuthenticate keycloak translations  * Hard coded message within account console v2 keycloak account/ui  * Client Policies : Condition's negative logic configuration is not shown in    Admin Console's form view keycloak  * Placeholders in keycloak.properties do not get substituted at runtime after a    build keycloak  * Keycloak Server throws NPE at startup when the MAP_STORAGE feature is enabled    keycloak storage  * Setting \"24 mins\" to timeout, the admin console displays \"1 day\" keycloak    admin/ui  * Username editable when user is forced to re-authenticate keycloak    authentication  * Quarkus dist \"providers\" dir has outdated README keycloak dist/quarkus  * Newline in localization messages causes uncaught syntax error in account    console v2 keycloak account/ui  * Dist.X argument parsing fails on semicolon keycloak dist/quarkus  * KEYCLOAK-19289 check if values to set is not null keycloak  * LDAP connection timeout is treated as login failure and brute force locking    the user keycloak  * Different method getGroupsCountByNameContaining in MapGroupProvider and    JpaRealmProvider keycloak storage  * MapRoleProvider could return also client roles when searching for realm roles    keycloak storage  * Missing DB constraints for JPA Map Storage for Clients keycloak storage  * Scope bug in device authorization request keycloak  * Handling lazy loading exceptions for storage in new and old storage keycloak    storage  * Model tests consistently time out keycloak storage  * Keycloak.X cannot lookup embedded theme-resources from extension jars    keycloak dist/quarkus  * WebAuthnSigningInTest failures in pipeline keycloak testsuite  * GHA failing due to wrong scheme when downloading ISPN server keycloak  * Fixes for token revocation keycloak oidc  * JPA Map storage doesn't downgrade entityVersion when modifying a row written    with a future entityVersion keycloak storage  * Updated flag disappearing for nested entities in HotRod store keycloak    storage  * Build command exits with success with invalid arguments keycloak dist/quarkus  * Review guides to use the correct format for options keycloak docs  * Mapped Quarkus properties should not be persisted keycloak dist/quarkus  * Unstable model tests when starting multiple Infinispan instances keycloak    storage  * JPA Map storage doesn't increment version column on attribute update keycloak    storage  * Update Portuguese (Brazil) translations keycloak translations  * Do not run re-augmentation if config is the same in dev mode keycloak    dist/quarkus  * Errors from CLI are masked by help keycloak dist/quarkus  * Rename h2-file/h2-mem to dev-file/dev-mem and remove default values for    username/password keycloak dist/quarkus  * Keycloak is not capturing proper Signing details(like browser name and    version) when logged in from different browsers keycloak account/ui  * Not possible to register webauthn key on Firefox keycloak    authentication/webauthn  * JPA Map storage listener should handle optimistic locking for deleting    entities keycloak storage  * Failing to use cache remote-stores due to missing dependencies keycloak    dist/quarkus  * Can not set a jgroups stack other than the defaults from Infinispan keycloak    dist/quarkus  * JPA delegates can throw NoResultException when entity doesn't have any    attributes keycloak storage   UPGRADING  Before you upgrade remember to backup your database and check the for anything that may have changed."
}