{
  "title": "Kogito Tooling 0.8.5 Released!",
  "link": "https://blog.kie.org/2021/03/kogito-tooling-0-8-5-released.html",
  "author": [
    {
      "name": "Eder Ignatowicz",
      "avatar": null
    }
  ],
  "date": "2021-03-19T05:00:00.000Z",
  "feed_title": "KIE",
  "content": "We have just launched a fresh new Kogito Tooling release! On the 0.8.5 , we made many improvements and bug fixes.  We are also happy to announce a new PMML Scorecard Editor and, also, that our editors are now available on Eclipse Theia Upstream (built from ).  This post will give a quick overview of what is included on this release.   PMML SCORECARD EDITOR (ALPHA) HITS VSCODE MARKET PLACE  We are happy to announce that we have a new VS Code extension: . It allows you to create and edit PMML 4.4 (.pmml) Scorecard files.  This new editor is in the alpha stage, and we are looking for feedback from the community. We hope you enjoy it!   ECLIPSE THEIA AND OPEN VSIX STORE  Eclipse Theia is an extensible framework based on VS Code to develop full-fledged multi-language Cloud & Desktop IDE-like products with state-of-the-art web technologies. Recently, Theia’s team merged a , allowing support for CustomEditor API.  In practice, this means that from now on, our BPMN, DMN and editors can run on Eclipse Theia upstream (you can build it from and run), take a look on this demo:    Eclipse Theia uses , and from now on, all our releases will also be available on Open VSX store.   NEW FEATURES, FIXED ISSUES, AND IMPROVEMENTS  We also made some new features, a lot of refactorings and improvements, with highlights to:   NEW FEATURES:  INFRASTRUCTURE   * – Implement a integration tests using Cypress for online channel  * – Migrate VS Code Extension release job to new Jenkins instance  * – Converge the CSS to avoid conflicts between PF3 and PF4  EDITORS   * – Score Cards: Integrate with VS Code channel  * – Enable Bpmn and Dmn PR tests  * – Run standalone tests with Chrome instead of Electron   FIXED ISSUES IN KOGITO:  INFRASTRUCTURE   * – Fix running online editor integration tests in CI  EDITORS   * – Importing and modeling decision models is too slow for productive modeling  * – [DMN Designer] Decision Services – The parameters order in the properties    panel is not correct  * – DMN Editor wrong edge arrow tip connection on reopen  * – [DMN Designer] DMN schema/model validation errors when model has    AUTO-SOURCE or AUTO-TARGET connections  * – Scesim assets are broken in VS Code extension  * – [DMN Designer] DMN takes too long to open models with too many nodes   FURTHER READING/WATCHING  We had some excellent talks recently at the KIE youtube channel:   * Building successful business Java apps: How to deliver more, code less, and    communicate better, by Alex;  * How to embed DMN and BPMN editors in your own application, by Paulo;  * Using VSCode to build and deploy services in a real-world decision scenario:    COVID-19, by Adriel/  I would also like to recommend some recent articles:   * , by Guilherme;  * , by Matteo;  * , by Eder.   THANK YOU TO EVERYONE INVOLVED!  I want to thank everyone involved with this release, from the excellent KIE Tooling Engineers to the lifesavers QEs and the UX people that help us look fabulous!  The post appeared first on ."
}