{
  "title": "Kogito Tooling 0.9.1 Released!",
  "link": "http://feeds.athico.com/~r/droolsatom/~3/MBQsIdkStb4/kogito-tooling-0-9-1-released.html",
  "author": [
    {
      "name": "Eder Ignatowicz",
      "avatar": null
    }
  ],
  "date": "2021-05-07T05:00:00.000Z",
  "feed_title": "KIE Community",
  "content": "We have just launched a fresh new Kogito Tooling release! 🎉 On the 0.9.1 , we made a lot of improvements and bug fixes.  We are also happy to announce the MVP of our DMN Runner and many enhancements on Custom Task support on BPMN.  This post will give a quick overview of this release and add some highlights of our release. I hope you enjoy it!   CUSTOM TASK SUPPORT ENHANCEMENT ON BPMN  We made many improvements regarding custom task support on BPMN, especially related to compatibility with Business Central projects.  Stay tuned that soon we will publish a blog post with a deep dive into these enhancements.   BPMN EDITOR – READ-ONLY MODE  We introduced read-only mode support for our BPMN Editors. This feature is handy when you embed our editors using our .  Simple pass ‘readOnly:true’ in our editor startup to activate this mode (it also works for DMN). You can also see this new mode in action in our :   AUGMENTING THE DEVELOPER EXPERIENCE WITH DMN RUNNER  We’ve been exploring ways to augment the developer experience for the Business Modeler Editors. In the spirit of “release early, release often” and MVPs, we’d like to share an early stage of a running prototype of the DMN Runner so that we can gather more feedback.  You can watch the presentation of this prototype in or try it out in our environment. Soon we will publish a post with more details.   NEW FEATURES, FIXED ISSUES, AND IMPROVEMENTS  We also made some new features, a lot of refactorings and improvements, with highlights to:   * – [BPMN] Reuse Data Types across the process  * – SceSim runner does not display reason for failure  * – [Scesim Editor] Bottom scroll bar getting hide  * – [DMN Designer] Multiple DRDs support – The undo/redo are lost when the user    changes between diagrams  * – Unable to view service tasks in VSCode on windows  * – Standalone editors setContent implementation should receive path and    content  * – [DMN Designer] Error during the save/marshaller of specific diagrams  * – [DMN Designer] Decision Service is missing inputData element in model with    multiple DRDs   FURTHER READING/WATCHING  We had some cool talks recently at the KIE youtube channel:   * Augmenting the developer experience with DMN Runner, by Eder;  * LACE Score Demonstration with DMN, by Rachid;  * A chat about Open Source, leadership, and communities with Mark Proctor  I would like to also recommend the recent article from . He provides a complete step-by-step tutorial to use Test Scenario Editor to test your DMN assets on VS Code and also, this from Guilherme where he details how the new Feel code completion works under the hood.   THANK YOU TO EVERYONE INVOLVED!  I would like to thank everyone involved with this release, from the excellent KIE Tooling Engineers to the lifesavers QEs and the UX people that help us look awesome!  The post appeared first on .  "
}