{
  "title": "Red Hat Summit 2021 (Ask the Experts) - An open approach to solution architectures",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/arMRglaChz8/red-hat-summit-2021-ask-the-experts-an-open-approach-to-solution-architectures.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-06-10T05:00:00.019Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " This year the event is a bit different as we bridge the gap from pandemic reality to hopefully a form of normalcy.   As the Red Hat Summit site explains to us, this \"...event is expanding to become an all-new, flexible conference series, consisting of a 2‑part immersive virtual experience as well as a global tour of small-scale, in-person* events. This series will create collective opportunities to share experiences, innovations, and insights.\"  Part one was from April 27-28, where you started your Red Hat Summit journey by joining us for this no-cost event, where you got the latest news, asked the experts your technology questions, heard from customers around the globe, and explored how open source is innovating the future of the enterprise. All of the sessions are online and available throughout the year on-demand.  Part two is from June 15-16, and you can build on what you learned at April’s event with insights from breakout sessions and technical content geared toward the tracks and topics most relevant to your career. You can also interact live with Red Hat professionals at this no-cost event. More depth at this event with the breakout sessions, ask the experts sessions, and a virtual expo hall.  Finally, you noticed the star marking the part three event above? That's because this part of the event we hope allows us to meet in-person, but the ongoing situation means Red Hat will \"...continue to monitor the ongoing global health crisis and make adjustments to the Red Hat Summit agenda to help ensure the health, safety, and well-being of everyone within the open source community.\"  If all goes well, then you can cap your Red Hat Summit experience somewhere from Oct - Nov \"...by exploring hands-on activities at in-person events that will be held in several cities. The networking opportunities can help you find the inspiration to discover who you want to be and the tools to do what you want to do.\" There will be hands-on labs, 1-1 meetings, and training courses available during this final event series.  This year I'm involved with some friends and colleagues in a few Ask The Experts sessions where you get a live session on a topic with several experts available to ask anything you like about the topic.  I've done in April, and I'm going to be involved in the following session next week:     Solution architectures are the detailed and structured descriptions of the features, process, and behavior of a solution. It acts as the base of the solution to define, deliver, manage and operate the development process of the solution. It identifies the alternatives of the solutions and its components.   In this session, we'll highlight the process that Red Hat uses to compile and publish solution architectures for various business and technology scenarios that are based on actual use cases pertinent to our global customers and partners. It includes the key capabilities of continuous global collaboration with the engineering teams.   Date: Tuesday, Jun 15 Time: 16:30 - 17:00 CEST Speakers:   * Eric D. Schabell, Portfolio Architect Technical Director, Red Hat  * Will Nix, Senior Manager, Red Hat  * E.G Nadhan, Chief Architect and Strategist, Red Hat  Make sure you and plan out your agenda as it's free and full of great open source technologies, customer cases, labs, and more. I hope to see you there and if not, then feel free to drop in at a later date as they will be linking recordings of these sessions back into the agenda for your viewing pleasure.     "
}