{
  "title": "KIE Sandbox: top 7 key new features",
  "link": "https://blog.kie.org/2022/02/kie-sandbox-top-7-key-new-features.html",
  "author": [
    {
      "name": "Eder Ignatowicz",
      "avatar": null
    }
  ],
  "date": "2022-02-03T05:00:00.000Z",
  "feed_title": "KIE Community",
  "content": "In the last months of 2021, the “.NEW environment” (bpmn.new, dmn.new) received a massive update, and now it’s named ! Dealing with complex models and collaborating with others has just become much easier. In this blog post, let’s go for a walkthrough of the top new features of KIE Sandbox.   A FRESH “.NEW” HOME PAGE  We launched a brand new home page. One of the cool additions to our home is the ‘Recent models widget’, allowing quick access to your recent models and also, now can import projects direct from GitHub, a long-waited feature!   MULTI-FILE SUPPORT  KIE Sandbox now supports multiple files! Now you can have a set of numerous DMN and BPMN models and reference those, i.e., include a DMN Model to reuse his datatypes.   TEST YOUR DMN MODELS  Since some releases ago, on every change of your DMN model, we will combine your DMN model and your form input and evaluate it on the DMN Engine. The significant part of this workflow is that it is really fast, looking almost instantaneous. Now on Kie Sandbox, you can test multiple inputs simultaneously with our table view. See in action:   GITHUB INTEGRATION  One of the critical highlights of Kie Sandbox is the integration with GitHub repositories.  You can now import a repository, create a repository from an ephemeral set of files, and push/Pull directly to/from a GitHub repository.   VS CODE INTEGRATION  With a single click on our UI, you can go to VS Code Desktop and vscode.dev and keep working on our Kie Sandbox models there!   TRY ON OPEN SHIFT  Do you want to share your decisions with someone to let them give it a try on your models? Just click on ‘Try on OpenShift’ to deploy your Decisions on Developer Sandbox for OpenShift.   DEPLOY YOUR OWN VERSION ON OPEN SHIFT  Do you want to run KIE Sandbox in your cluster? The Kogito Tooling release 0.16.0 includes three container images to make it easy to deploy the KIE Sandbox to an OpenShift instance. Take a look at this for more details!   HOW TO START TO USE IT?  It’s super simple. Just access   THANK YOU TO EVERYONE INVOLVED!  I would like to thank everyone involved with this release, from the excellent KIE Tooling Engineers to the lifesavers QEs and the UX people that help us look awesome!  The post appeared first on ."
}