{
  "title": "Kogito Tooling 0.12.0 Released!",
  "link": "http://feeds.athico.com/~r/droolsatom/~3/n_QbD0xh5_U/kogito-tooling-0-12-0-released.html",
  "author": [
    {
      "name": "Eder Ignatowicz",
      "avatar": null
    }
  ],
  "date": "2021-08-23T05:00:00.000Z",
  "feed_title": "KIE Community",
  "content": "We have just launched a fresh new Kogito Tooling release! 🎉 On the 0.12.0 , we made a lot of improvements and bug fixes. We are also happy to announce that this release marks the first iteration of our ‘DMN deploy on OpenShift’ feature, and also we have a lot of improvements on our DMN and BPMN Editors.  This post will give a quick overview of this . I hope you enjoy it!   DEPLOY DECISIONS TO DMN DEVELOPER SANDBOX ON DMN.NEW  We just launched in our dmn.new environment a feature that allows you to quickly deploy decision models to the Developer Sandbox for Red Hat OpenShift.  This feature is super cool, and I invite you to give it a try. You can also check more details on this blog .   DMN NODES ARE NOT CREATED ON TOP OF THE SELECTED NODE  DMN diagrams are generally vertical (whereas BPMN is horizontal). When adding a “Decision Node” from a “DMN Input Data,” for better usability, now the nodes are created on top of the selected node.   DMN SUPPORT FOR BEND-POINTS ON CONNECTORS  We also added support for bend-points on the DMN diagram that are pretty useful, especially on Complex DMN diagrams.  See this for more details.   LINE SPLICING FOR BPMN AND DMN EDITORS  Line splicing is a new feature that allows dropping an existing node on top of a connector and automatically split it into two new connectors. This was included in both our DMN and BPMN editors.  Soon we will publish a blog post with a detailed description of this feature.   RESIZE CONTROL POINTS IMPROVEMENTS  We made many improvements on resizing control points for our BPMN and DMN editor, including changing the resize icon and modifying how magnets react on a resize.   SUPPORT FOR PROCESS METADATA ATTRIBUTES  We also added a new AdvancedData that allows users to add generic metadata to all node types and event types in the BPMN editor.   NEW FEATURES, FIXED ISSUES, AND IMPROVEMENTS   * – BPMN Editor – Support for node/events metadata attributes  * – DMN Developer Sandbox for Red Hat OpenShift  * – DMN target position is not stored  * – Stunner – Task Resize option doesn’t show up  * – [DMN Editor] Ctrl-B always converts field to structure and nests  * – VSCode DMN, BPMN editor – creating connection can’t be cancelled easily  * – Stunner – Resize Icon remains displayed  * – BPMN Editor – Cannot import some processes  * – DMN Runner – Wizard step for running  * – BPMN Editor – Marshallers encoding issues  * – [Test Scenario] No effects when assigning a not-expression Simple Type    column to expression type (and viceversa)  * – BPMN Editor – Moving connector’s bendpoints results on erros in the console  * – [Stunner] bend point modification causes diagram inaccessible  * – Stunner – Line splicing  * – Implement E2E automation for Reuse of Data Types in BPMN Designer  * – Verify support for node/event metadata attribues feature  * – Stunner – first POC of new marshallers  * – [DMN Designer] When users create a node by using a shortcut, it’s not    created above  * – Update vscode-extension-tester to 4.1.0  * – [DMN/BPMN] Wired web apps – Fix doc screenshot  * – Implement – designs for orthogonal lines between diagram nodes  * – [Test Scenario] – Errors when executing models using imported inputs and/or    decisions nodes  * – Stunner – Make new nodes editable automatically  * – Stunner – Resize control points – Fixes & UX improvements  * – [DMN Designer] Add support for bend-points on connectors  * – [Stunner] Lienzo – Migration to native interfaces  * – Stunner – Alignment helpers missing during node resize  * – Stunner – WID files with comments and Imports can’t be loaded   FURTHER READING/WATCHING  We had some excellent blog posts on Kie Blog that I recommend you read:   * , by Eder Ignatowicz;  * , by Manaswini Das;  * , by Daniel José dos Santos;  * , by Luiz Motta;  * , by Manaswini Das;  * , by Valentino Pellegrino;  * , by Guilherme Caponetto.  We also presented in some Kie Lives:   * , by Tiago Bento;  * , by Yeser Amer;   THANK YOU TO EVERYONE INVOLVED!  I would like to thank everyone involved with this release, from the excellent KIE Tooling Engineers to the lifesavers QEs and the UX people that help us look awesome!  The post appeared first on .  "
}