{
  "title": "CodeReady Containers - Getting Started with OpenShift Container Platform 4.5 and Process Automation Tooling",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/J1iPmKtJjHg/codeready-containers-ocp-45-with-process-automation-tooling.html",
  "author": [
    {
      "name": "Eric D. Schabell"
    }
  ],
  "date": "2020-10-12T05:00:00.127Z",
  "feed_title": "Eric D. Schabell",
  "content": "  As a cloud-native developer you've development environment on your local machine, but what's next?   What can you do with the fully stocked container registry provided to you?   There is no better way to learn about container technologies, cloud native methods, and container-based application development than getting hands-on with great open technologies.  This article targets getting you started on your new by putting the latest process automation developer tooling at your disposal. You'll get started by installing it using the latest available container registry images. After that, if you need more help getting started, try a free online workshop where you can build your first process automation project hands-on.  Get started today with new , user tasks, forms, rules, and business logic in just a few simple steps.     PROCESS AUTOMATION DEVELOPER TOOLING   Let's install the using the latest provided container catalog image. It delivers fully functioning developer process automation tooling containerized on your OpenShift Container Platform.      INSTALL FROM CONTAINER CATALOG  There are two options to install and run this project on the OpenShift Container Platform; use your own existing installation or to install on CodeReady Containers which provides you with a local OpenShift cluster.  1. Ensure you have an OpenShift container based installation, such as one of     the following:   * your own OpenShift installation, if using this you just need to pass the IP    address to the init.{sh|bat} script.  *    2.   3. Run 'init.sh' or 'init.bat' file. 'init.bat' must be run with Administrative     privileges      # If using CodeReady Containers Easy Install project, just add the cluster     # address to HOST_IP variable found at the top of the init.{sh|bat} files:    #    # HOST_IP=api.crc.testing      #     # Now run the script without any arguments and it uses the hostname:    #    $ ./init.sh   After some installation magic you can watch and read about in the script log output on your console, it's time to login to your process automation tooling.  Get started developing containerized process automation projects here (the address will be generated):  * CodeReady Container example:    http:rhcs-rhpam-install-demo-appdev-in-cloud.apps-crc.testing/business-central    ( u:erics / p:redhatpam1! )  Not sure how to get started with Red Hat Process Automation Manager? Try one of these  to build a first project from scratch.   "
}