{
  "title": "2020 in review - suddenly the world changed",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/lxm3h3C-7Ps/2020-in-review-suddenly-the-world-changed.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2020-12-31T06:00:00.255Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " As 2020 heads off into the mists of history, it's a good time to look back briefly and reflect, as I do every year, on my year.    We've shared more time together this year online in virtual events, virtual coffee breaks, and other strange virtual events that before because the world is not the same.   There were few trips and little travel in 2020 and so I spent a large portion of my time working on content.   I've been generating architecture blueprints, upgrading demos, updating workshops, and spreading as much good cheer as I could from behind my webcam.  It was my +11th year at Red Hat and suddenly it's all changed with the arrival of a worldwide pandemic. I don't want to spend much time on that part of the year, so let's review some of my activities from 2020.   PUBLISHING  Again this year I've been publishing a lot online, maybe even more so now that the events are all virtual  and I needed to float new ideas for your review. This year I've published on this site, many were , and multiple articles featured elsewhere on external sites.   My hobby of writing as continued, but slowed considerably due to the shortened season and my time being used up elsewhere. Time will tell in 2021 if baseball can return to normal for all of us.   It's been amazing to share these insights and experiences that can make others better at what they do. It's the most rewarding part of working in open source, the sharing, mentoring, and collaboration that makes all around you grow.   Here are some of the comments that were raise throughout the year:  > \"Eric never disappoints. His talks are always engaging, informative, usually > numerous and a great investment in time - they always deliver. If I know Eric > is on the speaking agenda at an event, I always make the time to listen.\"    > “Thank you for spreading the word to the world about Red Hat Business > Automation products!”     > \"I had the pleasure to attend your session about storytelling at RHTE in > Vienna last year, which was very exciting - and you did it in a way that I > always remember it when I prepare some presentation. Thank you for that.\"       >  “Everyone can learn from Eric's professionalism, inclusive & positive > attitude & willingness to share.”     > \"Thank you very much, I really appreciate your help as I am a great admirer of > your work.\"     > \"Open source, open thinking, open orgs ...the gifts that keep on giving. > Stumbled across these blueprint gems from Red Hat's Eric D. Schabell for > #cloudnative development - the approach to building and running applications > to fully exploit the advantages of the cloud computing model.\"    > \"I attended your session today, and I have to tell you it was fantastic--the > best 30 minutes of the day. I've been in communications for nearly 25 years, > and I've attended a number of similar talks. Yours is certainly among the > best. It reinforced concepts I've long been aware of (KISS, for example) and > taught me something new (image manipulation). Thanks for your hard work, and > thanks for sharing,\"    > \"I want to say that thank you for the work that you do and how you share these > tutorials and knowledge with the community.\"                 CODING AND OTHER CONTENT  This year saw the complete its fifth year since the first commit on April 1, 2016, but it also moved off of Github and can now be found on Gitlab.   This year it expanded beyond the projects illustrating containers, cloud operations, deployments, AppDev in the Cloud to include portfolio architecture tooling and example repositories. Be sure to jump on over there and watch the updates as container based projects are migrating to OpenShift Container Platform 4.x and beyond.    Almost all of my workshops and demo projects have been updated and are based on installing using OpenShift through the CodeReady Containers offering:  * :     *    * :     *      *      *   These workshops are all constantly undergoing revisions and updates to add new product innovations so be sure to check them out thorough next year.     TRAVEL   This could be the smallest section I've ever written as travel was completely shutdown at the start of 2020, but I did manage to get out a few times before the pandemic ended our face to face encounters.     Just for fun let's look back a minute, as in 2019 the travel was substantial covering over 138,000 km, 22 cities, and 9 countries. In 2020 it was just five trips covering 19,108km, 10 cities, and 6 countries.    Two of those trips were personal vacations, so only three trips were made for work. Of those three work related trips, here's where I visited sharing Red Hat technologies or meet with our partners and customers:   * Vienna, Austria  * Dublin, Ireland  * Boston, MA (USA)  One can only hope we are meeting face to face soon in 2020, but it won't be until later in the year for sure, if that.     TIME FOR OTHER PROJECTS  The positive side of this lack of travel and recover time, I've worked on a lot of physical projects around my home. I'm a type of person that likes to fix stuff that breaks down himself, so I have turned my attentions to maintenance and improvements for my home:  * put in deck flooring for a balcony on my house  * removed and renewed all the grout in the back garden paving  * painted the back shed, including all the trimming  * painted seven interior doors, all their door frames, and six rooms moldings  * painted the wooden open staircase (with 14 steps)  * painted the wooden hand rails for both staircases (four pieces)  * replacing cat5 networking cables with cat6a  * painted two window frames in our attic  As long as the travel is not taking up all my time I'll plan to continue with the maintenance work in 2021.    THANKS TO YOU ALL  I certainly hope you enjoyed what I was able to bring to you in 2020, even in these trying times I hope it was entertaining and educational.    I want to thank you personally for attending any of the webinars, virtual conference sessions, online workshops, and for taking the time to read any of my published articles.   2021 kicks off with travel suspended, but using the mediums we have at our disposal we'll continue to explore the amazing things you can achieve with open technologies.  Finally, stay safe as the world slowly gets back on track, take care of yours, and hope to see you soon face to face!  "
}