{
  "title": "Devoxx UK 2022 - Talking Architecture Shop",
  "link": "http://www.schabell.org/2022/01/devoxx-uk-2022-talking-architecture-shop.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-01-31T06:00:00.002Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "This year with hopes of attending some events in person, I've pushed a few talks to the conference being held from 11-13 of May in London.  This is a rather close location for travel for me so seemed like a good one to put on my Spring list of conferences to target.  The Devoxx series is well know and I've attended and spoken at multiple sessions for the Belgian version in the past. It's very developer centric with a lot of good depth and knowledgable attendees.  My submissions are diverse and across the board as far as technical depth, architectural coverage, and type of sessions.  This first talk is the lead in a series that shares the research based stories of how to create architectures using open source technologies that scale.   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE SUCCESS AT SCALE  You've heard of large scale open source architectures, but have you ever wanted to take a serious look at these real life enterprise implementations that scale? This session takes attendees on a tour of multiple use cases covering enterprise challenges like integration, optimisation, cloud adoption, hybrid cloud management, healthcare, retail, manufacturing, financial services, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own online experiences.  The attendee departs this session with a working knowledge of how to map general open source technologies to their solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Architecture - Conference)  The next two are potential key note story telling experiences I've shared in the past but with a bit of an update. You never know if these are going to land at a conference call for papers, but never shooting is always missing.   DEVELOPERS ARE THE REAL EMERGING TECHNOLOGY  Developers are no longer just coders in the background but are front and center of an organization’s digital transformation efforts. While technology is driving change with open source projects, new tooling, containers and clouds offerings galore, it's still about people and organizational culture. Join us as we discover how developers are the real emerging technology today and the most important assets of all. (People & Culture - Keynote)   OPEN KEY TO YOUR CAREER  It's not coincidence. It's not luck. It's not going to happen by itself, so what's the secret sauce? Understanding what makes a career in open source grow, what choices are crucial, and what actions accelerate or damage your future are sometimes hard to grasp. Learning to position, expand and grow your personal brand in the open source world is what this session provides. Be ready for your next step in open source. Join me for a story sharing a clear and easy to use plan for jump starting your open source career immediately. (People & Culture - Keynote)  Finally, this one is a workshop to get hands on with designing your best diagrams using our free online tooling. The only requirement is a browser!   DESIGNING YOUR BEST ARCHITECTURAL DIAGRAMS  Diagraming is one of the most important communication tools for sharing your project and architectural ideas to your colleagues and teams. In this workshop walkthrough, attendees are exposed to an open source tool we host online for designing architecture diagrams like an expert. Attendees are walked through the following in just 30 mins:   * open and explore the tooling in your favourite web browser  * explore the provided asset libraries for drag-and-drop designing  * learn about the three types of diagrams that make up a good design  * create your first simple logical diagram  * create your first simple schematic diagram  * create a detailed diagram  * how to export and import diagrams and elements from a diagram  This session is an introduction to the free online workshop available for attendees to jump right into after the session. Each of the individual labs in this workshop are stand alone, allowing the attendee to focus on anything of interest without having to work through the previous labs. If you're looking to become more proficient in sharing your ideas, architectures, and projects visually to wider audiences you can't underestimate the value of a good diagram. Join us to learn the tips and tricks that make a good diagram such a good communication vehicle and how our tooling eases your design tasks. Then head homewards with a free online workshop just waiting for you to explore! (Architecture - Tools-in-Action)  Fingers crossed that the world opens up for us and that a few of these are selected so we can talk some architecture together!  "
}