{
  "title": "DMN editor – Contributors Guide – Part 1",
  "link": "http://feeds.athico.com/~r/droolsatom/~3/NXt-Nq_EFGI/dmn-editor-contributors-guide-part-1.html",
  "author": [
    {
      "name": "Guilherme Carreiro",
      "avatar": null
    }
  ],
  "date": "2021-06-15T14:27:40.000Z",
  "feed_title": "KIE Community",
  "content": "If you’re reading this, probably you’ve already thought about contributing to an open-source project. However, projects generally have some learning curve, which may intimidate valuable contributors.  We do not want that feeling for the DMN editor!  So, this is the first of a series of posts that will quickly empower you to contribute to the DMN editor and other Kogito components. You will be able to solve any annoying (but simple-to-solve) bug that you want! Or even propose a more significant change on some web component.  Are you excited too? So, this guide is for you! 😃  The idea is not to overwhelm this experience, so let’s take baby steps and understand one thing at a time.  Today, we will take a look at the editor’s overall anatomy and where each component lives and, with that simple introduction, you will be able to make your first contribution! But, first, let’s take a look at the 3 kinds of modules that compose the DMN editor.   I. THE TYPESCRIPT MODULES  As you’re probably wondering, TypeScript (TS) components are based on React. Check the elements highlighted in the image below, they are all TS/React:    Almost every TS module in the DMN editor lives here: . As they have pretty expressive names, it’s easy to find, for example, where the Guided Tour code lives 😉  > Notice: those modules may be moved, so this link may be updated in the future.   II. THE JAVA MODULES  Java modules currently rely on Google Web Toolkit (GWT) to translate Java components into JavaScript code. If you wondering about contributing into this modules, keep in mind when have two main parts here:     * The DMN components, highlighted as red – which are specific to the DMN editor  * The Stunner components, highlighted as green – which comprehends components    handled by Stunner, which is multi-purpose modeling tool that powers the and    the  There’s other interesting sub-modules into these two sections, but the idea is to not dig too deep right now, and you will realize better on future posts how these components deeply work.  However, if you’re brave enough for an early contribution, you may check DMN component and Stunner components .   III. THE MODELS IN TRANSITION  Some modules are being moved from the Java/GWT world to the new stack based on TS/React. Currently, only boxed expression editor is being moved:    The new component, right now, leaves on , feel free to take a look or submit a PR   ALL THAT’S ALL FOR NOW!  But, maybe you’re wondering… How does this post help me?  Well… now that you know where each component lives, you’re already empowered to fix issues like this one: : [Guided Tour] Dialog must show scrollbars on small screens. You just needed to know the right place for the CSS height property.  As I mentioned. This post is the first one of a series. Here we covered languages, and the overall editor anatomy, but only minimum stuff, so you can easily understand where you can open your first PR.  In the following posts, we will go beyond and check each kind of module with more details.  Stay tunned!  The post appeared first on .  "
}