{
  "title": "Kogito Tooling 0.11.0 Released!",
  "link": "http://feeds.athico.com/~r/droolsatom/~3/FE87raV3XMI/kogito-tooling-0-11-0-released.html",
  "author": [
    {
      "name": "Eder Ignatowicz",
      "avatar": null
    }
  ],
  "date": "2021-07-09T05:00:00.000Z",
  "feed_title": "KIE Community",
  "content": "We have just launched a fresh new Kogito Tooling release! 🎉 On the 0.11.0 , we made a lot of improvements and bug fixes. We are also happy to announce that this release marks the first release of our DMN Runner on !  This post will give a quick overview of this . I hope you enjoy it!   INSTANTANEOUS FEEDBACK LOOP FOR DMN AUTHORING WITH DMN RUNNER  We’ve been exploring ways to augment the developer experience for our editors on the KIE Tooling team. Today, I’m proud to announce the release of our DMN Runner on dmn.new. We hope it will transform your DMN Authoring experience. Let’s see it in action:  For this reason, we decided to start a new development stream for our BPMN, DMN, and Scenario Simulator editors called , freeing the way for Editors to continue evolving on both streams separately (Kogito and BC) without carrying the weight of the other.  Soon we will write a blog post describing this new awesome feature.   NEW FEATURES, FIXED ISSUES, AND IMPROVEMENTS  We also made some new features, a lot of refactorings and improvements, with highlights to:   * – Online Editor DMN Runner (First Iteration)  * – The nodes should be created on top of the selected node in DMN editor  * – BPMN Editor – Improve SVG generated ids  * – [DMN Designer] Read-only mode – Connectors appear differently on read-only    mode  * – Implement integration tests for Save operation in BPMN editor in VSCode  * – [SceSim Designer] HiDPI is not working as expected  * – [DMN/BPMN] Sync kogito-editors-java with latest translations  * – Kogito Tooling VS Code extensions Workspaces Trust  * – Prevent different envelopes in the same window to interact with each other  * – New elements should always be connected by their central magnetic point  * – Stunner – Palette fixes & improvements  * – Guided tour for invalid DMN models  * – It’s not possible to save arrow edits  * – SceSim Editor does not work in Eclipse Theia  * – [BC included] [DMN/BPMN editor] Sometimes clicking outside doesn’t unselect    nodes  * – Stunner – Texts overlap toolboxes  * – [BC Included] DMN editor removing edges for duplicate Decision Nodes on    canvas  * – Inconsistent results of integration tests across CI  * – Stunner – Unknown Custom tasks in Designer makes Diagram Explorer empty  * – Clear selection button doesn’t work on Testing Tools when use click    property first time.  * – Stunner – Editing text using Inline editor is shown over Properties panel    or Expanded Palette  * – Stunner – The order of Custom tasks in the palette is different with every    process opening   FURTHER READING/WATCHING  We had some excellent blog posts on Kie Blog that I recommend you read:   * , by Kirill Gaevskii;  * , by Guilherme Carreiro;  * , by Valentino Pellegrino;  We also presented in some Kie Lives:   * , by William Siqueira;  * , by Guilherme Carreiro;  * , by Guilherme Caponetto.   THANK YOU TO EVERYONE INVOLVED!  I would like to thank everyone involved with this release, from the excellent KIE Tooling Engineers to the lifesavers QEs and the UX people that help us look awesome!  [kie]  The post appeared first on .  "
}