{
  "title": "Point of sale - An architectural introduction",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/E9rgT9xWToA/point-of-sale-an-architectural-introduction.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-03-22T06:00:00.005Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " This article kicks off the first in the series sharing another new architecture blueprint. It's focusing on presenting access to ways of mapping successful implementations for specific use cases.      It's an interesting challenge creating architectural content based on common customer adoption patterns. That's very different from most of the traditional marketing activities usually associated with generating content for the sole purpose of positioning products for solutions. When you're basing the content on actual execution in solution delivery, you're cutting out the chuff.   What's that mean?  It means that it's going to provide you with a way to implement a solution using open source technologies by focusing on the integrations, structures and interactions that actually have been proven to work. What's not included are any vendor promises that you'll find in normal marketing content. Those promised that when it gets down to implementation crunch time, might not fully deliver on their promises.  Enter the term Architectural Blueprint.   Let's look at these blueprints, how their created and what value they provide for your solution designs.     THE PROCESS  The first step is to decide the use case to start with, which in my case had to be linked to a higher level theme that becomes the leading focus. This higher level theme is not quite boiling the ocean, but it's so broad that it's going to require some division in to smaller parts.  In this case we've aligned with the higher level theme being 'Retail' use cases, a vertical focus. This breaks down into the following use cases and in no particular order:  *   *   *   *   * Store health and safety  * Real-time stock control  * Retail data framework  The case we're tackling here is focused on point of sale images. This use case we've defined as the following:    Simplifying and modernizing central management of distributed point-of-sale devices with built in support for container based applications.   The approach taken is to research our existing customers that have implemented solutions in this space, collect their public facing content, research the internal implementation documentation collections from their successful engagements, and where necessary reach out to the field resources involved.    To get an idea of what these blueprints look like, we refer you to the series previously discussed here:  *   *   *   *   Now on to the task at hand.      WHAT'S NEXT  The resulting content for this project targets the following three items.   * A slide deck of the architectural blueprint for use telling the portfolio    solution story.  * Generic architectural diagrams providing the general details for the    portfolio solution.  * A write-up of the portfolio solution in a series that can be used for a    customer solution brief.  An overview of this series on point of sale portfolio architecture blueprint:   1.   2.   3.   Catch up on any past articles you missed by following any published links above.  Next in this series, taking a look at the  for the point of sale architecture.   (Article co-authored by , Chief Architect Retail, Red Hat)  "
}