{
  "title": "Quarkus 3.16 - OpenTelemetry Logging, LGTM Quarkus dashboard and too many things to list here",
  "link": "https://quarkus.io/blog/quarkus-3-16-1-released/",
  "author": [
    {
      "name": "Guillaume Smet",
      "avatar": null
    }
  ],
  "date": "2024-10-30T00:00:00.000Z",
  "feed_title": "Quarkus",
  "content": "After the 3.15 LTS release comes Quarkus 3.16 and a lot of new features and enhancements.  Quarkus 3.16 is the result of the 2 month worth of work so it’s more packed than your usual Quarkus minor.  We went directly to 3.16.1 due to the inclusion of a last minute fix.  Notable changes are:   * - Drop the compatibility layer for the Big Reactive Rename   * - OpenTelemetry Logging support   * - LGTM Quarkus dashboard   * - Generate serialization-free Jackson deserializers   * - Quarkus REST - Support record parameter containers   * - Introduce per invocation override of REST Client’s base URL   * - Add quarkus-oidc-client-registration extension   * - Add new AuthorizationPolicy annotation to bind named HttpSecurityPolicy to    a Jakarta REST endpoints   * - Add OIDC Client SPI   * - Support @PermissionsAllowed defined on meta-annotation   * - Introduce OidcResponseFilter   * - Support for two or more authentications for a single request   * - Support Keycloak Dev Service when OIDC client is used without OIDC    extension   * - Integrate GraphQL clients with the TLS registry extension   * - Integrate Keycloak Admin Client with TLS registry   * - Auto log for Dev Services in containers   * - Add HTTP Access Log to Dev UI   * - Allow multiple format and themes in the Config Doc generator  Note that we haven’t forgotten 3.15 LTS, a 3.15.2 LTS is in the works and will be released in November. We are carefully selecting the fixes we will backport to it.   UPDATE  To update to Quarkus 3.16, we recommend updating to the latest version of the Quarkus CLI and run:  quarkus update  Note that quarkus update can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.16.  For more information about the adjustments you need to make to your applications, please refer to the .   WHAT’S NEW?   BIG REACTIVE RENAME COMPATIBILITY LAYER DROPPED  Remember the Big Reactive Rename? It happened in 3.9 with the ultimate goal of avoiding the confusion between extensions that have a reactive core and are supporting equally well reactive and non-reactive workloads and extensions that are purely designed as reactive.  A lot of extensions were renamed and we put in place relocations both for the artifacts and for the configuration.  Compatibility layers have a cost and we decided to drop this one in 3.16, after the 3.15 LTS release.  If you encounter issues with this change, please refer to the .  If you are using quarkus update to update to each new version, the changes were handled for you already.   OPENTELEMETRY LOGGING  Quarkus 3.16 supports distributed logging via OpenTelemetry Logging. This is the natural continuation of the OpenTelemetry work in Quarkus.  This support is part of the already existing OpenTelemetry extension and can be easily enabled via configuration properties.  To learn more about it, have a look at the   LGTM DASHBOARD  When using the LGTM Dev Services, an out of the box Quarkus dashboard will now be provided.   QUARKUS REST  In Quarkus REST, you can use custom classes as parameters of your REST methods but records were not supported. It is now the case in Quarkus 3.16.  When using the REST Client, providing a URL is mandatory and you usually configure it globally. However, from time to time, you might want to configure it per-invocation. The @Url annotation was introduced for that: annotate a parameter of your REST Client method with it and you can dynamically provide a URL.   JACKSON  You might remember that in Quarkus 3.14, we introduced .  And you might have wondered \"where are my faster reflection-free deserializers\"?  They just landed in 3.16!   SECURITY  As usual, this version comes with several new features and enhancements related to our security layer:   * - Add quarkus-oidc-client-registration extension - see here   * - Add new AuthorizationPolicy annotation to bind named HttpSecurityPolicy to    a Jakarta REST endpoints - see here   * - Add OIDC Client SPI - see here   * - Support @PermissionsAllowed defined on meta-annotation - see here   * - Introduce OidcResponseFilter - see here   * - Support for two or more authentications for a single request - described   * - Support Keycloak Dev Service when OIDC client is used without OIDC    extension   TLS REGISTRY EVERYWHERE  The TLS registry was introduced in Quarkus a while ago and we are iterating in each version to migrate more extensions to it.  In Quarkus 3.16, two new extensions have been adapted to rely on the centralized TLS registry:   * SmallRye GraphQL Client   * Keycloak Admin Client   DEV UI  The Dev UI is continuously enhanced but we wanted to highlight a very nice addition: logs from your Dev Services containers and HTTP access logs are now available in the Dev UI.   CONFIGURATION DOCUMENTATION  When developing extensions, it can be handy to publish your configuration documentation.  Until now, it was only possible to publish it in Asciidoc. With 3.16, you can also generate Asciidoc by passing <format>markdown</format> to the configuration of the Config Doc Maven Plugin.   PLATFORM COMPONENT UPGRADES  CAMEL QUARKUS  Camel Quarkus has been updated to 3.16.0.  QUARKUS CXF  Quarkus CXF 3.16 was released and is now available in . Check the release notes for more information about what is new in this release.   FULL CHANGELOG  You can get the full changelog of , , and on GitHub.   CONTRIBUTORS  The Quarkus community is growing and has now . Many many thanks to each and everyone of them.  In particular for the 3.16 release, thanks to AB, Adriano Moreira, Akulov S V, Ales Justin, Alex Martel, Alexandros Antonakakis, Alexey Loubyansky, Andreas Stangl, Andy Damevin, Auri Munoz, AxiomaticFixedChimpanzee, Bassel Rachid, Bruno Baptista, Chris Cranford, Chris Laprun, Christian Navolskyi, Claudio Miranda, Clement Escoffier, Dale Peakall, Daniel Bobbert, Daniel Cunha, Daniel Ezihe, Dannier Leonides Galicia Chinchilla, David M. Lloyd, Davide D’Alto, Dimitris Polissiou, Domenico Briganti, Falko Modler, Foivos Zakkak, Francesco Nigro, Galder Zamarreño, George Gastaldi, Georgios Andrianakis, Guillaume Smet, Gunnar Morling, Gunther C. Wenda, Holly Cummins, Inaki Villar, Ioannis Canellos, Jakub Gardo, Jakub Jedlicka, Jan Martiska, jcarranzan, Jeremy Whiting, Jerome Prinet, Jonathan Kolberg, Jorge Solórzano, Julien Ponge, Jérémie Bresson, Jérémie Panzer, Katia Aresti, KERN Christian, Konrad Durnoga, KS, Ladislav Thon, Lars, Laurent Perez, Loic Hermann, Lorenzo De Francesco, Loïc Hermann, Loïc Mathieu, luneo7, Marc Nuri, Marcel Stör, Marcelo Ataxexe Guimarães, Marek Skacelik, mariofusco, marko-bekhta, Martin Bartoš, Martin Kouba, Matej Novotny, Matheus Cruz, Matthias Schorsch, mauroantonio.depalma, Max Rydahl Andersen, Maximilian Rehberger, Melloware, Michael Edgar, Michal Maléř, Michal Vavřík, Nathan Erwin, Nicholas Kolatsis, Ozan Gunalp, Ozzy Osborne, Paul6552, Paulo Casaes, Peer Bech Hansen, Peter Palaga, peubouzon, PhilKes, Phillip Krüger, polarctos, Ralf Ueberfuhr, rghara, Robert Stupp, Roberto Cortez, RobinDM, Rod Cheater, Rolfe Dlugy-Hegwer, Roman Lovakov, Rostislav Svoboda, Sanne Grinovero, Sebastian Schuster, Sergey Beryozkin, Seto, sku20, Stéphane Épardaud, Thomas Canava, Thomas Segismont, Tiago Bento, tmulle, Vincent Sevel, xstefank, yamada-y0, Yasser Greyeb, Yoann Rodière, Yurii Dubinka, and Žan Ožbot.   COME JOIN US  We value your feedback a lot so please report bugs, ask for improvements… Let’s build something great together!  If you are a Quarkus user or just curious, don’t be shy and join our welcoming community:   * provide feedback on ;   * craft some code and ;   * discuss with us on and on the ;   * ask your questions on ."
}