{
  "title": "Quarkus 3.10 - Hibernate Search standalone POJO mapper, Flyway 10, security enhancements",
  "link": "https://quarkus.io/blog/quarkus-3-10-0-released/",
  "author": [
    {
      "name": "Guillaume Smet",
      "avatar": null
    }
  ],
  "date": "2024-04-30T00:00:00.000Z",
  "feed_title": "Quarkus",
  "content": "After some big changes in Quarkus 3.9, we have the pleasure to announce Quarkus 3.10.  Quarkus 3.10 is for developers who want the latest features, if you are looking for an extended support cycle, you are encouraged to stay on 3.8 LTS.  Here are the main changes for 3.10:   * - Extension for the Hibernate Search Standalone POJO Mapper with    Elasticsearch   * - Update Flyway to 10.10.0   * - Move package config to an interface   * - Allow authentication mechanism selection for a REST endpoint with    annotation   * - Optional support for the OIDC session cookie dir encryption   * - Support for verifying OIDC JWT claims with custom Jose4j Validator   * - Support resolving of static OIDC tenants based on token issuers   * - Add OIDC TokenCertificateValidator   UPDATE  To update to Quarkus 3.10, we recommend updating to the latest version of the Quarkus CLI and run:  quarkus update  Note that quarkus update can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.10.  For more information about the adjustments you need to make to your applications, please refer to the .  If you are not already using 3.x, please refer to the for all the details. You can also refer to for additional details. Once you upgraded to 3.0, also have a look at the , , , , , and , , , , and migration guides.   WHAT’S NEW?   HIBERNATE SEARCH STANDALONE POJO MAPPER  Hibernate Search has been part of the Quarkus ecosystem for a long time but until now we only supported the Hibernate ORM integration.  Quarkus 3.10 adds a brand new extension to add support for the Hibernate Search standalone POJO Mapper, which allows to index directly arbitrary POJOs.  If you want to index structured data coming from files, MongoDB entities, … this new extension should make you happy.  Interested in this extension? We have a for you, which covers the Quarkus integration and the basics.  For more advanced information about the Hibernate Search standalone POJO mapper, please consult the and the guide.   FLYWAY 10  We are a bit late to the party as we encountered some incompatibility with native executables and the new Flyway 10 but Quarkus 3.10 comes with an upgrade to Flyway 10, more precisely 10.10.  If you are not using quarkus update, have a look at the as they split some more database supports out of Flyway core.   CHANGES TO QUARKUS.PACKAGE.* CONFIG  The quarkus.package.* config was refactored.  The configuration changes are handled by quarkus update but if you are upgrading manually, have a closer look at the dedicated section of the .  Note that when using the previous configuration properties are deprecated but should still work so you don’t have to upgrade right away. They will be dropped in a (relatively distant) future version.   SECURITY ENHANCEMENTS  This new version comes with several improvements related to security:   * - Allow authentication mechanism selection for a REST endpoint with    annotation   * - Optional support for the OIDC session cookie dir encryption   * - Support for verifying OIDC JWT claims with custom Jose4j Validator   * - Support resolving of static OIDC tenants based on token issuers   * - Add OIDC TokenCertificateValidator   QUARKUS CXF  Quarkus CXF 3.10.0 was released and is now available in . Check for more information about what is new in this release.   FULL CHANGELOG  You can get the full changelog of and on GitHub.   CONTRIBUTORS  The Quarkus community is growing and has now . Many many thanks to each and everyone of them.  In particular for the 3.10 release, thanks to Ales Justin, Alexander Schwartz, Alexey Loubyansky, Andy Damevin, Antonio Musarra, asjervanasten, avivmu, Bas Passon, Bruno Baptista, Clement Escoffier, Damiano Renfer, David M. Lloyd, ennishol, Eric Deandrea, Erin Schnabel, fdlane, Foivos Zakkak, Fouad Almalki, Francesco Nigro, Galder Zamarreño, George Gastaldi, Georgios Andrianakis, Guillaume Smet, Gwenneg Lepage, Holly Cummins, Ioannis Canellos, Jakub Jedlicka, James Netherton, Jan Martiska, Jason T. Greene, Jean Bisutti, Jerome Prinet, Jonas Jensen, Juan Jose Garcia, Julien Ponge, Jérémie Bresson, Katia Aresti, Klaus Nguetsa, Ladislav Thon, Laurent Broudoux, luneo7, Marc Nuri, Marco Sappé Griot, Marco Schaub, Marek Skacelik, marko-bekhta, Martin Kouba, Matej Novotny, Max Rydahl Andersen, Michal Maléř, Michal Vavřík, Michiel Thomassen, Monhemius, B. (Bart), Ozan Gunalp, Peter Palaga, Phillip Krüger, Pierre Adam, Robbie Gemmell, Roberto Cortez, Sanne Grinovero, Sebastian Davids, Sergey Beryozkin, Stéphane Épardaud, Thomas Canava, Thomas Segismont, Vinicius A. Santos, xstefank, Yoann Rodière, Yoshikazu Nojima, Yukihiro Okada, and Žan Horvat.   COME JOIN US  We value your feedback a lot so please report bugs, ask for improvements… Let’s build something great together!  If you are a Quarkus user or just curious, don’t be shy and join our welcoming community:   * provide feedback on ;   * craft some code and ;   * discuss with us on and on the ;   * ask your questions on ."
}