{
  "title": "CodeReady Containers - Installing business automation operator (Part 1)",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/JsbHFWqV5c4/codeready-containers-installing-business-automation-operator-part1.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2020-12-02T06:00:00.285Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " As a consistent user and developer on the OpenShift platform over the years, I've tried helping users by sharing my application development content as we've journeyed from cartridges all the way to container base development.    With container based development we've also transitioned from using templates to define how to deploy our tooling and applications, to operators. There are many examples of how to work with the templated versions of our applications around decision management and process automation found on and .  Over the releases of OpenShift 4.x we've seen that operators have become the preferred method of packaging, deploying and managing a Kubernetes-native, thus OpenShift, application. With this in mind it felt like time to explore and update existing demos and example projects to employ the provided operators for installation and runtime.  In this series of articles I'll be providing a walk through what it is to use the latest tooling provided by the business automation operator on the OpenShift Container Platform. We'll install the operator by hand, start instances of the decision management and process automation tooling using the OpenShift console, explore command line automation of installing, starting, and configuring the same tooling from the command line, and share a fully automated process automation tooling installation with pre-installed example project.  Let's get started installing our business automation operator.   INSTALL THE CONTAINER PLATFORM  The first thing needed is for you to have access to an OpenShift Container Platform. While not everyone has one of these at their disposal, you can easily spin one up on any machine that hosts enough internal memory (RAM). This series is based on the use of this local OpenShift cluster based on CodeReady Containers, all presented in the  project.   We'll leave it as an exercise for the reader to install OpenShift using this project and assume for the rest of this article you have it running.   INSTALLING THE OPERATOR  After logging in to the OpenShift console you should be in the Administrator view. Open the left menu entry Operators -> OperatorHub, then using the search window type in 'business automation' to locate our preferred operator:     If you select the Business Automation operator it opens the description where you can click on the install button:     The next screen is for the operator installation and you can leave all the defaults filled in, except for having to choose a namespace to install it in. In this case we chose the default namespace and click on the install button:     You see that this will provide an API called KieApp, which will allow us to either install decision management or process automation tooling products. You will watch a pop-up for a bit as the installation progresses:     If you click on the link 'View Installed Operators in namespace default' it takes you to the view of the specific installed operators for the selected namespace:     After the installation and update phases of the operator you'll see that it's successfully installed. If you click on KieApp on the far right under Provided API's you'll be presented with the details of the operator and viewing the tab KieApp where you find a button on the right labelled Create KieApp:     This button is where you can select to install one of the offered tooling applications under the provided listing of Environments. Now it's time to install one of the authoring environments using the administration console, but as operators provide an API we'll revisit this later and demonstrate how to automate these installation steps.     WHAT'S NEXT?  Up to this point you've installed the container platform (hopefully being able to use the  project) and walked through how to find, install, and reach the point of installing an offered tooling environment.    In the next article you'll use this same console to install the operator provided decision management authoring environment, log in to the Decision Central console, and view the KieServer API documentation.     "
}