{
  "title": "DevConf.US 2021 - Containers, OpenShift, architecture blueprints, and diagram tooling",
  "link": "http://feedproxy.google.com/~r/schabell/jboss/~3/85iCFvAjG18/devconf-us-containers-openshift-architecture-blueprints-diagram-tooling.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2021-05-13T05:00:00.001Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "  DevConf.US 2021 has kicked off their call for papers this last month and of course it will be a virtual event (hopefully for this one last time) hosted on September 2-3. It's the 4th annual, free, Red Hat sponsored technology conference for community project and professional contributors to Free and Open Source technologies coming to a web browser near you!    There is no admission or ticket charge for DevConf.US events. However, you are required to complete a free registration. Talks, presentations and workshops will all be in English.  I've put together the following collection of talks as my submissions and happy to preview them here with you.     Installing OpenShift as Dev Locally in Minutes!     Are you an AppDev that's truly tired of messing with Kubernetes and all those YAML files? Do you have a project in a Git repository and just want to use a container platform for deploying, testing, and running your applications while in the development phase locally on your own machine? Have we got the session for you! Join us for this power session showing you live how easy it is to install the OpenShift Container Platform (latest 4.x version) on your local developer machine in just minutes. Attendees will experience the installation and quick tour of OpenShift Container Platform from the AppDev point of view. Furthermore, they can take it all home as it's hosted in a project online with links and tips for projects that help them to learn how to leverage existing images and products from the provided image registry or Operator Hub catalogs. It's so easy, next year the attendees can return to this conference and share their latest AppDev projects running on their local machines too!  (25 min)       Designing your best architecture diagrams      Diagraming is one of the most important communication tools for sharing your project and architectural ideas to your colleagues and teams. In this workshop attendees are walking step-by-step through using an open source tool we host online for designing architecture diagrams like an expert. Attendees work through the following:        * open and explore the tooling in your favourite web browser  * explore the provided asset libraries for drag-and-drop designing  * learn about the three types of diagrams that make up a good design  * create your first simple logical diagram  * create your first simple schematic diagram  * create a detailed diagram  * how to export diagrams and elements from a diagram  * design tips and tricks    Each of the individual labs in this workshop are stand alone, allowing the attendee to focus on anything of interest without having to work through the previous labs. If you're looking to become more proficient in sharing your ideas, architectures, and projects visually to wider audiences you can't underestimate the value of a good diagram. Join us to learn the tips and tricks that make a good diagram such a good communication vehicle and how our tooling eases your design tasks. (workshop)   The workshop is fully implemented and tested with designers and architects around the world and fine tuned to the beginning designer. Workshop is for your previewing pleasure.     Real life Retail Architectures in Action     We've all had the retail shopping experience, either online or in a physical shop, but have you ever wanted to take a serious look at how they deliver that experience in a cost effective manner at scale? This session takes attendees on a tour of three architecture blueprints covering three of the most interesting solutions retail organisations have to implement successfully to survive. Not only are these architecture solutions interesting, but they are based on successful real life implementations featuring open source technologies and power a lot of your world wide shopping experiences. The following three use cases will be discussed and detailed in architectural diagrams showcasing how open technologies are integrated to solve them:       * Supply chain integration      * Real-time stock control  * Retail data framework    The attendee shall depart this session with a working knowledge of how to map general open source technologies to their solutions with examples all based on real life use cases. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution spaces as they can be pre-loaded into our architecture diagram tooling for modification.  Furthermore, content is available online (for example: https://dzone.com/articles/supply-chain-integration-an-architectural-introduc) for each of these use cases providing attendees with reference material post conference. (25 min)  I'll keep you posted if these are accepted and share the planning as we move towards this event in the September.  "
}