{
  "title": "Keycloak 19.0.2 released",
  "link": "https://www.keycloak.org/2022/09/keycloak-1902-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2022-09-14T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   MIGRATION FROM 18.0  Before you upgrade remember to backup your database. If you are not on the previous release refer to for a complete list of migration changes.   OPENID CONNECT LOGOUT PROMPT  At Keycloak 18.0.0, the logout is now compatible with the new OIDC specification, which changed the handling for the url parameters. However, to also remain compatible with earlier versions, a compatibility flag is introduced. See the for further information for the backwards compatibility option, which allows your application to still use the old format for the url parameters.  While the url parameters can now be configured to be compatible, there was still one incompatibility with keycloak 17 and earlier releases. If the user does not provide an valid idTokenHint, a logout prompt appears instead of a successful logout redirect. Therefore, a new compatibility flag suppress-logout-confirmation-screen is introduced to suppress the logout screen.  You can enable this parameter when you start the server by entering the following command:  bin/kc.[sh|bat] --spi-login-protocol-openid-connect-suppress-logout-confirmation-screen=true start  With this configuration, you can still use the logout endpoint without a user prompt.  Warning The backwards compatibility switch will be removed in some future version - probably Keycloak 23. You are encouraged to update your clients as soon as possible as described above rather than rely on this switch.   DEPLOYING SCRIPTS THROUGH SAML JAVASCRIPT PROTOCOL MAPPER  Until now, administrators, which used SAML javascript protocol mapper on their SAML clients or client scopes, were allowed to upload scripts to the server through the Keycloak Administration Console as well as through the RESTful Admin API.  For now on, this capability is disabled and users should deploy scripts directly to the server. This behaviour is aligned with other script based providers. For more details, please take a look at .   ALL RESOLVED ISSUES   ENHANCEMENTS   * Document compatibility mode for oidc logout endpoint suppression    keycloak-documentation  * Allow setting a URL to configure frontend and admin URLs keycloak    dist/quarkus  * Make compatibility mode for oidc logout endpoint fully compatible to previous    keyloak versions keycloak oidc  * Add basic auth compliant RFC 6749 keycloak   BUGS   * SAML javascript protocol mapper: disable uploading scripts through admin    console by default keycloak-documentation  * Release failed due to missing javadoc and sources jar keycloak-ui  * PolicyEnforcer sometimes looses provided adapterconfig while executing    resource matching keycloak authorization-services  * Do not empty attributes if they are not provided when user profile is enabled    keycloak user-profile  * [Quarkus | CLI | Windows] `-` abbreviations not recognized for start, build    and start-dev keycloak dist/quarkus  * ConcurrentModificationException in script cache of JSPolicyProviderFactory    keycloak authorization-services  * Unable to configure URL scheme for admin console keycloak  * Clear expired events errors keycloak storage  * Failed to process template in Authentication SPI in v19.0.0 keycloak  * Align kc.bat with latest changes to kc.sh keycloak  * Health checks fail when using relative paths in 19.0.0-1 keycloak  * Old admin console does not find keycloak.js when url is not set with a    tailing / keycloak  * Can't set storage-deployment-state-version-seed for map storage via    environment variable keycloak storage  * `--optimized` is not supported by `kc.sh export` keycloak dist/quarkus  * Requests to health endpoint still dispatched to worker threads when    `http-relative-path` is set keycloak  * post_logout_redirect_uri causes \"invalid redirect_uri\" for clients created in    keycloak 19 with old admin console keycloak oidc  * Old administration console not loading keycloak admin/ui  * SAML javascript protocol mapper: disable uploading scripts through admin    console by default keycloak saml  * Credential validation not taking into account if the user is already cached    keycloak storage   UPGRADING  Before you upgrade remember to backup your database and check the for anything that may have changed."
}