{
  "title": "Quarkus 3.11 - Dev Services for Observability, progress on WebSockets.next, Infinispan Cache extension and more",
  "link": "https://quarkus.io/blog/quarkus-3-11-0-released/",
  "author": [
    {
      "name": "Guillaume Smet",
      "avatar": null
    }
  ],
  "date": "2024-05-29T00:00:00.000Z",
  "feed_title": "Quarkus",
  "content": "It is the end of the month, a lot of us are in Slovenia for JCon (if you are there, come talk to us!) and it is time for a Quarkus release: here comes Quarkus 3.11!  Here are the main changes for this release:   * - Observability extensions - Dev Services, Dev Resources, LGTM   * - Infinispan Cache Extension   * - WebSockets Next: client endpoints   * - WebSockets Next: initial version of security integration   * - Allow quarkus:run to launch Dev Services   * - Support for OIDC session expired page   * - Introduce OidcRedirectFilter   UPDATE  To update to Quarkus 3.11, we recommend updating to the latest version of the Quarkus CLI and run:  quarkus update  Note that quarkus update can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.11.  For more information about the adjustments you need to make to your applications, please refer to the .  If you are not already using 3.x, please refer to the for all the details. You can also refer to for additional details. Once you upgraded to 3.0, also have a look at the , , , , , and , , , , , and migration guides.   WHAT’S NEW?   DEV EXTENSIONS FOR OBSERVABILITY  A lot of efforts have been put into simplifying the setup of dev resources for observability.  This includes Dev Services for:   * Grafana   * Jaeger   * OTel   * VictoriaMetrics DB   * VictoriaMetrics Agent / scraper  Actually, they can be used in 3 different contexts:   * Re-usable Dev Services (default)   * Simple start/stop Dev Services   * Single / plain per QuarkusTestResource dev resource  You can find more information about this new feature in this .   INFINISPAN CACHE EXTENSION  Quarkus has had a cache extension for a long time. This cache extension is backed by Caffeine by default.  We also had an Infinispan Client extension.  With the new Infinispan Cache extension, you can now use the cache extension approach and use Infinispan as a backend.  And, you know us by now, we baked a just for you.   WEBSOCKETS.NEXT  WebSockets.next is our… next (tadam!)-gen WebSockets extension (both client and server).  It is experimental at the moment and we are making steady progress on it with each release.  In Quarkus 3.11, we added:   * The ability to easily define WebSockets clients.   * An initial version of the security integration (we will add more features in    future releases).   QUARKUS:RUN AND DEV SERVICES  ./mvnw quarkus:run is a convenient way to start your Quarkus application. It is now able to start Dev Services so that your favorite service can be started automatically as a container.   SECURITY  As for each release, this release comes with several new security features including:   * Support for OIDC session expired page   * The introduction of OidcRedirectFilter, which allows to customize OIDC    redirects   QUARKUS CXF  Quarkus CXF 3.11.0 was released and is now available in . Check for more information about what is new in this release.   FULL CHANGELOG  You can get the full changelog of and on GitHub.   CONTRIBUTORS  The Quarkus community is growing and has now . Many many thanks to each and everyone of them.  In particular for the 3.11 release, thanks to Alasdair Preston, Aleksandr Nichiporuk, Ales Justin, Alexey Loubyansky, Andy Damevin, Antonio Musarra, antonwiens, Arcane418, asjervanasten, Bruno Baptista, Chris Laprun, cknoblauch, Clement Escoffier, Danny Gräf, David M. Lloyd, emile, Eric Deandrea, Foivos Zakkak, Fouad Almalki, George Gastaldi, Georgios Andrianakis, glefloch, Guillaume Smet, Gwenneg Lepage, Holly Cummins, Ivan Puntev, Jakub Jedlicka, Jan Martiska, Juan Zuriaga, Katia Aresti, Ladislav Thon, Lin Gao, Lorenzo Vannucchi, Loïc Mathieu, Marc Nuri, Marek Skacelik, mariofusco, Martin Kouba, Matej Novotny, Max Rydahl Andersen, Michal Maléř, Michal Vavřík, Nathan Erwin, Nithanim, Ozan Gunalp, Phillip Krüger, punkepa, Roberto Cortez, Rostislav Svoboda, Sanne Grinovero, Sauli Ketola, Selim, Sergey Beryozkin, Stuart Douglas, Stéphane Épardaud, Thomas Segismont, Vincent Sourin, Vinicius A. Santos, vkn, Yoann Rodière, and Zheng Feng.   COME JOIN US  We value your feedback a lot so please report bugs, ask for improvements… Let’s build something great together!  If you are a Quarkus user or just curious, don’t be shy and join our welcoming community:   * provide feedback on ;   * craft some code and ;   * discuss with us on and on the ;   * ask your questions on ."
}