{
  "title": "Meet Keycloak at KubeCon Chicago in Nov 2023",
  "link": "https://www.keycloak.org/2023/10/keycloak-kubeconf-chicago",
  "author": [
    {
      "name": "Kamesh Akella",
      "avatar": null
    }
  ],
  "date": "2023-10-10T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "We are thrilled to announce that Keycloak will be at KubeCon Chicago 2023. There are several Keycloak specific sessions lined up during this Conference, and we will be hosting a Kiosk at the Project Pavilion at KubeCon 2023 Chicago.   WHAT IS KUBECON?  As some of you might already know, KubeCon is a fast-growing Cloud Native tech conference that is expected to have 8,000 developers, architects, and technical leaders onsite as well as thousands of participants virtually.  KubeCon Chicago will be held from Nov. 6th, 2023 through Nov. 9th, 2023, with many of the co-located events happening on Monday Nov 6th, 2023.   KEYCLOAK COMMUNITY MEET & GREET AT THE PROJECT PAVILION  , , and will be at the Keycloak kiosk at the Project Pavilion. This is a great chance to meet people who use Keycloak, contribute to Keycloak, take our survey about new Keycloak features, and get some cool swag!  Keycloak Kiosk opening hours:   * Tuesday, November 7: 10:30 - 3:30 PM CST   * Wednesday, November 8: 10:30 - 2:00 PM CST   * Thursday, November 9: 10:30 - 12:30 PM CST   OPENSHIFT COMMONS GATHERING  The OpenShift Commons Gathering happens on Monday (Nov. 6th, 2023) and builds connections and collaboration across OpenShift communities, projects and stakeholders. Some maintainers from the Keycloak development team will be here during the afternoon. This gives a chance for more community Keycloak maintainers, contributors, and users to meet and share their ideas or just hang out. Access to the OpenShift Commons event is free and does not require a paid KubeCon ticket, .   KEYCLOAK SPECIFIC EVENTS AT KUBECON  Below are some Keycloak specific events that the attendees both in-person and virtually can plan to attend.   * Tuesday, November 7, 11:00am - 11:35am CST(UTC-6)        By Alexander Schwartz, Red Hat & Takashi Norimatsu, Hitachi, Ltd.   * Tuesday, November 7, 11:55am - 12:30pm CST(UTC-6)        By Yoshiyuki Tabata, Hitachi, Ltd.   * Tuesday, November 7, 2:30pm - 4:00pm CST(UTC-6)        By Alexander Schwartz & Michal Hajas, Red Hat   * Wednesday, November 8, 11:55am - 12:30pm CST(UTC-6)        By Soojin Lee & Hoon Jo, Megazone  We’re preparing for KubeCon Chicago 2023 and can’t wait to connect with our community. Mark your calendars and join us.  See you in Chicago!"
}