{
  "title": "Keycloak 26.3.0 released",
  "link": "https://www.keycloak.org/2025/07/keycloak-2630-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2025-07-03T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   HIGHLIGHTS  This release delivers advancements to optimize your system and improve the experience of users, developers and administrators:   * Account recovery with 2FA recovery codes, protecting users from lockout.   * Simplified experiences for application developers with streamlined    WebAuthn/Passkey registration and simplified account linking to identity    providers via application initiated actions.   * Broader connectivity with the ability to broker with any OAuth 2.0 compliant    authorization server, and enhanced trusted email verification for OpenID    Connect providers.   * Asynchronous logging for higher throughput and lower latency, ensuring more    efficient deployments.   * For administrators, experimental rolling updates for patch releases mean    minimized downtime and smoother upgrades.  Read on to learn more about each new feature, and if you are upgrading from a previous release of Keycloak.   RECOVERING YOUR ACCOUNT IF YOU LOSE YOUR 2FA CREDENTIALS  When using for example a one-time-password (OTP) generators as a second factor for authenticating users (2FA), a user can get locked out of their account when they, for example, lose their phone that contains the OTP generator. To prepare for such a case, the recovery codes feature allows users to print a set of recovery codes as an additional second factor. If the recovery codes are then allowed as an alternative 2FA in the login flow, they can be used instead of the OTP generated passwords.  With this release, the recovery codes feature is promoted from preview to a supported feature. For newly created realms, the browser flow now includes the Recovery Authentication Code Form as Disabled, and it can be switched to Alternative by admins if they want to use this feature.  For more information about this 2FA method, see the chapter in the Server Administration Guide.   PERFORMANCE IMPROVEMENTS TO IMPORT, EXPORT AND MIGRATION  The time it takes to run imports, exports or migrations involving a large number of realms has been improved. There is no longer a cumulative performance degradation for each additional realm processed.   SIMPLIFIED REGISTRATION FOR WEBAUTHN AND PASSKEYS  Both WebAuthn Register actions (webauthn-register and webauthn-register-passwordless) which are also used for Passkeys now support a parameter skip_if_exists when initiated by the application (AIA).  This should make it more convenient to use the AIA in scenarios where a user has already set up WebAuthn or Passkeys. The parameter allows skipping the action if the user already has a credential of that type.  For more information, see the chapter in the Server Administration Guide.   SIMPLIFIED LINKING OF THE USER ACCOUNT TO AN IDENTITY PROVIDER  Client-initiated linking a user account to the identity provider is now based on application-initiated action (AIA) implementation. This functionality aligns configuring this functionality and simplifies the error handling the calling of the client application, making it more useful for a broader audience.  The custom protocol, which was previously used for client-initiated account linking, is now deprecated.   BROKERING WITH OAUTH V2 COMPLIANT AUTHORIZATION SERVERS  In previous releases Keycloak already supported federation with other OpenID Connect and SAML providers, as well as with several Social Providers like GitHub and Google which are based on OAuth 2.0.  The new OAuth 2.0 broker now closes the gap to federate with any OAuth 2.0 provider. This then allows you to federate, for example, with Amazon or other providers. As this is a generic provider, you will need to specify the different claims and a user info endpoint in the provider’s configuration.  For more information, see the chapter in the Server Administration Guide.   TRUSTED EMAIL VERIFICATION WHEN BROKERING OPENID CONNECT PROVIDERS  Until now, the OpenID Connect broker did not support the standard email_verified claim available from the ID Tokens issued by OpenID Connect Providers.  Starting with this release, Keycloak supports this standard claim as defined by the for federation.  Whenever users are federated for the first time or re-authenticating and if the Trust email setting is enabled, Sync Mode is set to FORCE and the provider sends the email_verified claim, the user account will have their email marked according to the email_verified claim. If the provider does not send the claim, it defaults to the original behavior and sets the email as verified.   ASYNCHRONOUS LOGGING FOR HIGHER THROUGHPUT AND LOWER LATENCY  All available log handlers now support asynchronous logging capabilities. Asynchronous logging helps deployments that require high throughput and low latency.  For more details on this opt-in feature, see the .   ROLLING UPDATES FOR PATCH RELEASES FOR MINIMIZED DOWNTIME (PREVIEW)  In the previous release, the Keycloak Operator was enhanced to support performing rolling updates of the Keycloak image if both images contain the same version. This is useful, for example, when switching to an optimized image, changing a theme or a provider source code.  In this release, we extended this to perform rolling update when the new image contains a future patch release from the same major.minor release stream as a preview feature. This can reduce the service’s downtime even further, as downtime is only needed when upgrading from a different minor or major version.  Read more on how to enable this feature in .   PASSKEYS INTEGRATED IN THE DEFAULT USERNAME FORMS  In this release Keycloak integrates Passkeys in the default authentications forms. A new switch Enable Passkeys is available in the configuration, Authentication → Policies → Webauthn Passwordless Policy, that seamlessly incorporates passkeys support to the realm. With just one click, Keycloak offers conditional and modal user interfaces in the default login forms to allow users to authenticate with a passkey.  The Passkeys feature is still in preview. Follow the guide to enable it.  For more information, see .   UPGRADING  Before upgrading refer to for a complete list of changes.   ALL RESOLVED ISSUES   NEW FEATURES   * Configurable probes in the Operator operator  * Add supported config options for additional datasources dist/quarkus  * Passkeys conditional UI: integration with username/password form    authentication/webauthn  * Name for OTP device should be unique account/api  * Possibility to log details and representation to the jboss-logging listener  * make MaxAuthAge configurable for required actions authentication  * Passkeys conditional UI: integration with independent username and password    form authentication/webauthn  * Deprecate or remove the current conditionalUI authenticator    authentication/webauthn   ENHANCEMENTS   * Get multiple users by Ids admin/api  * Support IPv6 only environments dist/quarkus  * Allow Keycloak operator to parameterize the Service annotations and labels  * Temporarily Locked out users change the enabled flag of the user account/api  * Support Syslog async properties dist/quarkus  * Admin-UI: move PKCE Code Challenge Method setting from Advanced to Settings    tab  * Migration progress missing  * Remove CACHE_EMBEDDED_REMOTE_STORE Feature  * Ensure Client Initiated Account Linking behaves like other Application    Initiated Actions authentication  * Change User details page drop-down filter to make it easier to find the    'admin' role admin/ui  * Remove user event types from admin UI is unusable admin/ui  * Add ability for Quick Theme to import theme from a jar admin/ui  * Quick Theme should allow naming the jar before download admin/ui  * Add more validation for proxy-headers  * Auto submit the \"Organization Identity-First Login\" form with pre-filled    username field organizations  * Enhance mapping from env variables to wildcards  * Add `count` endpoint for organizations organizations  * Make `ThemeManagerFactory` into a proper SPI so that it can be    accessed/overridden core  * Create CacheRemoteConfigProvider  * Create CacheEmbeddedConfigProvider  * Support Asynchronous logging  * Improve Dutch translation for Theme base/login and base/email translations  * Key generation for client authentication is always RSA 2048 with a 10-year    validity, regardless of the selected algorithm authentication  * Client secret generation provides lower than expected entropy authentication  * Improve migration performance core  * Access Token IDs have less than 128 bits of entropy core  * Add feedback when user sync process is triggered in user federation  * Allow logging of slow database operations  * Upgrade command rolling updates for patch releases / step 1: experimental  * Upgrade command rolling updates for patch releases / step 2: preview  * Clarify upgrade instructions  * Allow setting locale when edit mode is `READ_ONLY`  * Make recovery codes supported authentication  * Change the title for Grafana dashboards guide to plural docs  * Document operator `Auto` update strategy when used with `podTemplate`  * Standardize introductory text in Keycloak guides  * Update LDAP configuration with a hint how to enable password hashing in    ApacheDS  * Make distribution startup timeout configurable testsuite  * Add description to groups  * Ability to skip AIA for adding WebAuthn security key in case that user    already has one authentication  * Better tooltip for Strategy to increase wait time in brute force settings  * Polishing recovery codes authentication  * Use required action configuration instead of password policy for warning    threshold authentication  * Should we improve metadata of recovery code credential? authentication  * Keycloak Operator: TTL for KeycloakRealmImport jobs docs  * Message bundle hot reloading  * Clarify when to use podman docs  * Fix Securing Apps links to adapters docs  * Email server credentials can be harvested through host/port manipulation    admin/api  * Fix doc link to FGAP v1 docs  * Apply edits to Operators Guide docs  * Change discovery in Kubernetes to `jdbc-ping`  * JGroups: Switch to \"per-destination\" bundler for `jdbc-ping`  * Protocol `openid-connect` should be selected as default for ClientScopes    oid4vc  * Edit Observability Guide docs  * Make slow SQL and SQL comment prefix configurable  * Fix callouts in Operator guide docs  * Build user representations when searching based on the user profile settings    user-profile  * OpenTelemetry Tracing: Spans as part of the \"commit\" should be nested    dist/quarkus  * OpenTelementry Tracing: Show calls within a rest resource as nested    dist/quarkus  * Sessions from Infinispan should be mapped lazily for the Admin UI  * Return only manage permissions when listing users via administration console  * Speed up Infinispan list of all sessions be more eagerly remove old client    sessions  * Pass notifications in batches to remote and local ISPN cache infinispan  * When logging in, all client sessions are loaded which is slow oidc  * Add re-authentication when updating email via UPDATE_EMAIL feature  * Redirect request from wrong version to the right version  * Docs: server_admin/topics/clients/oidc/proc-using-a-service-account.adoc oidc  * Revise DPoP Codes - refactor retrieveDPoPHeaderIfPresent method oidc  * Document that a shell wrapper must not start replace PID 1 in containers  * Revise DPoP Codes - refactor remove unused methods oidc  * Revise Client Policies Codes - AbstractClientPoliciesTest oidc  * Improve JGroups network bind address documetion  * Identity provider with FORCE sync mode does not detect verified email change    identity-brokering  * Revise Client Policies Codes - ClientPoliciesAdminTest oidc  * Revise Client Policies Codes - ClientPoliciesConditionTest oidc  * Add missing id attributes for button elements of keycloak.v2 login theme  * Create a POC of running 2 containers in the new testsuite  * Create test cases for OIDC flows  * Make the checkbox \"Sign out from other devices\" unchecked by default    authentication  * Revise Client Policies Codes - ClientPoliciesExecutorTest oidc  * Revise Client Policies Codes - ClientPoliciesExtendedEventTest oidc  * Unnecessary boxing/unboxing to parse a primitive. SAST saml  * Revise Client Policies Codes - ClientPoliciesLoadUpdateTest oidc  * Revise Client Policies Codes - ClientPoliciesTest oidc  * Revise Client Policies Codes - SecureRedirectUrisEnforcerExecutorTest oidc  * Passkeys conditional UI: integration with the organization authenticator    authentication/webauthn  * Upgrade webauthn4j to a newer version authentication/webauthn  * Throw an exception if transport mTLS keystore or Truststore does not exist  * Unrelated Types. SAST  * Potential thread safety Issue with lazy init of transformerFactory at    TransformerUtil. SAST  * Serialization issue in SAMLEntityAttributesParser - no void constructor in    superclass. SAST  * Abbreviate text in PKCE method configuration label in OIDC Client    configuration admin/ui  * Revise Client Policies Codes - OAuth 2.1 tests oidc  * Revise Client Policies Codes - FAPI1Test oidc  * Revise Client Policies Codes - FAPI2Test oidc  * Revise Client Policies Codes - FAPICIBATest oidc  * Sign of a bad copy/paste in logging of usserSessionLimitsAuthenticator    authentication  * Support more i18n keys for messages_ru.properties  * Refactor the key value input so that it has an override for key and value    component  * Upgrade to Infinispan 15.0.15  * Upgrade Aurora PostgreSQL to a supported release  * Document security implications of Keycloak CR operator  * Icon for default role should have a separator to the role name admin/ui  * ServerInfo View in Admin-Console should show CPU information  * Make `ProviderConfigurationBuilder` fail when a duplicate property is added.  * Support all i18n keys for messages_ru.properties translations  * Update links specs in OIDC guide docs  * Add link to OIDC Discovery Spec in the documentation of the certs endpoint    oidc  * Add templates for release notes and migration guide docs  * Review Profile makes users prone to phishing attacks authentication  * add (ky )kyrgyz language support translations  * Default to num_owners=2 when the persistent-user-sessions feature is disabled    infinispan  * Clarify OpenShift v4 Identity Provider instructions  * When redirecting old resource versions, keep query parameters  * Clarify FIPS instructions  * Add clarifying language around jgroups failure detection ports  * Synchronization of Polish language in login template translations  * Add missing translations in email and account theme for Polish lang    translations  * Update documentation about volatile sessions  * [docs] fix spelling error in hostname.adoc  * Documentation for passkeys for 26.3.0 authentication  * Update javadoc of java admin-client for Keycloak 26.3 admin/client-java  * Make abstract class AbstractUserRoleMappingMapper public   BUGS   * Passkey \"Avoid same authenticator registration\" doesn't work    authentication/webauthn  * OpenAPI spec: Missing attributes in ClientPolicyConditionRepresentation and    ClientPolicyExecutorRepresentation schemas admin/api  * account/ui spinner use patternfly v3 classes instead of patternfly v5 classes    account/ui  * Amazon Identity Provider does not accept scope = openid and Keycloak always    sets it identity-brokering  * Double click on social provider link causes page has expired error login/ui  * wrong redirect after login timeout for parallel logins authentication  * [Keycloak CI] - User Federation Tests -    LDAPUserProfileTest.testMultipleLDAPProviders ci  * \"identity-provider-redirector\" does not forward LOGIN_HINT of authentication    session authentication  * Social login - Instagram Login test fails, API changed ci  * Keycloak container incorrectly read CGroups settings on Kernel 6.12    dist/quarkus  * Login UI edit profile textarea doesn't have styles applied login/ui  * Localization: when the user has forgotten the password, the email is sent in    default language, instead of the selected one login/ui  * Client scopes evaluate function shows sub claim in access token even if    \"basic\" client scope is not selected admin/ui  * External IDP error during Step-Up Authentication does no longer route back to    browser flow authentication  * account-console no longer provides nonce/state parameter account/ui  * [Keycloak CI] - Quarkus IT (windows-latest, win) - QuarkusPropertiesDistTest    ci  * Unexpected Application Initiated Actions Cause Server Errors authentication  * LDAP group mapper skips configured filter and imports all groups with    memberOf strategy when fetching the user's groups ldap  * User Federation: Remove imported users modal has wrong text admin/ui  * Linking user in different browser doesn't work if original window/tab is    closed identity-brokering  * Realm context uses route and can't be used in libary admin/ui  * User Attribute option of SAML \"User Attribute Mapper for NameID\" should be    required admin/ui  * MSADUserAccountControlStorageMapper attempts to persist a userAccountControl    value of 0 on user create, resulting in LDAP error and incomplete user    provisioning ldap  * User email not registered when user has not the permission to edit his email    core  * Upload of JKS keystore fails with a server error admin/ui  * Temporary failure in name resolution with nip.io ci  * Unknown error on authentication-flow delete action admin/ui  * RawKeycloakDistribution exit code is always 0 testsuite  * Importing a realm from a directory fail if the realm contain organizations    with users. import-export  * Mail settings can't be provided via environment variables testsuite  * Disable user row if not allowed to delete admin/ui  * [FGAP] [UI] Permission search doesn't execute correct consequent search    request admin/fine-grained-permissions  * SAML client certificate not persisted admin/ui  * [Keycloak Operator CI] - Test remote (slow) - UpdateTest.testExplicitStrategy    ci  * JWK Subtypes fail when mapping JWK to PublicKey core  * Keycloak fails to start on MySQL Cluster due to missing primary key in    databasechangelog dist/quarkus  * Fix alignment of the 'Action' selectbox with the 'Enabled' switch for User    federation admin/ui  * Ldap federation seems to open and keep open a new thread/connection for each    ldap request ldap  * Update commands trigger build checks dist/quarkus  * Duplicate Key Violation When Reauthenticating After Account Deletion via    Google identity-brokering  * Dropdown search input is not cleared after selecting with mouse admin/ui  * Test coverage for count menthods when filtering    admin/fine-grained-permissions  * Password Policy Changes get overwritten in the UI admin/ui  * Keycloak statefulset is not mapped to any headless service if installed via    operator operator  * Make group required when selecting a specific group creating a premission    admin/ui  * `content.json`'s isVisible flags are ignored in `Root.tsx`'s `mapRoutes`    function, which makes the pages still accessible account/ui  * [Keycloak JS CI] Admin UI E2E tests on Firefox have failures ci  * Kerberos principal attribute value \"comes back\" when cleared. admin/ui  * Building docker image of keycloak with curl using 2 stage process hangs docs  * Test failures in CI in Chrome tests ci  * StatefulSet reconciliation infinitely looping operator  * Changing a password with the option log out all other sessions doesn't log    out offline sessions core  * [Organization] Failed authentication (ModelDuplicateException) when e-mail    duplicates are allowed on the realm organizations  * Client Credentials tab : \"Allow regex pattern comparison\" toggle is always    \"On\" on page load admin/ui  * Multi-stage docker builds fail --optimized validation dist/quarkus  * Bug: Hosted Domain Validation Logic Issue in Keycloak Google Identity    Provider identity-brokering  * Filtering of user- and admin-events by dateTo always returns empty results    admin/api  * [FGAP] AvailableRoleMappings do not consider all-clients permissions    admin/fine-grained-permissions  * IPv6 support: Broker tests failing with proxy configuration ci  * Downstream docs have duplicate ID on sampling docs  * Blocking issue with increasing JVM thread count after migrating from 26.0.8    to 26.1.4 infinispan  * Permission details sometimes don't show the name of the client    admin/fine-grained-permissions  * [Docs] Broken link in ExternalLinksTest for importmap docs  * Home button always redirects to master realm when permission denied admin/ui  * UI: Readonly/disabled profile form input fields are visually    indistinguishable from active fields account/ui  * Liquibase checksum mismatch when upgrading from Keycloak ≤ 22.0.4 directly to    26.2.x storage  * Missing null checks in IdentityProviderResource lead to NPE admin/api  * Admin UI test \"Enable user events\" breaks as event metadata has changed    admin/ui  * [26.2.3/26.1.5] Regression: ClientList value is empty in UI for Custom    UserStorageProviderFactory admin/ui  * Authentication request can fail with `unknown_error` authentication  * JpaRealmProvider getGroupByName return group duplicate due to change of    comparison (like vs equal) ldap  * Keycloak operator with update strategy to Auto: missing imagePullSecrets    operator  * After migrating to newer Keycloak, token refreshes using inherited offline    sessions return access tokens with invalid exp value oidc  * Setting batch size to 0 in LDAP provider with pagination enabled leads to NPE    ldap  * Keycloak 26.2.0 UI Performance Degradation admin/ui  * Fine-grained-permssion v2 Display problem admin/fine-grained-permissions  * UserInfo request fails by using an access token obtained in Hybrid flow with    offline_access scope oidc  * Keycloak 26.2.0 can't authenticate to the H2 database after the upgrade core  * After import of keys an export doesn't include these values admin/ui  * Missing iteration key property in SigningIn Page account/ui  * Optimized startup fails from    `kc.spi-connections-http-client-default-expect-continue-enabled` passed at    runtime dist/quarkus  * Issue with SSL and `CertificatereloadManager` in Keycloak 26.2 when using    Istio infinispan  * Redirects to admin endpoint 404s on hostname-admin / request scheme mismatch    core  * Release note 26.2.0 has broken link docs  * jwks_uri endpoint returns content-type as \"application/json\" instead of    \"application/jwk+json\" or \"application/jwk-set+json\" oidc  * Evaluate client scopes can corrupt UI completely admin/ui  * [Operator CI] - Test remote (slow) ci  * [Keycloak CI] - FIPS UT - Run crypto tests ci  * Authorization Code Flow Fails Scope Validation After Credential Definition    Migration to Realm Level oid4vc  * Getting Started Podman: We are sorry... HTTPS required docs  * [FGAP] [UI] Searching for permissions doesn't allow to search for all group    permissions admin/fine-grained-permissions  * Evaluation should consider roles granted to the user    admin/fine-grained-permissions  * Quick theme: logo is undefined if not set admin/ui  * [quarkus-next] TestEngine with ID 'junit-jupiter' failed to discover tests    dist/quarkus  * duplicate key value violates unique constraint \"constraint_offl_cl_ses_pk3\"    infinispan  * Uncaught server error during organization update when name already exists    organizations  * Groups view: Filter/search bar disappears and groups not shown after clearing    empty search results admin/ui  * Oracle driver problems in keycloak 26.2.1 dependencies  * Account console: defaultLocale item in select locale field account/ui  * Wrong UDP jgroups metric name docs  * Serverinfo response grows over time admin/api  * Quarkus devtools dependencies in 26.2.x dependencies  * Deletion of a role is slow when when there are a lot of roles in the database    core  * Duplicate user entries when searching custom attributes core  * Admin E2E tests ignores `RETRY_COUNT` environment variable admin/ui  * Keycloak does not take into account value request parameter in the claims    request for acr claim authentication  * [OID4VCI] Documentation Errors docs  * Avoid a NPE at    org.keycloak.email.freemarker.beans.ProfileBean#getOrganizations when feature    \"organization\" is disabled organizations  * Aurora DB should not update automatically to the latest minor version ci  * Inconsistent \"grant_types\" vs \"grantTypes\" Naming Causes GrantTypeCondition    to Always Fail core  * SLO measurement should mention a month as a period docs  * Tests failing with embedded undertow due the infinispan testsuite  * Ghost user entries in database from ldap causes import errors ldap  * CVE-2025-3910 Two factor authentication bypass  * CVE-2025-3501 Keycloak hostname verification  * Aggregated policy: Cannot select policies that do not appear in the drop-down    list admin/ui  * Client Scope with mapper Organization Membership - claim disappears as soon    as user is member of more than one Organisation organizations  * Client Scope with mapper Organization Membership - organizations claim    disappears when Include in token scope is off organizations  * Flaky test:    org.keycloak.testsuite.model.session.OfflineSessionPersistenceTest#testPersistenceMultipleNodesClientSessionsAtRandomNode    ci  * Non-closing HTML tag in footer example docs  * quarkus runtime options are treated as buildtime options dist/quarkus  * JGroups errors when running a containerized Keycloak in Strict FIPS mode and    with Istio infinispan  * Typos in French login and email messages templates translations  * Scheduled Task cannot access realm when feature fpap:v2 is active, but realm    has it not configured admin/fine-grained-permissions  * Inconsistent \"Forgot Password\" behavior reveals user account information    login/ui  * Incorrect tooltip over enabled features admin/ui  * Check if suspicious log about CORS is correct  * [26.2.3/26.1.5] Regression: empty ClientList in UI for Custom    UserStorageProvider admin/ui  * UI does not show user's attributes after reentering the Attributes TAB    admin/ui  * Update Job Pod is listed in the keycloak discovery service operator  * Refreshed tokens are not persisted for IDP token exchange token-exchange  * UI does not show organization's attributes after reentering the Attributes    TAB account/ui  * Autocomplete in Mapper type of user federation broken admin/ui  * Forms IT tests breaks with Chrome 136.0.7103.59 ci  * Inconsistency in User enabled status in Rest query results. core  * Enabling \"HTTP-POST binding response\" is not reflected in the SP metadata    saml  * Error when requesting token inspection for a access token requested by a    offline token authorization-services  * Unable to change the OTP hash algorithm admin/ui  * Keycloak not using custom Infinispan config infinispan  * Can't change locale on expired page login/ui  * Duplicate validation message “Please specify username.” shown on login form    login/ui  * Fetching 1250 group children much slower in v26 vs. v25 admin/api  * Hide update email link in account console when email is read-only in user    profile user-profile  * Clicking on the jump links removes the localization of the UI admin/ui  * Authorization documentation shows the wrong view authorization-services  * Recreate update is not scaling down the statefulset to zero operator  * Users Credentials tab crashes on orphan LDAP user admin/ui  * User listing broken because of missing `is_temporary_admin` attribute    admin/ui  * Hibernate LazyInitializationException when deleting client with    CompositeRoles core  * POST realm API returns 400 on conflict instead of 409 in version 26.2.4    admin/api  * ModelDuplicateException since Keycloak v26 when logging into Keycloak core  * SAML certificate in UI not refreshed after keystore import account/ui  * SMTP password overwritten with asterisks core  * Client sessions are not cached when loaded from the database core  * Documentation has outdated link to the \"latest\" branch of quickstarts docs  * [KEYCLOAK CI] - AuroraDB IT - Create EC2 runner instance ci  * Do not show warning ISPN000312: Lost data because of graceful leaver    infinispan  * Custom classes for checkbox are not applied on password reset form in    keycloak.v2 login theme login/ui  * [FGAP] Clients empty when using role based policy and roles inherited from    groups admin/fine-grained-permissions  * [Keycloak CI] - Several failures HTTP response code 429 - too many requests    ci  * MigrationModel duplicate entry on Recreate Upgrade in Cluster with 2+ nodes    dist/quarkus  * JS CI fails with merging playwright reports admin/ui  * Missing Quarkus flag for syslog logging dist/quarkus  * Missing angle bracket authentication  * Searching user by attributes force an exact request even if not asked    admin/ui  * Liquibase update failed from KC 26.1 to KC 26.2 with PostgreSQL JDBC driver    42.7.5 storage  * Admin UI key permissionPoliciesHelp possible typo admin/ui  * Admin UI doesn't use conditionsHelpItem message key admin/ui  * ModelDuplicateException on next login after deleting an account storage  * Locale set to English even when only one Locale is enabled admin/ui  * Admin UI shows message \"Imported users have been removed\" twice admin/ui  * Operator error: desiredPullSecrets is null operator  * LDAP Edit mode option is required but not marked admin/ui  * [Keycloak JavaScript CI] - Admin UI E2E (firefox) ci  * [Keycloak CI] - Cookies Tests - KcOidcBrokerTokenExchangeTest  * Allow mapping Admin roles to server administrator only    admin/fine-grained-permissions  * Custom tabs implementing UiTabProvider/UiTabProviderFactory not displayed    since KC26.2.0 admin/ui  * Change connection settings totle to OAuth2 settings  * Cache TLS is not available with protocol UDP after upgrading from 26.2.4 to    26.2.5 infinispan  * Flaky test:    org.keycloak.testsuite.webauthn.account.WebAuthnSigningInTest#checkAuthenticatorTimeLocale    ci  * Federated user IDs are not correctly evicted from cache storage  * Make UPDATE_TIME unique for MIGRATION_MODEL table  * Emphasize using StatefulSet instead of Deployment operator  * Error creating user in Windows Active Directory over LDAP ldap  * [Keycloak Operator CI] - Test OLM Installation ci  * NPE during external-internal token exchange in case that user exists    token-exchange  * Two same tests in KcOidcBrokerTokenExchangeTest testsuite  * Unable to set LoA field in auth-flow-enforcer core  * Transparent filter panel in Admin > Events > Search events form admin/ui  * Incorrect placeholder for \"delete multiple users\" title in German translation    translations  * Avoid unbalanced curly braces in message properties translations  * Brute force detection permanent lockout flag not shown for users    auto-unlocked after temporary lockout admin/ui  * SQL error when logging in for first time (per user) after Keycloak upgrade    core  * Admin UI doesn't show client names from resource bundle admin/ui  * Client Registration with fake scope oidc  * Documentation of Argon2 hash-length configuration property is incorrect.    authentication  * `UserStorageManager.getUserById` called multiple times on `POST    /realms/{realm}/protocol/{protocol}/token` storage  * Setting of `type` of `Argon2PasswordHashProviderFactory` is incorrect,    authentication  * PasswordHashingTest#testPasswordRehashedWhenCredentialImportedWithDifferentKeySize    fails to successfully log in core  * Capitalize each word of the string \"security admin console\"  * Case sensitive Organization/IDP linking on domain organizations  * LDAP: error code 19 - pwdChangedTime: no user modification allowed ldap  * Webauthn policy data resets to previous state after binding flow admin/ui  * Account UI goBack link doesn't render when referrer query string is set    account/ui  * [Keycloak CI] - Windows: local maven repository error ci  * Issue with Handling Negative Values in Certain Fields of Brute Force    Detection authentication  * [Keycloak-Operator]: Rolling Updates -- Strategy=Auto, operator error    keycloak-update-job is invalid -- Strategy=Explicit, operator always replaces    operator  * Labeler fails to set version of parent issue ci  * Outdated information in HA Keycloak deployment docs  * Failing WebAuthn IT (chrome) / WebAuthnSigningInTest.passwordlessWebAuthnTest    authentication/webauthn  * Multiple QuarkusJpaUpdaterProvider calls during boot dist/quarkus  * Missing highlighting of deprecated and disabled-by-default features admin/ui  * Unable to retrieve `attributes` with organization get members endpoint    admin/api  * Link to dynamic client registration section is broken in docs oidc  * Compilation error in AbstractWebAuthnAccountTest testsuite  * WebAuthn Passwordless Policy Timeout Field Causes Syntax Error When Value    Exceeds 1000 Seconds Due to Locale-Specific Number Formatting in FTL    Generated JavaScript adapter/javascript  * Federation unlink failure message contains double single quotes translations  * Missing adjustment about offline session caches for volatile sessions    infinispan  * On change of language, confirmation is shown in old language account/ui  * Creating a user profile attribute \"displayName\" does not work as expected.    user-profile  * Account UI e2e tests do not run in CI account/ui  * Authentication flows documentation should match new GUI docs  * DefaultLazyLoader is not thread safe, but is used in a shared instance of    CachedRealm infinispan  * Nightly build shows outdated information on the Keycloak website docs  * UI Customization missing footer example admin/ui  * Account console reports duplicate keys in development mode account/ui  * Negative expiration for token exchange using an offline session    token-exchange  * Translation key missing from Greek translations. translations  * Front logout channel broken in 26.2.5 for saml saml  * Potential copy-paste issue in PersistentClientSessionEntity.java storage  * quarkus-next: update Quarkus snapshots url dist/quarkus  * Multiple resources that match same URI with different scope cause    inconsistent authorization response authorization-services  * Allow passkeys login when user has no password credential    authentication/webauthn"
}