{
  "title": "DevOpsDays Raleigh 2022 - Talking Architecture and Career",
  "link": "http://www.schabell.org/2022/02/devopsdays-raleigh-2022-architecture-and-career.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-02-14T06:00:00.007Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": " It's been some years since , mostly due to the worldly situation and travel restrictions, but thought this year was a great time to jump back in.  The 2022 edition will be held on April 13-14 in Raleigh, NC. You can and join the fun for a really interesting array of talks and workshops.   I'm going to give it a good shot this year and have submitted two sessions and a workshop.   The first session is a simple and yet motivational talk based on a theme that I've used before in keynotes to open several other conferences. It's relevant to all parts of our industry so I've pushed it here with the focus on DevOps.   OPEN IS KEY TO YOUR DEVOPS CAREER  It's not coincidence. It's not luck. It's not going to happen by itself, so what's the secret sauce? Understanding what makes a DevOps career in open source grow, what choices are crucial, and what actions accelerate or damage your future are sometimes hard to grasp. Learning to position, expand and grow your personal DevOps brand in the open source world is what this session provides. Be ready for your next step in open source. Join me for a story sharing a clear and easy to use plan for jump starting your DevOps open source career immediately.  The next session is more from my series called Talking Architecture Shop. This again will focus on architecture research for solutions in the DevOps domain that scale.    TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE DEVOPS AT SCALE   You've heard of large scale open source architectures, but have you ever wanted to take a serious look at these real life enterprise DevOps implementations that scale? This session takes attendees on a tour of multiple use cases covering DevOps challenges with hybrid cloud management with GitOps, DevOps in healthcare, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own online experiences. The attendee departs this session with a working knowledge of how to map general open source technologies to their solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop!   Finally, nothing beats a hands-on workshop, so I shared the DevOps Heroes workshop that I presented back in 2019, but updated for this go around.   CREATING REAL DEVOPS HEROES - ADDING PROCESS AUTOMATION TO TOOLBOX  DevOps is more than the process of automating your CI/CD pipelines to generate code and deployment artefacts for production. It's also about organizational change and integration of many subtle processes that help you to deliver applications seamlessly from development to production through your operations.  Let's unlock the power of process integration with a hands-on workshop using your own devices (laptops). We'll take you through the integration of an organizational process as part of your DevOps strategy. Step-by-step you'll build a domain model, creating an automated process, integrating user approval tasks and more using modern open source process automation tooling.   Bring your laptop as this is a hands on experience that takes you from nothing to a fully working DevOps supporting automation integration project. No experience in automation integration is required. Let's add a new tool to your development toolbox and get you jump started on automation integration that's supporting your organizations DevOps activities.  Fingers crossed that the selection committee likes what they see and we get invited to meet with you face to face. It's about time, don't you think?  "
}