{
  "title": "Hacktoberfest 2023",
  "link": "https://wildfly.org//news/2023/09/27/Hacktoberfest-2023/",
  "author": [
    {
      "name": "Ranabir Chakraborty",
      "avatar": null
    }
  ],
  "date": "2023-09-27T00:00:00.000Z",
  "feed_title": "WildFly",
  "content": "is back, and it’s time to channel your inner Open Source superhero! This annual event unites developers of all levels, from seasoned pros to enthusiastic beginners, in a shared mission to contribute to Open Source projects and celebrate the spirit of collaboration in software development. Join us for this month-long celebration of contributions as we work together, one pull request at a time.   WHAT IS HACKTOBERFEST?  Hacktoberfest is a month-long event in October that encourages Open Source contributors and developers worldwide to give back to the global tech community. It’s a fantastic opportunity for the contributors to showcase their skills and get to know about other Open Source communities.  To participate you simply need to:   * Register: on the official Hacktoberfest website to get started.   * Discover Projects: Explore the Hacktoberfest website to find a project that    sparks your interest. You can also check out the curated list of projects    we’ve prepared for you.   * Follow the Project guidelines: Read the respective Contributing Guide, Code    of Conduct, and follow best practices like forking the repository, creating a    new branch, and making a meaningful contribution.   * Contribute: Select an issue that matches your interest and start working on    it. You’ll have the option to have a tree planted in your name and a unique    digital reward as a token of appreciation.   GET STARTED WITH OUR PROJECTS  This list contains some really interesting projects that are under the WildFly umbrella, waiting for your magic touch. There’s something for everyone from Java to Ansible.   1. WildFly: WildFly is a powerful, modular, and lightweight application server     that empowers you to build amazing applications.           * Here are the , , and .   2. WildFly Elytron: WildFly Elytron is a set of APIs and SPIs for application     server security and client side security. Within the WildFly server, WildFly     Elytron is used to secure applications deployed to the server as well as     management access to the server. It is a standalone library that can also be     used in other Java server environments.           * Here are the , , and .           * For more details, check out WildFly Elytron’s Hacktoberfest .   3. Ansible Middleware: Ansible Middleware is a suite of supported content that     combines the power of Ansible automation with Red Hat’s Middleware     portfolio. It allows organizations to meet their business demands and     automate the installation, configuration, and management of Enterprise     Middleware.           * Here are the , , and .   4. Undertow: Undertow is a versatile and high-performance web server that     provides both blocking and non-blocking APIs based on NIO. Its modular     architecture allows you to build a web server tailored to your needs, from a     full Java EE servlet container to a low-level non-blocking handler.           * Here are the , , and .   5. WildFly Core: WildFly Core provides the core runtime that is used by the     Wildfly application server. This includes Modular class loading, Unified     management including domain mode, Basic deployment architecture, and CLI for     management.           * Here are the , , and .   6. Narayana: Narayana is a transactions toolkit that provides support for     applications using various standards-based transaction protocols. It’s an     essential component of the WildFly application server and continues to be     developed as a standalone transaction manager.           * Here are the , , and .   HOW TO REACH OUT TO US FOR HACKTOBERFEST RELATED QUERIES?  Please join our and reach out to us if you have any queries or need assistance. We’re here to ensure a smooth journey for you.  Let’s make Hacktoberfest 2023 the most exciting and impactful one yet! Your contributions matter, and together, we can make a difference."
}