{
  "title": "Red Hat Summit 2022 - Talking Architecture Shop series",
  "link": "http://www.schabell.org/2022/01/red-hat-summit-2022-talking-architecture-shop-series.html",
  "author": [
    {
      "name": "Eric D. Schabell",
      "avatar": null
    }
  ],
  "date": "2022-01-17T06:00:00.001Z",
  "feed_title": "Eric D. Schabell",
  "feed_avatar": "https://www.gravatar.com/avatar/c4b562a3796ce4736927992c6daa4567?s=50",
  "content": "   It's that time of year again when we get the call for papers!  I heard the call and thought this year would be a perfect time to go all in with sessions around our architectures based on a series of talks we've designed to showcase the various aspects we cover. Some are vertical aligned and others are just customer domains, but all of them include extensive research into how to implement successful architectures at scale.  Last week the call for papers closed and the internal committees are starting to churn through all of the excellent content they've been given. Sometime in March 2022 we should hear back from them.  How about a look at the various sessions we've put together where I'll be presenting with my good friends in the architecture team?  We've started a series called Talking Architecture Shop to host our various architectural explorations and they've been well received so far. For Red Hat Summit 2022 we've pushed the following into the selection process, with co-speakers listed and the name of the theme submitted into.   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE SUCCESS AT SCALE     You've heard of large scale open source architectures, but have you ever wanted to take a serious look at these real life enterprise implementations that scale? This session takes attendees on a tour of multiple use cases covering enterprise challenges like integration, optimisation, cloud adoption, hybrid cloud management, healthcare, retail, manufacturing, financial services, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own online experiences.    The attendee departs this session with a working knowledge of how to map general open source technologies to their solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Digital Transformation)   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE EDGE SUCCESS AT SCALE     You've heard of large scale open source architectures, but have you ever wanted to take a serious look at real life enterprise edge implementations that scale? This session takes attendees on a tour of multiple use cases for enterprise challenges on the edge with integration, telco, healthcare, manufacturing, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own edge experiences.    The attendee departs this session with a working knowledge of how to map general open source technologies to their own edge solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Emerging Technology) (with )   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE GITOPS SUCCESS AT SCALE   You've heard of large scale open source architectures, but have you ever wanted to take a serious look at these real life enterprise GitOps implementations that scale? This session takes attendees on a tour of multiple use cases for enterprise challenges using GitOps with integration, optimisation, hybrid cloud management, healthcare, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own operations and development experiences.    The attendee departs this session with a working knowledge of how to map general open source technologies to their own GitOps solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Developers) (with )   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE SAP SUCCESS AT SCALE     You've heard of large scale open source SAP architectures, but have you ever wanted to take a serious look at these real life enterprise implementations that scale? This session takes attendees on a tour of multiple use cases covering enterprise challenges with SAP around integration, optimisation, cloud adoption, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own online experiences.     The attendee departs this session with a working knowledge of how to map general open source technologies for their SAP architectural solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Digital Transformation) (with )   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE TELCO SUCCESS AT SCALE     You've heard of large scale open source architectures, but have you ever wanted to take a serious look at real life enterprise telco implementations that scale? This session takes attendees on a tour of multiple use cases for enterprise challenges in the telco domain with a look at use cases for integration, networks, 5G, hyperscalers, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own edge experiences.     The attendee departs this session with a working knowledge of how to map general open source technologies to their own telco solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Edge)  (with )   TALKING ARCHITECTURE SHOP - EXPLORING OPEN SOURCE PLATFORM SUCCESS AT SCALE     You've heard of large scale open source architectures, but have you ever wanted to take a serious look at real life enterprise platform implementations that scale? This session takes attendees on a tour of multiple use cases for enterprise challenges focused on platform use cases covering remote server management, cloud adoption, financial services, self-healing infrastructure, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own experiences.     The attendee departs this session with a working knowledge of how to map general open source technologies to their own platform solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Platforms) (with )   TALKING ARCHITECTURE SHOP - EXPLORING CLOUD SERVICES SUCCESS AT SCALE     You've heard of large scale open source architectures, but have you ever wanted to take a serious look at real life enterprise cloud services implementations that scale? This session takes attendees on a tour of multiple use cases for enterprise challenges focused on cloud services within use cases covering integration, healthcare, financial services, cloud services development, and much more. Not only are these architectures interesting, but they are successful real life implementations featuring open source technologies and power many of your own cloud services experiences.     The attendee departs this session with a working knowledge of how to map general open source technologies to their own cloud services solutions. Material covered is available freely online and attendees can use these solutions as starting points for aligning to their own solution architectures. Join us for an hour of power as we talk architecture shop! (Cloud Services) (with )  Here's hoping that we'll be having a face to face session in 2022 at Red Hat Summit and talking architecture shop! "
}