{
  "title": "Keycloak 19.0.2 released",
  "link": "https://www.keycloak.org/2022/09/keycloak-1902-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2022-09-14T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   MIGRATION FROM 18.0  Before you upgrade remember to backup your database. If you are not on the previous release refer to for a complete list of migration changes.   OPENID CONNECT LOGOUT PROMPT  At Keycloak 18.0.0, the logout is now compatible with the new OIDC specification, which changed the handling for the url parameters. However, to also remain compatible with earlier versions, a compatibility flag is introduced. See the for further information for the backwards compatibility option, which allows your application to still use the old format for the url parameters.  While the url parameters can now be configured to be compatible, there was still one incompatibility with keycloak 17 and earlier releases. If the user does not provide an valid idTokenHint, a logout prompt appears instead of a successful logout redirect. Therefore, a new compatibility flag suppress-logout-confirmation-screen is introduced to suppress the logout screen.  You can enable this parameter when you start the server by entering the following command:  bin/kc.[sh|bat] --spi-login-protocol-openid-connect-suppress-logout-confirmation-screen=true start  With this configuration, you can still use the logout endpoint without a user prompt.  Warning The backwards compatibility switch will be removed in some future version - probably Keycloak 23. You are encouraged to update your clients as soon as possible as described above rather than rely on this switch.   DEPLOYING SCRIPTS THROUGH SAML JAVASCRIPT PROTOCOL MAPPER  Until now, administrators, which used SAML javascript protocol mapper on their SAML clients or client scopes, were allowed to upload scripts to the server through the Keycloak Administration Console as well as through the RESTful Admin API.  For now on, this capability is disabled and users should deploy scripts directly to the server. This behaviour is aligned with other script based providers. For more details, please take a look at .   USERINFO ENDPOINT CHANGES  Error response changes  The UserInfo endpoint is now returning error responses fully compliant with (The OAuth 2.0 Authorization Framework: Bearer Token Usage). Error code and description (if available) are provided as WWW-Authenticate challenge attributes rather than JSON object fields. The responses will be the following, depending on the error condition:   * In case no access token is provided:        401 Unauthorized    WWW-Authenticate: Bearer realm=\"myrealm\"   * In case several methods are used simultaneously to provide an access token    (for example, Authorization header + POST access_token parameter), or POST    parameters are duplicated:        400 Bad Request    WWW-Authenticate: Bearer realm=\"myrealm\", error=\"invalid_request\", error_description=\"...\"   * In case an access token is missing openid scope:        403 Forbidden    WWW-Authenticate: Bearer realm=\"myrealm\", error=\"insufficient_scope\", error_description=\"Missing openid scope\"   * In case of inability to resolve cryptographic keys for UserInfo response    signing/encryption:        500 Internal Server Error   * In case of a token validation error, a 401 Unauthorized is returned in    combination with the invalid_token error code. This error includes user and    client related checks and actually captures all the remaining error cases:        401 Unauthorized    WWW-Authenticate: Bearer realm=\"myrealm\", error=\"invalid_token\", error_description=\"...\"  Other Changes   * It is now required for access tokens to have the openid scope, which is    stipulated by UserInfo being a feature specific to OpenID Connect and not    OAuth 2.0. If the openid scope is missing from the token, the request will be    denied with a 403 Forbidden (see above).   * UserInfo now checks the user status, and returns the invalid_token response    if the user is disabled.   ALL RESOLVED ISSUES   ENHANCEMENTS   * Document compatibility mode for oidc logout endpoint suppression    keycloak-documentation  * A flow can be created with seemly the same name of another keycloak-ui  * Sort the realm localization texts alphabetically keycloak-ui  * Better fine-grained permission support keycloak-ui section/groups  * Allow setting a URL to configure frontend and admin URLs keycloak    dist/quarkus  * Make compatibility mode for oidc logout endpoint fully compatible to previous    keyloak versions keycloak oidc  * Add basic auth compliant RFC 6749 keycloak   BUGS   * SAML javascript protocol mapper: disable uploading scripts through admin    console by default keycloak-documentation  * [UX Review] Add 3 new settings in the Advanced tab of OIDC client keycloak-ui    section/clients  * Navigation links cannot be opened in new tab keycloak-ui section/other  * View client > Client scopes > Setup > Removing client scope from the list is    not showing a standard Delete dialog keycloak-ui section/clients  * [UX Review] Mark the select option with a right mark keycloak-ui    section/authentication  * [Accessibility Review] Serious - Home page issues keycloak-ui section/other  * [Accessibility Review] Serious - Clients page issues keycloak-ui    section/clients  * [Accessibility Review] Serious - Client scopes page issues keycloak-ui    section/client scopes  * [UX Review] Consider changing the layout of Groups from table to tree view    keycloak-ui section/groups  * Removal of English language not possible keycloak-ui section/realm settings  * UI crash when lots of subgroups keycloak-ui section/groups  * Save/Revert toolbar covers content keycloak-ui section/clients  * Cannot see roles of user when lots of clients keycloak-ui section/clients  * New admin UI : no support for array in custom attributes keycloak-ui  * New admin console - Client credentials: Page is missing components    keycloak-ui section/clients  * [UX Review] Fine-tuning of the multiple values field keycloak-ui  * Identity Provider Mapper can not save name of Hardcoded Attribute keycloak-ui    section/identity providers  * [Fine grain admin permissions] Can't view the client details with the \"view\"    permission. Permission required: \"view-clients\" keycloak-ui section/other  * Constants for clientAuthenticationTypes differ from backend keycloak-ui    section/identity providers  * Fix forgotPassword label in the new admin console keycloak-ui section/realm    settings  * Importing realms is buggy with the new keycloak.v2 theme keycloak-ui    section/realm settings  * \"Unexpected token u in JSON at position 0\" error when opening identity    provider mappers created in a previous Keycloak version keycloak-ui    section/identity providers  * Missing Options \"Use PKCE\" and \"PKCE Method\" in new Admin UI keycloak-ui    section/identity providers  * Homepage URL is wrong in Client list in ClientSection keycloak-ui    section/clients  * User Storage Provider settings not visible in admin UI keycloak-ui    section/user federation  * The new GUI does not support -http-relative-path keycloak-ui section/other  * Cancel button wrong variant keycloak-ui section/realm settings  * There is no spacing between the table row and navigation. keycloak-ui    section/users  * Identity provider \"Sync Mode\" not visible keycloak-ui  * Admin2: Fine Grained permissions/policies are ignored keycloak-ui    section/other  * Realm Email doesn't default to port 25 keycloak-ui section/realm settings  * Group search endpoints don't return access. keycloak-ui section/groups  * Cannot update user on new Keycloak Administration Console theme keycloak-ui    section/users  * Assign roles filter causes crash keycloak-ui section/users  * Release failed due to missing javadoc and sources jar keycloak-ui  * PolicyEnforcer sometimes looses provided adapterconfig while executing    resource matching keycloak authorization-services  * Do not empty attributes if they are not provided when user profile is enabled    keycloak user-profile  * [Quarkus | CLI | Windows] `-` abbreviations not recognized for start, build    and start-dev keycloak dist/quarkus  * ConcurrentModificationException in script cache of JSPolicyProviderFactory    keycloak authorization-services  * Unable to configure URL scheme for admin console keycloak  * Clear expired events errors keycloak storage  * Failed to process template in Authentication SPI in v19.0.0 keycloak  * Align kc.bat with latest changes to kc.sh keycloak  * Health checks fail when using relative paths in 19.0.0-1 keycloak  * Old admin console does not find keycloak.js when url is not set with a    tailing / keycloak  * Can't set storage-deployment-state-version-seed for map storage via    environment variable keycloak storage  * `--optimized` is not supported by `kc.sh export` keycloak dist/quarkus  * Requests to health endpoint still dispatched to worker threads when    `http-relative-path` is set keycloak  * post_logout_redirect_uri causes \"invalid redirect_uri\" for clients created in    keycloak 19 with old admin console keycloak oidc  * Old administration console not loading keycloak admin/ui  * SAML javascript protocol mapper: disable uploading scripts through admin    console by default keycloak saml  * Credential validation not taking into account if the user is already cached    keycloak storage   UPGRADING  Before you upgrade remember to backup your database and check the for anything that may have changed."
}