{
  "title": "Quarkus 3.18 - Micrometer for WebSockets Next, Security WebAuthn based on WebAuthn4J, Kubernetes Client 7...",
  "link": "https://quarkus.io/blog/quarkus-3-18-1-released/",
  "author": [
    {
      "name": "Guillaume Smet",
      "avatar": null
    }
  ],
  "date": "2025-01-29T00:00:00.000Z",
  "feed_title": "Quarkus",
  "content": "Today, we released Quarkus 3.18, with two months worth of new features and enhancements.  It comes with a lot of enhancements and the following new features:   * - Integrate Micrometer with WebSockets Next   * - Reimplement security-webauthn on top of webauthn4j   * - OIDC and OIDC Client: Support JWT bearer client authentication using client    assertion loaded from filesystem   * - Support for OIDC mTLS binding   * - Support OidcProviderClient injection and token revocation   * - Add OIDC Redis Token State Manager extension   * - Allow to create static OIDC tenants programmatically   * - OIDC Dev Services and UI changes   * - TLS - Enable policy configuration for expired or not yet valid certificates   * - Add support for encrypted PKCS#8   * - Exclude uri from OpenTelemetry Tracing   * - Bump kubernetes-client-bom from 6.13.4 to 7.0.1   * - Introduce Report an Issue menu in DevUI   * - Add a Dev UI screen for Agroal datasources   * - Ability to configure extension dev mode JVM options   * - Support for dev-mode-only conditional dependencies  We are already hard at work preparing 3.19 and the upcoming 3.20 LTS.   UPDATE  To update to Quarkus 3.18, we recommend updating to the latest version of the Quarkus CLI and run:  quarkus update  Note that quarkus update can update your applications from any version of Quarkus (including 2.x) to Quarkus 3.18.  For more information about the adjustments you need to make to your applications, please refer to the .   WHAT’S NEW?   WEBSOCKETS.NEXT  Our next-generation WebSockets extension continues to improve with each version.  In 3.18, it comes with Micrometer integration.   SECURITY  You are used to it, each version comes with a lot of enhancements to our security layer, offering even more flexibility.  This time, it comes with the complete rewrite of our Security Webauthn extension to leverage the WebAuthn4J library (if you are using this extension, please have a look at the as a lot of things have changed), a lot of new features for OIDC, and improvements to our TLS registry:   * - Reimplement security-webauthn on top of webauthn4j   * - OIDC and OIDC Client: Support JWT bearer client authentication using client    assertion loaded from filesystem   * - Support for OIDC mTLS binding   * - Support OidcProviderClient injection and token revocation   * - Add OIDC Redis Token State Manager extension   * - Allow to create static OIDC tenants programmatically   * - OIDC Dev Services and UI changes   * - TLS - Enable policy configuration for expired or not yet valid certificates   * - Add support for encrypted PKCS#8   OPENTELEMETRY TRACING  When using OpenTelemetry Tracing, it happens quite often that you don’t want to collect any trace for a given URI.  3.18 comes with the quarkus.otel.traces.suppress-application-uris that allows to define URIs that are going to be ignored.  You can find more information about this new feature in the .   KUBERNETES CLIENT  The Kubernetes Client was upgraded to a major new version: Kubernetes Client 7.  You can find more information about this upgrade in our .   DEV UI  We polished our Dev UI with two new features:   * A screen to browse the tables exposes by your datasources   * A quick link to report an issue to the Quarkus project on GitHub   PREPARING OUR NEXT LTS  We are also preparing our next LTS with various initiatives:   * A lot of extensions were migrated to the new @ConfigMapping-based    configuration infrastructure (and this effort will continue in the next    versions).   * We are making enhancements related to startup time and initial memory (RSS)    usage.   * We are removing code that was deprecated for a long time.  Expect us to focus on polishing features and fixing issues for the upcoming 3.19 and 3.20.   PLATFORM COMPONENT UPGRADES  QUARKUS CXF  Quarkus CXF 3.18 was released and is now available in . Check the release notes for more information about what is new in this release.  CAMEL QUARKUS  Camel Quarkus has been upgraded to 3.18.0.   FULL CHANGELOG  You can get the full changelog of , , and on GitHub.   CONTRIBUTORS  The Quarkus community is growing and has now . Many many thanks to each and everyone of them.  In particular for the 3.18 release, thanks to Akulov S V, Ales Justin, Alex Martel, Alexander Pankin, Alexey Loubyansky, André Pantaleão, Andy Damevin, Ankush Saini, Antonio Musarra, Auri Munoz, Bassel Rachid, Blaz Mrak, Bruno Baptista, Bruno Marvin, Chris Laprun, Christian Ivanov, Christian Pieczewski, Clement Escoffier, Cristian Burlacu, Damien Clément d’Huart, Daniel Bobbert, Daniel Strobusch, Danilo Piazzalunga, David M. Lloyd, Davide D’Alto, Eduard Wagner, Emmanuel Ferdman, Eric Deandrea, Erik Mattheis, Fary Hurtado, Foivos Zakkak, Francesco Nigro, George Gastaldi, Georgios Andrianakis, Gianmarco Frangipane, Guillaume Smet, Gurubase.io, Harald Albers, HerrDerb, Holly Cummins, Inaki Villar, Ioannis Canellos, ivan.baricic, Jakub Jedlicka, Jan Martiska, Jeremie Bresson, Jochen Schalanda, Johnathan Gilday, Jorge Pinto, Jose, Julien Ponge, Katia Aresti, Ladislav Thon, Lars Andringa, Loïc Mathieu, luneo7, Maciej Lisowski, Marc Nuri, Marco Belladelli, Marco Bungart, Marco Collovati, Marek Skacelik, mariofusco, Martin Bartoš, Martin Kouba, Martin Panzer, Matej Novotny, Matheus Cruz, Max Rydahl Andersen, Michael Edgar, Michal Maléř, Michal Vavřík, Neon, Nuno Neto, ogomezdi, Ozan Gunalp, Ozzy Osborne, Peter Skopek, Phillip Krüger, rghara, Roberto Balarezo, Roberto Cortez, Rolfe Dlugy-Hegwer, Romain QUINIO, Rostislav Svoboda, row, Scott M Stark, Sergey Beryozkin, sergioruydev, Sola-ris, Stephan Strate, Stuart Douglas, Stéphane Épardaud, Thibault Meyer, Thomas Canava, tom, Trấn Nguyễn, vkn, xstefank, Yoann Rodière, Yoshikazu Nojima, zanmagerl, and Zheng Feng.   COME JOIN US  We value your feedback a lot so please report bugs, ask for improvements… Let’s build something great together!  If you are a Quarkus user or just curious, don’t be shy and join our welcoming community:   * provide feedback on ;   * craft some code and ;   * discuss with us on and on the ;   * ask your questions on ."
}