{
  "title": "WildFly 27 Beta1 is released!",
  "link": "https://wildfly.org//news/2022/09/29/WildFly26-Beta-Released/",
  "author": [
    {
      "name": "Brian Stansberry",
      "avatar": null
    }
  ],
  "date": "2022-09-29T00:00:00.000Z",
  "feed_title": "WildFly",
  "content": "I’m pleased to announce that the new WildFly and WildFly Preview 27.0.0.Beta1 releases are available for download at .   NEW AND NOTABLE  As I noted in , the key new thing in WildFly 27 is compatibility with the . Thanks so much to all the great WildFly contributors who worked so hard on our EE 10 journey!  Besides Jakarta EE 10 support, here are some of the other new features in this release.  Observability   * - A new tech preview 'Micrometer' subsystem (WildFly Preview only)  EJB   * - A new 'distributable-ejb' subsystem   *  — Support for use of an Infinispan cache as an EJB timer store  Security   * - Encryption support in the FileSystemSecurityRealm   * - Identity integrity support in the FileSystemSecurityRealm  Provisioning   * - A new 'embedded-activemq' Galleon layer for embedded broker messaging   * - A new 'hibernate-search' Galleon layer   *  — New 'singleton-local' and 'singleton-ha' Galleon layers  Major Component Upgrades vs WildFly 26.x  There have been numerous component upgrades related to WildFly’s transition from the javax namespace EE 8 to the jakarta namespace EE 10; too many to list here. However, besides those EE 10 driven updates, there are a number of other major component updates in WildFly 27 Beta1:   * Hibernate 6.1 replaces Hibernate 5.3   * Hibernate Search 6.1 replaces Hibernate Search 5.10   * Infinispan 14 replaces Infinispan 13   * JGroups 5.2 replaces JGroups 4.2   * RESTEasy 6.2 replaces RESTEasy 4.7   * Weld 5 replaces Weld 3.1   REMOVAL OF SUPPORT FOR EE 8 AND SE 8  As I discussed in my post, Jakarta EE 8 and Jakarta SE 8 are no longer supported beginning with the WildFly 27 series. Use of SE 11 or later is required, with SE 17 recommended. Testing on SE 19 is in progress.   RELEASE NOTES  The release notes for the release are . Note that this only covers the differences between 27 Beta1 and the recent 27 Alpha5; release notes for the 27 Alpha1 - 5 releases are available . Issues fixed in the numerous underlying WildFly Core 19.0 beta releases are listed .  Please try it out and give us your feedback, while we get to work on WildFly 27 Final!  Best regards,  Brian"
}