{
  "title": "Keycloak 20.0.3 released",
  "link": "https://www.keycloak.org/2023/01/keycloak-2003-released",
  "author": [
    {
      "name": null,
      "avatar": null
    }
  ],
  "date": "2023-01-12T00:00:00.000Z",
  "feed_title": "Keycloak Blog",
  "feed_avatar": "https://www.gravatar.com/avatar/87fe00619f08c241da8dfb23d907ffa2?s=50",
  "content": "To download the release go to .   MIGRATION FROM 19.0  Before you upgrade remember to backup your database. If you are not on the previous release refer to for a complete list of migration changes.   ALL RESOLVED ISSUES   BUGS   * User role mapping tab: Show effective client roles for a user keycloak-ui    section/users  * ProviderConfigProperty.MAP_TYPE error in new UI keycloak-ui section/identity    providers  * Unable to turn on \"Bypass identity confirmation\" keycloak-ui    section/authentication  * Adding Form sub-flow broken on admin v2 keycloak-ui section/authentication  * Custom User Provider SPI: There are no settings to configure the periodically    synchronization of users keycloak-ui section/user federation  * Assign roles to account - paging doesn't work keycloak-ui section/users  * Realm selector requires two clicks to select something keycloak-ui    section/realms  * User management -> User in 2 subgroups with the same group name assignment    does not work keycloak-ui section/users  * Invalid language tag error when changing realm localization settings    keycloak-ui section/realm settings  * `Missing \":type\" param` in the Events page when there are Client Scope events    keycloak-ui section/events  * Import client broken keycloak-ui section/clients  * New Admin Console only, unable to add client profile in the first client    policy keycloak-ui section/realm settings  * Disabling hostname strict in prod doesn't disable https keycloak dist/quarkus  * snakeyaml vulnerability GHSA-3mc7-4q67-w48m impacting CLI keycloak admin/cli  * The redirect URI cannot be verified during logout in the case when client was    removed keycloak oidc  * Wrong auth session id being used when validating auth session id cookies    keycloak core  * Update XStream to 1.4.20 to fix CVE-2022-40151 & CVE-2022-41966 keycloak  * Timeout when executing command PutMapCommand keycloak storage  * Set OkHttp to 4.10.0 in parent pom keycloak  * Lack of validation of access token on client registrations endpoint keycloak    oidc   UPGRADING  Before you upgrade remember to backup your database and check the for anything that may have changed."
}